name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:0
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"p0"
  type:"input"
  top:"p0"
  layer_param {
    idx:1
    out_0 {name:"p0:0",dtype:float32,shape:[1, 512]}
  }
}
layer {
  name:"p1"
  type:"input"
  top:"p1"
  layer_param {
    idx:2
    out_0 {name:"p1:0",dtype:float32,shape:[1000, 512]}
  }
}
layer {
  name:"p2"
  type:"input"
  top:"p2"
  layer_param {
    idx:3
    out_0 {name:"p2:0",dtype:float32,shape:[1000]}
  }
}
layer {
  name:"Node_8"
  type:"nn_dense"
  top:"Node_8"
  bottom:"p0"
  bottom:"p1"
  layer_param {
    idx:8
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512]}
    in_1 {name:"p1:0",dtype:float32,shape:[1000, 512]}
    out_0 {name:"Node_8:0",dtype:float32,shape:[1, 1000]}
    attrs {'units': 1000, 'out_dtype': ''}
  }
}
layer {
  name:"Node_10"
  type:"add"
  top:"Node_10"
  bottom:"Node_8"
  bottom:"p2"
  layer_param {
    idx:10
    in_0 {name:"Node_8:0",dtype:float32,shape:[1, 1000]}
    in_1 {name:"p2:0",dtype:float32,shape:[1000]}
    out_0 {name:"Node_10:0",dtype:float32,shape:[1, 1000]}
  }
}
layer {
  name:"Node_11"
  type:"function"
  top:"Node_11"
  bottom:"p0"
  bottom:"p1"
  bottom:"p2"
  bottom:"Node_10"
  layer_param {
    idx:11
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512]}
    in_1 {name:"p1:0",dtype:float32,shape:[1000, 512]}
    in_2 {name:"p2:0",dtype:float32,shape:[1000]}
    in_3 {name:"Node_10:0",dtype:float32,shape:[1, 1000]}
    out_0 {name:"Node_11:0",dtype:float32,shape:[1, 1000]}
  }
}
layer {
  name:"p0_1"
  type:"input"
  top:"p0_1"
  layer_param {
    idx:12
    out_0 {name:"p0:0",dtype:float32,shape:[1, 512, 1, 1]}
  }
}
layer {
  name:"Node_16"
  type:"reshape"
  top:"Node_16"
  bottom:"p0_1"
  layer_param {
    idx:16
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 1, 1]}
    out_0 {name:"Node_16:0",dtype:float32,shape:[1, 512, 1, 1]}
    attrs {'newshape': [0, -1, 1, 1]}
  }
}
layer {
  name:"Node_17"
  type:"squeeze"
  top:"Node_17"
  bottom:"Node_16"
  layer_param {
    idx:17
    in_0 {name:"Node_16:0",dtype:float32,shape:[1, 512, 1, 1]}
    out_0 {name:"Node_17:0",dtype:float32,shape:[1, 512]}
    attrs {'axis': [2, 3]}
  }
}
layer {
  name:"Node_18"
  type:"function"
  top:"Node_18"
  bottom:"p0_1"
  bottom:"Node_17"
  layer_param {
    idx:18
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 1, 1]}
    in_1 {name:"Node_17:0",dtype:float32,shape:[1, 512]}
    out_0 {name:"Node_18:0",dtype:float32,shape:[1, 512]}
  }
}
layer {
  name:"p0_2"
  type:"input"
  top:"p0_2"
  layer_param {
    idx:19
    out_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_22"
  type:"nn_adaptive_avg_pool2d"
  top:"Node_22"
  bottom:"p0_2"
  layer_param {
    idx:22
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_22:0",dtype:float32,shape:[1, 512, 1, 1]}
    attrs {'output_size': [1, 1], 'layout': 'NCHW'}
  }
}
layer {
  name:"Node_23"
  type:"function"
  top:"Node_23"
  bottom:"p0_2"
  bottom:"Node_22"
  layer_param {
    idx:23
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"Node_22:0",dtype:float32,shape:[1, 512, 1, 1]}
    out_0 {name:"Node_23:0",dtype:float32,shape:[1, 512, 1, 1]}
  }
}
layer {
  name:"p0_3"
  type:"input"
  top:"p0_3"
  layer_param {
    idx:24
    out_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"p1_1"
  type:"input"
  top:"p1_1"
  layer_param {
    idx:25
    out_0 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
  }
}
layer {
  name:"p2_1"
  type:"input"
  top:"p2_1"
  layer_param {
    idx:26
    out_0 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"p3"
  type:"input"
  top:"p3"
  layer_param {
    idx:27
    out_0 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"p4"
  type:"input"
  top:"p4"
  layer_param {
    idx:28
    out_0 {name:"p4:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_36"
  type:"nn_conv2d"
  top:"Node_36"
  bottom:"p0_3"
  bottom:"p1_1"
  layer_param {
    idx:36
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
    out_0 {name:"Node_36:0",dtype:float32,shape:[1, 512, 7, 7]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_38"
  type:"multiply"
  top:"Node_38"
  bottom:"Node_36"
  bottom:"p2_1"
  layer_param {
    idx:38
    in_0 {name:"Node_36:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_38:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_40"
  type:"add"
  top:"Node_40"
  bottom:"Node_38"
  bottom:"p3"
  layer_param {
    idx:40
    in_0 {name:"Node_38:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_40:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_42"
  type:"add"
  top:"Node_42"
  bottom:"Node_40"
  bottom:"p4"
  layer_param {
    idx:42
    in_0 {name:"Node_40:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_42:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_43"
  type:"nn_relu"
  top:"Node_43"
  bottom:"Node_42"
  layer_param {
    idx:43
    in_0 {name:"Node_42:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_43:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_44"
  type:"function"
  top:"Node_44"
  bottom:"p0_3"
  bottom:"p1_1"
  bottom:"p2_1"
  bottom:"p3"
  bottom:"p4"
  bottom:"Node_43"
  layer_param {
    idx:44
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_5 {name:"Node_43:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_44:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"p0_4"
  type:"input"
  top:"p0_4"
  layer_param {
    idx:45
    out_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"p1_2"
  type:"input"
  top:"p1_2"
  layer_param {
    idx:46
    out_0 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
  }
}
layer {
  name:"p2_2"
  type:"input"
  top:"p2_2"
  layer_param {
    idx:47
    out_0 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"p3_1"
  type:"input"
  top:"p3_1"
  layer_param {
    idx:48
    out_0 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"Node_55"
  type:"nn_conv2d"
  top:"Node_55"
  bottom:"p0_4"
  bottom:"p1_2"
  layer_param {
    idx:55
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
    out_0 {name:"Node_55:0",dtype:float32,shape:[1, 512, 7, 7]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_57"
  type:"multiply"
  top:"Node_57"
  bottom:"Node_55"
  bottom:"p2_2"
  layer_param {
    idx:57
    in_0 {name:"Node_55:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_57:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_59"
  type:"add"
  top:"Node_59"
  bottom:"Node_57"
  bottom:"p3_1"
  layer_param {
    idx:59
    in_0 {name:"Node_57:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_59:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_60"
  type:"nn_relu"
  top:"Node_60"
  bottom:"Node_59"
  layer_param {
    idx:60
    in_0 {name:"Node_59:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_60:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_61"
  type:"function"
  top:"Node_61"
  bottom:"p0_4"
  bottom:"p1_2"
  bottom:"p2_2"
  bottom:"p3_1"
  bottom:"Node_60"
  layer_param {
    idx:61
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    in_4 {name:"Node_60:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_61:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"p0_5"
  type:"input"
  top:"p0_5"
  layer_param {
    idx:62
    out_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"p1_3"
  type:"input"
  top:"p1_3"
  layer_param {
    idx:63
    out_0 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
  }
}
layer {
  name:"p2_3"
  type:"input"
  top:"p2_3"
  layer_param {
    idx:64
    out_0 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"p3_2"
  type:"input"
  top:"p3_2"
  layer_param {
    idx:65
    out_0 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"p4_1"
  type:"input"
  top:"p4_1"
  layer_param {
    idx:66
    out_0 {name:"p4:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_74"
  type:"nn_conv2d"
  top:"Node_74"
  bottom:"p0_5"
  bottom:"p1_3"
  layer_param {
    idx:74
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
    out_0 {name:"Node_74:0",dtype:float32,shape:[1, 512, 7, 7]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_76"
  type:"multiply"
  top:"Node_76"
  bottom:"Node_74"
  bottom:"p2_3"
  layer_param {
    idx:76
    in_0 {name:"Node_74:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_76:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_78"
  type:"add"
  top:"Node_78"
  bottom:"Node_76"
  bottom:"p3_2"
  layer_param {
    idx:78
    in_0 {name:"Node_76:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_78:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_80"
  type:"add"
  top:"Node_80"
  bottom:"Node_78"
  bottom:"p4_1"
  layer_param {
    idx:80
    in_0 {name:"Node_78:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_80:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_81"
  type:"nn_relu"
  top:"Node_81"
  bottom:"Node_80"
  layer_param {
    idx:81
    in_0 {name:"Node_80:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_81:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_82"
  type:"function"
  top:"Node_82"
  bottom:"p0_5"
  bottom:"p1_3"
  bottom:"p2_3"
  bottom:"p3_2"
  bottom:"p4_1"
  bottom:"Node_81"
  layer_param {
    idx:82
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 512, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_5 {name:"Node_81:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_82:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"p0_6"
  type:"input"
  top:"p0_6"
  layer_param {
    idx:83
    out_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p1_4"
  type:"input"
  top:"p1_4"
  layer_param {
    idx:84
    out_0 {name:"p1:0",dtype:float32,shape:[512, 256, 3, 3]}
  }
}
layer {
  name:"p2_4"
  type:"input"
  top:"p2_4"
  layer_param {
    idx:85
    out_0 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"p3_3"
  type:"input"
  top:"p3_3"
  layer_param {
    idx:86
    out_0 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
  }
}
layer {
  name:"Node_93"
  type:"nn_conv2d"
  top:"Node_93"
  bottom:"p0_6"
  bottom:"p1_4"
  layer_param {
    idx:93
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 256, 3, 3]}
    out_0 {name:"Node_93:0",dtype:float32,shape:[1, 512, 7, 7]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_95"
  type:"multiply"
  top:"Node_95"
  bottom:"Node_93"
  bottom:"p2_4"
  layer_param {
    idx:95
    in_0 {name:"Node_93:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_95:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_97"
  type:"add"
  top:"Node_97"
  bottom:"Node_95"
  bottom:"p3_3"
  layer_param {
    idx:97
    in_0 {name:"Node_95:0",dtype:float32,shape:[1, 512, 7, 7]}
    in_1 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    out_0 {name:"Node_97:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_98"
  type:"nn_relu"
  top:"Node_98"
  bottom:"Node_97"
  layer_param {
    idx:98
    in_0 {name:"Node_97:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_98:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"Node_99"
  type:"function"
  top:"Node_99"
  bottom:"p0_6"
  bottom:"p1_4"
  bottom:"p2_4"
  bottom:"p3_3"
  bottom:"Node_98"
  layer_param {
    idx:99
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[512, 256, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[512, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[512, 1, 1]}
    in_4 {name:"Node_98:0",dtype:float32,shape:[1, 512, 7, 7]}
    out_0 {name:"Node_99:0",dtype:float32,shape:[1, 512, 7, 7]}
  }
}
layer {
  name:"p0_7"
  type:"input"
  top:"p0_7"
  layer_param {
    idx:100
    out_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p1_5"
  type:"input"
  top:"p1_5"
  layer_param {
    idx:101
    out_0 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
  }
}
layer {
  name:"p2_5"
  type:"input"
  top:"p2_5"
  layer_param {
    idx:102
    out_0 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"p3_4"
  type:"input"
  top:"p3_4"
  layer_param {
    idx:103
    out_0 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"p4_2"
  type:"input"
  top:"p4_2"
  layer_param {
    idx:104
    out_0 {name:"p4:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_112"
  type:"nn_conv2d"
  top:"Node_112"
  bottom:"p0_7"
  bottom:"p1_5"
  layer_param {
    idx:112
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
    out_0 {name:"Node_112:0",dtype:float32,shape:[1, 256, 14, 14]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_114"
  type:"multiply"
  top:"Node_114"
  bottom:"Node_112"
  bottom:"p2_5"
  layer_param {
    idx:114
    in_0 {name:"Node_112:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_114:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_116"
  type:"add"
  top:"Node_116"
  bottom:"Node_114"
  bottom:"p3_4"
  layer_param {
    idx:116
    in_0 {name:"Node_114:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_116:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_118"
  type:"add"
  top:"Node_118"
  bottom:"Node_116"
  bottom:"p4_2"
  layer_param {
    idx:118
    in_0 {name:"Node_116:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_118:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_119"
  type:"nn_relu"
  top:"Node_119"
  bottom:"Node_118"
  layer_param {
    idx:119
    in_0 {name:"Node_118:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_119:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_120"
  type:"function"
  top:"Node_120"
  bottom:"p0_7"
  bottom:"p1_5"
  bottom:"p2_5"
  bottom:"p3_4"
  bottom:"p4_2"
  bottom:"Node_119"
  layer_param {
    idx:120
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_5 {name:"Node_119:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_120:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p0_8"
  type:"input"
  top:"p0_8"
  layer_param {
    idx:121
    out_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p1_6"
  type:"input"
  top:"p1_6"
  layer_param {
    idx:122
    out_0 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
  }
}
layer {
  name:"p2_6"
  type:"input"
  top:"p2_6"
  layer_param {
    idx:123
    out_0 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"p3_5"
  type:"input"
  top:"p3_5"
  layer_param {
    idx:124
    out_0 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"Node_131"
  type:"nn_conv2d"
  top:"Node_131"
  bottom:"p0_8"
  bottom:"p1_6"
  layer_param {
    idx:131
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
    out_0 {name:"Node_131:0",dtype:float32,shape:[1, 256, 14, 14]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_133"
  type:"multiply"
  top:"Node_133"
  bottom:"Node_131"
  bottom:"p2_6"
  layer_param {
    idx:133
    in_0 {name:"Node_131:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_133:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_135"
  type:"add"
  top:"Node_135"
  bottom:"Node_133"
  bottom:"p3_5"
  layer_param {
    idx:135
    in_0 {name:"Node_133:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_135:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_136"
  type:"nn_relu"
  top:"Node_136"
  bottom:"Node_135"
  layer_param {
    idx:136
    in_0 {name:"Node_135:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_136:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_137"
  type:"function"
  top:"Node_137"
  bottom:"p0_8"
  bottom:"p1_6"
  bottom:"p2_6"
  bottom:"p3_5"
  bottom:"Node_136"
  layer_param {
    idx:137
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    in_4 {name:"Node_136:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_137:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p0_9"
  type:"input"
  top:"p0_9"
  layer_param {
    idx:138
    out_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p1_7"
  type:"input"
  top:"p1_7"
  layer_param {
    idx:139
    out_0 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
  }
}
layer {
  name:"p2_7"
  type:"input"
  top:"p2_7"
  layer_param {
    idx:140
    out_0 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"p3_6"
  type:"input"
  top:"p3_6"
  layer_param {
    idx:141
    out_0 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"p4_3"
  type:"input"
  top:"p4_3"
  layer_param {
    idx:142
    out_0 {name:"p4:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_150"
  type:"nn_conv2d"
  top:"Node_150"
  bottom:"p0_9"
  bottom:"p1_7"
  layer_param {
    idx:150
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
    out_0 {name:"Node_150:0",dtype:float32,shape:[1, 256, 14, 14]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_152"
  type:"multiply"
  top:"Node_152"
  bottom:"Node_150"
  bottom:"p2_7"
  layer_param {
    idx:152
    in_0 {name:"Node_150:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_152:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_154"
  type:"add"
  top:"Node_154"
  bottom:"Node_152"
  bottom:"p3_6"
  layer_param {
    idx:154
    in_0 {name:"Node_152:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_154:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_156"
  type:"add"
  top:"Node_156"
  bottom:"Node_154"
  bottom:"p4_3"
  layer_param {
    idx:156
    in_0 {name:"Node_154:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_156:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_157"
  type:"nn_relu"
  top:"Node_157"
  bottom:"Node_156"
  layer_param {
    idx:157
    in_0 {name:"Node_156:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_157:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_158"
  type:"function"
  top:"Node_158"
  bottom:"p0_9"
  bottom:"p1_7"
  bottom:"p2_7"
  bottom:"p3_6"
  bottom:"p4_3"
  bottom:"Node_157"
  layer_param {
    idx:158
    in_0 {name:"p0:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 256, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_5 {name:"Node_157:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_158:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p0_10"
  type:"input"
  top:"p0_10"
  layer_param {
    idx:159
    out_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p1_8"
  type:"input"
  top:"p1_8"
  layer_param {
    idx:160
    out_0 {name:"p1:0",dtype:float32,shape:[256, 128, 3, 3]}
  }
}
layer {
  name:"p2_8"
  type:"input"
  top:"p2_8"
  layer_param {
    idx:161
    out_0 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"p3_7"
  type:"input"
  top:"p3_7"
  layer_param {
    idx:162
    out_0 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
  }
}
layer {
  name:"Node_169"
  type:"nn_conv2d"
  top:"Node_169"
  bottom:"p0_10"
  bottom:"p1_8"
  layer_param {
    idx:169
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 128, 3, 3]}
    out_0 {name:"Node_169:0",dtype:float32,shape:[1, 256, 14, 14]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_171"
  type:"multiply"
  top:"Node_171"
  bottom:"Node_169"
  bottom:"p2_8"
  layer_param {
    idx:171
    in_0 {name:"Node_169:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_171:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_173"
  type:"add"
  top:"Node_173"
  bottom:"Node_171"
  bottom:"p3_7"
  layer_param {
    idx:173
    in_0 {name:"Node_171:0",dtype:float32,shape:[1, 256, 14, 14]}
    in_1 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    out_0 {name:"Node_173:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_174"
  type:"nn_relu"
  top:"Node_174"
  bottom:"Node_173"
  layer_param {
    idx:174
    in_0 {name:"Node_173:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_174:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"Node_175"
  type:"function"
  top:"Node_175"
  bottom:"p0_10"
  bottom:"p1_8"
  bottom:"p2_8"
  bottom:"p3_7"
  bottom:"Node_174"
  layer_param {
    idx:175
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[256, 128, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[256, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[256, 1, 1]}
    in_4 {name:"Node_174:0",dtype:float32,shape:[1, 256, 14, 14]}
    out_0 {name:"Node_175:0",dtype:float32,shape:[1, 256, 14, 14]}
  }
}
layer {
  name:"p0_11"
  type:"input"
  top:"p0_11"
  layer_param {
    idx:176
    out_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p1_9"
  type:"input"
  top:"p1_9"
  layer_param {
    idx:177
    out_0 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"p2_9"
  type:"input"
  top:"p2_9"
  layer_param {
    idx:178
    out_0 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"p3_8"
  type:"input"
  top:"p3_8"
  layer_param {
    idx:179
    out_0 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"p4_4"
  type:"input"
  top:"p4_4"
  layer_param {
    idx:180
    out_0 {name:"p4:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_188"
  type:"nn_conv2d"
  top:"Node_188"
  bottom:"p0_11"
  bottom:"p1_9"
  layer_param {
    idx:188
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_188:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_190"
  type:"multiply"
  top:"Node_190"
  bottom:"Node_188"
  bottom:"p2_9"
  layer_param {
    idx:190
    in_0 {name:"Node_188:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_190:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_192"
  type:"add"
  top:"Node_192"
  bottom:"Node_190"
  bottom:"p3_8"
  layer_param {
    idx:192
    in_0 {name:"Node_190:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_192:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_194"
  type:"add"
  top:"Node_194"
  bottom:"Node_192"
  bottom:"p4_4"
  layer_param {
    idx:194
    in_0 {name:"Node_192:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_194:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_195"
  type:"nn_relu"
  top:"Node_195"
  bottom:"Node_194"
  layer_param {
    idx:195
    in_0 {name:"Node_194:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_195:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_196"
  type:"function"
  top:"Node_196"
  bottom:"p0_11"
  bottom:"p1_9"
  bottom:"p2_9"
  bottom:"p3_8"
  bottom:"p4_4"
  bottom:"Node_195"
  layer_param {
    idx:196
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_5 {name:"Node_195:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_196:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p0_12"
  type:"input"
  top:"p0_12"
  layer_param {
    idx:197
    out_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p1_10"
  type:"input"
  top:"p1_10"
  layer_param {
    idx:198
    out_0 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"p2_10"
  type:"input"
  top:"p2_10"
  layer_param {
    idx:199
    out_0 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"p3_9"
  type:"input"
  top:"p3_9"
  layer_param {
    idx:200
    out_0 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_207"
  type:"nn_conv2d"
  top:"Node_207"
  bottom:"p0_12"
  bottom:"p1_10"
  layer_param {
    idx:207
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_207:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_209"
  type:"multiply"
  top:"Node_209"
  bottom:"Node_207"
  bottom:"p2_10"
  layer_param {
    idx:209
    in_0 {name:"Node_207:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_209:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_211"
  type:"add"
  top:"Node_211"
  bottom:"Node_209"
  bottom:"p3_9"
  layer_param {
    idx:211
    in_0 {name:"Node_209:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_211:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_212"
  type:"nn_relu"
  top:"Node_212"
  bottom:"Node_211"
  layer_param {
    idx:212
    in_0 {name:"Node_211:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_212:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_213"
  type:"function"
  top:"Node_213"
  bottom:"p0_12"
  bottom:"p1_10"
  bottom:"p2_10"
  bottom:"p3_9"
  bottom:"Node_212"
  layer_param {
    idx:213
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    in_4 {name:"Node_212:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_213:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p0_13"
  type:"input"
  top:"p0_13"
  layer_param {
    idx:214
    out_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p1_11"
  type:"input"
  top:"p1_11"
  layer_param {
    idx:215
    out_0 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"p2_11"
  type:"input"
  top:"p2_11"
  layer_param {
    idx:216
    out_0 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"p3_10"
  type:"input"
  top:"p3_10"
  layer_param {
    idx:217
    out_0 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"p4_5"
  type:"input"
  top:"p4_5"
  layer_param {
    idx:218
    out_0 {name:"p4:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_226"
  type:"nn_conv2d"
  top:"Node_226"
  bottom:"p0_13"
  bottom:"p1_11"
  layer_param {
    idx:226
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_226:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_228"
  type:"multiply"
  top:"Node_228"
  bottom:"Node_226"
  bottom:"p2_11"
  layer_param {
    idx:228
    in_0 {name:"Node_226:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_228:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_230"
  type:"add"
  top:"Node_230"
  bottom:"Node_228"
  bottom:"p3_10"
  layer_param {
    idx:230
    in_0 {name:"Node_228:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_230:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_232"
  type:"add"
  top:"Node_232"
  bottom:"Node_230"
  bottom:"p4_5"
  layer_param {
    idx:232
    in_0 {name:"Node_230:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_232:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_233"
  type:"nn_relu"
  top:"Node_233"
  bottom:"Node_232"
  layer_param {
    idx:233
    in_0 {name:"Node_232:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_233:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_234"
  type:"function"
  top:"Node_234"
  bottom:"p0_13"
  bottom:"p1_11"
  bottom:"p2_11"
  bottom:"p3_10"
  bottom:"p4_5"
  bottom:"Node_233"
  layer_param {
    idx:234
    in_0 {name:"p0:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 128, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_5 {name:"Node_233:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_234:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p0_14"
  type:"input"
  top:"p0_14"
  layer_param {
    idx:235
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p1_12"
  type:"input"
  top:"p1_12"
  layer_param {
    idx:236
    out_0 {name:"p1:0",dtype:float32,shape:[128, 64, 3, 3]}
  }
}
layer {
  name:"p2_12"
  type:"input"
  top:"p2_12"
  layer_param {
    idx:237
    out_0 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"p3_11"
  type:"input"
  top:"p3_11"
  layer_param {
    idx:238
    out_0 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_245"
  type:"nn_conv2d"
  top:"Node_245"
  bottom:"p0_14"
  bottom:"p1_12"
  layer_param {
    idx:245
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 64, 3, 3]}
    out_0 {name:"Node_245:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_247"
  type:"multiply"
  top:"Node_247"
  bottom:"Node_245"
  bottom:"p2_12"
  layer_param {
    idx:247
    in_0 {name:"Node_245:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_247:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_249"
  type:"add"
  top:"Node_249"
  bottom:"Node_247"
  bottom:"p3_11"
  layer_param {
    idx:249
    in_0 {name:"Node_247:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_249:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_250"
  type:"nn_relu"
  top:"Node_250"
  bottom:"Node_249"
  layer_param {
    idx:250
    in_0 {name:"Node_249:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_250:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_251"
  type:"function"
  top:"Node_251"
  bottom:"p0_14"
  bottom:"p1_12"
  bottom:"p2_12"
  bottom:"p3_11"
  bottom:"Node_250"
  layer_param {
    idx:251
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[128, 64, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[128, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[128, 1, 1]}
    in_4 {name:"Node_250:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_251:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"p0_15"
  type:"input"
  top:"p0_15"
  layer_param {
    idx:252
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p1_13"
  type:"input"
  top:"p1_13"
  layer_param {
    idx:253
    out_0 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"p2_13"
  type:"input"
  top:"p2_13"
  layer_param {
    idx:254
    out_0 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"p3_12"
  type:"input"
  top:"p3_12"
  layer_param {
    idx:255
    out_0 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"p4_6"
  type:"input"
  top:"p4_6"
  layer_param {
    idx:256
    out_0 {name:"p4:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_264"
  type:"nn_conv2d"
  top:"Node_264"
  bottom:"p0_15"
  bottom:"p1_13"
  layer_param {
    idx:264
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_264:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_266"
  type:"multiply"
  top:"Node_266"
  bottom:"Node_264"
  bottom:"p2_13"
  layer_param {
    idx:266
    in_0 {name:"Node_264:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_266:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_268"
  type:"add"
  top:"Node_268"
  bottom:"Node_266"
  bottom:"p3_12"
  layer_param {
    idx:268
    in_0 {name:"Node_266:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_268:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_270"
  type:"add"
  top:"Node_270"
  bottom:"Node_268"
  bottom:"p4_6"
  layer_param {
    idx:270
    in_0 {name:"Node_268:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_270:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_271"
  type:"nn_relu"
  top:"Node_271"
  bottom:"Node_270"
  layer_param {
    idx:271
    in_0 {name:"Node_270:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_271:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_272"
  type:"function"
  top:"Node_272"
  bottom:"p0_15"
  bottom:"p1_13"
  bottom:"p2_13"
  bottom:"p3_12"
  bottom:"p4_6"
  bottom:"Node_271"
  layer_param {
    idx:272
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_5 {name:"Node_271:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_272:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p0_16"
  type:"input"
  top:"p0_16"
  layer_param {
    idx:273
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p1_14"
  type:"input"
  top:"p1_14"
  layer_param {
    idx:274
    out_0 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"p2_14"
  type:"input"
  top:"p2_14"
  layer_param {
    idx:275
    out_0 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"p3_13"
  type:"input"
  top:"p3_13"
  layer_param {
    idx:276
    out_0 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_283"
  type:"nn_conv2d"
  top:"Node_283"
  bottom:"p0_16"
  bottom:"p1_14"
  layer_param {
    idx:283
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_283:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_285"
  type:"multiply"
  top:"Node_285"
  bottom:"Node_283"
  bottom:"p2_14"
  layer_param {
    idx:285
    in_0 {name:"Node_283:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_285:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_287"
  type:"add"
  top:"Node_287"
  bottom:"Node_285"
  bottom:"p3_13"
  layer_param {
    idx:287
    in_0 {name:"Node_285:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_287:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_288"
  type:"nn_relu"
  top:"Node_288"
  bottom:"Node_287"
  layer_param {
    idx:288
    in_0 {name:"Node_287:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_288:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_289"
  type:"function"
  top:"Node_289"
  bottom:"p0_16"
  bottom:"p1_14"
  bottom:"p2_14"
  bottom:"p3_13"
  bottom:"Node_288"
  layer_param {
    idx:289
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    in_4 {name:"Node_288:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_289:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p0_17"
  type:"input"
  top:"p0_17"
  layer_param {
    idx:290
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p1_15"
  type:"input"
  top:"p1_15"
  layer_param {
    idx:291
    out_0 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"p2_15"
  type:"input"
  top:"p2_15"
  layer_param {
    idx:292
    out_0 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"p3_14"
  type:"input"
  top:"p3_14"
  layer_param {
    idx:293
    out_0 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"p4_7"
  type:"input"
  top:"p4_7"
  layer_param {
    idx:294
    out_0 {name:"p4:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_302"
  type:"nn_conv2d"
  top:"Node_302"
  bottom:"p0_17"
  bottom:"p1_15"
  layer_param {
    idx:302
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_302:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_304"
  type:"multiply"
  top:"Node_304"
  bottom:"Node_302"
  bottom:"p2_15"
  layer_param {
    idx:304
    in_0 {name:"Node_302:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_304:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_306"
  type:"add"
  top:"Node_306"
  bottom:"Node_304"
  bottom:"p3_14"
  layer_param {
    idx:306
    in_0 {name:"Node_304:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_306:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_308"
  type:"add"
  top:"Node_308"
  bottom:"Node_306"
  bottom:"p4_7"
  layer_param {
    idx:308
    in_0 {name:"Node_306:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p4:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_308:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_309"
  type:"nn_relu"
  top:"Node_309"
  bottom:"Node_308"
  layer_param {
    idx:309
    in_0 {name:"Node_308:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_309:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_310"
  type:"function"
  top:"Node_310"
  bottom:"p0_17"
  bottom:"p1_15"
  bottom:"p2_15"
  bottom:"p3_14"
  bottom:"p4_7"
  bottom:"Node_309"
  layer_param {
    idx:310
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    in_4 {name:"p4:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_5 {name:"Node_309:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_310:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p0_18"
  type:"input"
  top:"p0_18"
  layer_param {
    idx:311
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p1_16"
  type:"input"
  top:"p1_16"
  layer_param {
    idx:312
    out_0 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"p2_16"
  type:"input"
  top:"p2_16"
  layer_param {
    idx:313
    out_0 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"p3_15"
  type:"input"
  top:"p3_15"
  layer_param {
    idx:314
    out_0 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_321"
  type:"nn_conv2d"
  top:"Node_321"
  bottom:"p0_18"
  bottom:"p1_16"
  layer_param {
    idx:321
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_321:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_323"
  type:"multiply"
  top:"Node_323"
  bottom:"Node_321"
  bottom:"p2_16"
  layer_param {
    idx:323
    in_0 {name:"Node_321:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_323:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_325"
  type:"add"
  top:"Node_325"
  bottom:"Node_323"
  bottom:"p3_15"
  layer_param {
    idx:325
    in_0 {name:"Node_323:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_325:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_326"
  type:"nn_relu"
  top:"Node_326"
  bottom:"Node_325"
  layer_param {
    idx:326
    in_0 {name:"Node_325:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_326:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_327"
  type:"function"
  top:"Node_327"
  bottom:"p0_18"
  bottom:"p1_16"
  bottom:"p2_16"
  bottom:"p3_15"
  bottom:"Node_326"
  layer_param {
    idx:327
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_2 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    in_3 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
    in_4 {name:"Node_326:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_327:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p0_19"
  type:"input"
  top:"p0_19"
  layer_param {
    idx:328
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_331"
  type:"nn_max_pool2d"
  top:"Node_331"
  bottom:"p0_19"
  layer_param {
    idx:331
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_331:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_332"
  type:"function"
  top:"Node_332"
  bottom:"p0_19"
  bottom:"Node_331"
  layer_param {
    idx:332
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_331:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_332:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"p0_20"
  type:"input"
  top:"p0_20"
  layer_param {
    idx:333
    out_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"p1_17"
  type:"input"
  top:"p1_17"
  layer_param {
    idx:334
    out_0 {name:"p1:0",dtype:float32,shape:[64, 3, 7, 7]}
  }
}
layer {
  name:"p2_17"
  type:"input"
  top:"p2_17"
  layer_param {
    idx:335
    out_0 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"p3_16"
  type:"input"
  top:"p3_16"
  layer_param {
    idx:336
    out_0 {name:"p3:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_343"
  type:"nn_conv2d"
  top:"Node_343"
  bottom:"p0_20"
  bottom:"p1_17"
  layer_param {
    idx:343
    in_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"p1:0",dtype:float32,shape:[64, 3, 7, 7]}
    out_0 {name:"Node_343:0",dtype:float32,shape:[1, 64, 112, 112]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_345"
  type:"multiply"
  top:"Node_345"
  bottom:"Node_343"
  bottom:"p2_17"
  layer_param {
    idx:345
    in_0 {name:"Node_343:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"p2:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_345:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_347"
  type:"add"
  top:"Node_347"
  bottom:"Node_345"
  bottom:"p3_16"
