name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:0
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"Node_206"
  type:"const"
  top:"Node_206"
  layer_param {
    idx:206
    out_0 {name:"Node_206:0",dtype:float32,shape:[64, 3, 7, 7]}
  }
}
layer {
  name:"Node_207"
  type:"nn_conv2d"
  top:"Node_207"
  bottom:"input0"
  bottom:"Node_206"
  layer_param {
    idx:207
    in_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_206:0",dtype:float32,shape:[64, 3, 7, 7]}
    out_0 {name:"Node_207:0",dtype:float32,shape:[1, 64, 112, 112]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_208"
  type:"annotation_stop_fusion"
  top:"Node_208"
  bottom:"Node_207"
  layer_param {
    idx:208
    in_0 {name:"Node_207:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_208:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_209"
  type:"const"
  top:"Node_209"
  layer_param {
    idx:209
    out_0 {name:"Node_209:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_210"
  type:"multiply"
  top:"Node_210"
  bottom:"Node_208"
  bottom:"Node_209"
  layer_param {
    idx:210
    in_0 {name:"Node_208:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_209:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_210:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_211"
  type:"const"
  top:"Node_211"
  layer_param {
    idx:211
    out_0 {name:"Node_211:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_212"
  type:"add"
  top:"Node_212"
  bottom:"Node_210"
  bottom:"Node_211"
  layer_param {
    idx:212
    in_0 {name:"Node_210:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_211:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_212:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_213"
  type:"nn_relu"
  top:"Node_213"
  bottom:"Node_212"
  layer_param {
    idx:213
    in_0 {name:"Node_212:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_213:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_214"
  type:"nn_max_pool2d"
  top:"Node_214"
  bottom:"Node_213"
  layer_param {
    idx:214
    in_0 {name:"Node_213:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_214:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW32c', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_215"
  type:"annotation_stop_fusion"
  top:"Node_215"
  bottom:"Node_214"
  layer_param {
    idx:215
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_215:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_219"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_219"
  bottom:"Node_215"
  layer_param {
    idx:219
    in_0 {name:"Node_215:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_219:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_216:0', 'min': 'Node_217:0', 'max': 'Node_218:0'}
  }
}
layer {
  name:"Node_221"
  type:"const"
  top:"Node_221"
  layer_param {
    idx:221
    out_0 {name:"Node_221:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_225"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_225"
  bottom:"Node_221"
  layer_param {
    idx:225
    in_0 {name:"Node_221:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_225:0",dtype:float32,shape:[64, 64, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_222:0', 'min': 'Node_223:0', 'max': 'Node_224:0'}
  }
}
layer {
  name:"Node_226"
  type:"nn_conv2d"
  top:"Node_226"
  bottom:"Node_219"
  bottom:"Node_225"
  layer_param {
    idx:226
    in_0 {name:"Node_219:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_225:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_226:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_230"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_230"
  bottom:"Node_226"
  layer_param {
    idx:230
    in_0 {name:"Node_226:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_230:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_227:0', 'min': 'Node_228:0', 'max': 'Node_229:0'}
  }
}
layer {
  name:"Node_231"
  type:"annotation_cast_hint"
  top:"Node_231"
  bottom:"Node_230"
  layer_param {
    idx:231
    in_0 {name:"Node_230:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_231:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_232"
  type:"annotation_stop_fusion"
  top:"Node_232"
  bottom:"Node_231"
  layer_param {
    idx:232
    in_0 {name:"Node_231:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_232:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_234"
  type:"const"
  top:"Node_234"
  layer_param {
    idx:234
    out_0 {name:"Node_234:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_238"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_238"
  bottom:"Node_234"
  layer_param {
    idx:238
    in_0 {name:"Node_234:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_238:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_235:0', 'min': 'Node_236:0', 'max': 'Node_237:0'}
  }
}
layer {
  name:"Node_239"
  type:"multiply"
  top:"Node_239"
  bottom:"Node_232"
  bottom:"Node_238"
  layer_param {
    idx:239
    in_0 {name:"Node_232:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_238:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_239:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_241"
  type:"const"
  top:"Node_241"
  layer_param {
    idx:241
    out_0 {name:"Node_241:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_245"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_245"
  bottom:"Node_241"
  layer_param {
    idx:245
    in_0 {name:"Node_241:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_245:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_242:0', 'min': 'Node_243:0', 'max': 'Node_244:0'}
  }
}
layer {
  name:"Node_246"
  type:"add"
  top:"Node_246"
  bottom:"Node_239"
  bottom:"Node_245"
  layer_param {
    idx:246
    in_0 {name:"Node_239:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_245:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_246:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_247"
  type:"nn_relu"
  top:"Node_247"
  bottom:"Node_246"
  layer_param {
    idx:247
    in_0 {name:"Node_246:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_247:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_251"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_251"
  bottom:"Node_247"
  layer_param {
    idx:251
    in_0 {name:"Node_247:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_251:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_248:0', 'min': 'Node_249:0', 'max': 'Node_250:0'}
  }
}
layer {
  name:"Node_252"
  type:"annotation_cast_hint"
  top:"Node_252"
  bottom:"Node_251"
  layer_param {
    idx:252
    in_0 {name:"Node_251:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_252:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_253"
  type:"annotation_stop_fusion"
  top:"Node_253"
  bottom:"Node_252"
  layer_param {
    idx:253
    in_0 {name:"Node_252:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_253:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_255"
  type:"const"
  top:"Node_255"
  layer_param {
    idx:255
    out_0 {name:"Node_255:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_259"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_259"
  bottom:"Node_255"
  layer_param {
    idx:259
    in_0 {name:"Node_255:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_259:0",dtype:float32,shape:[64, 64, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_256:0', 'min': 'Node_257:0', 'max': 'Node_258:0'}
  }
}
layer {
  name:"Node_260"
  type:"nn_conv2d"
  top:"Node_260"
  bottom:"Node_253"
  bottom:"Node_259"
  layer_param {
    idx:260
    in_0 {name:"Node_253:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_259:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_260:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_264"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_264"
  bottom:"Node_260"
  layer_param {
    idx:264
    in_0 {name:"Node_260:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_264:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_261:0', 'min': 'Node_262:0', 'max': 'Node_263:0'}
  }
}
layer {
  name:"Node_265"
  type:"annotation_cast_hint"
  top:"Node_265"
  bottom:"Node_264"
  layer_param {
    idx:265
    in_0 {name:"Node_264:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_265:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_266"
  type:"annotation_stop_fusion"
  top:"Node_266"
  bottom:"Node_265"
  layer_param {
    idx:266
    in_0 {name:"Node_265:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_266:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_268"
  type:"const"
  top:"Node_268"
  layer_param {
    idx:268
    out_0 {name:"Node_268:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_272"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_272"
  bottom:"Node_268"
  layer_param {
    idx:272
    in_0 {name:"Node_268:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_272:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_269:0', 'min': 'Node_270:0', 'max': 'Node_271:0'}
  }
}
layer {
  name:"Node_273"
  type:"multiply"
  top:"Node_273"
  bottom:"Node_266"
  bottom:"Node_272"
  layer_param {
    idx:273
    in_0 {name:"Node_266:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_272:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_273:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_275"
  type:"const"
  top:"Node_275"
  layer_param {
    idx:275
    out_0 {name:"Node_275:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_279"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_279"
  bottom:"Node_275"
  layer_param {
    idx:279
    in_0 {name:"Node_275:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_279:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_276:0', 'min': 'Node_277:0', 'max': 'Node_278:0'}
  }
}
layer {
  name:"Node_280"
  type:"add"
  top:"Node_280"
  bottom:"Node_273"
  bottom:"Node_279"
  layer_param {
    idx:280
    in_0 {name:"Node_273:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_279:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_280:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_284"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_284"
  bottom:"Node_280"
  layer_param {
    idx:284
    in_0 {name:"Node_280:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_284:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_281:0', 'min': 'Node_282:0', 'max': 'Node_283:0'}
  }
}
layer {
  name:"Node_285"
  type:"annotation_cast_hint"
  top:"Node_285"
  bottom:"Node_284"
  layer_param {
    idx:285
    in_0 {name:"Node_284:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_285:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_286"
  type:"annotation_stop_fusion"
  top:"Node_286"
  bottom:"Node_285"
  layer_param {
    idx:286
    in_0 {name:"Node_285:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_286:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_290"
  type:"annotation_stop_fusion"
  top:"Node_290"
  bottom:"Node_214"
  layer_param {
    idx:290
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_290:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_294"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_294"
  bottom:"Node_290"
  layer_param {
    idx:294
    in_0 {name:"Node_290:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_294:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_291:0', 'min': 'Node_292:0', 'max': 'Node_293:0'}
  }
}
layer {
  name:"Node_295"
  type:"add"
  top:"Node_295"
  bottom:"Node_286"
  bottom:"Node_294"
  layer_param {
    idx:295
    in_0 {name:"Node_286:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_294:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_295:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_296"
  type:"nn_relu"
  top:"Node_296"
  bottom:"Node_295"
  layer_param {
    idx:296
    in_0 {name:"Node_295:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_296:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_300"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_300"
  bottom:"Node_296"
  layer_param {
    idx:300
    in_0 {name:"Node_296:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_300:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_297:0', 'min': 'Node_298:0', 'max': 'Node_299:0'}
  }
}
layer {
  name:"Node_301"
  type:"annotation_cast_hint"
  top:"Node_301"
  bottom:"Node_300"
  layer_param {
    idx:301
    in_0 {name:"Node_300:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_301:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_302"
  type:"annotation_stop_fusion"
  top:"Node_302"
  bottom:"Node_301"
  layer_param {
    idx:302
    in_0 {name:"Node_301:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_302:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_304"
  type:"const"
  top:"Node_304"
  layer_param {
    idx:304
    out_0 {name:"Node_304:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_308"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_308"
  bottom:"Node_304"
  layer_param {
    idx:308
    in_0 {name:"Node_304:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_308:0",dtype:float32,shape:[64, 64, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_305:0', 'min': 'Node_306:0', 'max': 'Node_307:0'}
  }
}
layer {
  name:"Node_309"
  type:"nn_conv2d"
  top:"Node_309"
  bottom:"Node_302"
  bottom:"Node_308"
  layer_param {
    idx:309
    in_0 {name:"Node_302:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_308:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_309:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_313"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_313"
  bottom:"Node_309"
  layer_param {
    idx:313
    in_0 {name:"Node_309:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_313:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_310:0', 'min': 'Node_311:0', 'max': 'Node_312:0'}
  }
}
layer {
  name:"Node_314"
  type:"annotation_cast_hint"
  top:"Node_314"
  bottom:"Node_313"
  layer_param {
    idx:314
    in_0 {name:"Node_313:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_314:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_315"
  type:"annotation_stop_fusion"
  top:"Node_315"
  bottom:"Node_314"
  layer_param {
    idx:315
    in_0 {name:"Node_314:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_315:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_317"
  type:"const"
  top:"Node_317"
  layer_param {
    idx:317
    out_0 {name:"Node_317:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_321"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_321"
  bottom:"Node_317"
  layer_param {
    idx:321
    in_0 {name:"Node_317:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_321:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_318:0', 'min': 'Node_319:0', 'max': 'Node_320:0'}
  }
}
layer {
  name:"Node_322"
  type:"multiply"
  top:"Node_322"
  bottom:"Node_315"
  bottom:"Node_321"
  layer_param {
    idx:322
    in_0 {name:"Node_315:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_321:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_322:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_324"
  type:"const"
  top:"Node_324"
  layer_param {
    idx:324
    out_0 {name:"Node_324:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_328"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_328"
  bottom:"Node_324"
  layer_param {
    idx:328
    in_0 {name:"Node_324:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_328:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_325:0', 'min': 'Node_326:0', 'max': 'Node_327:0'}
  }
}
layer {
  name:"Node_329"
  type:"add"
  top:"Node_329"
  bottom:"Node_322"
  bottom:"Node_328"
  layer_param {
    idx:329
    in_0 {name:"Node_322:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_328:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_329:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_330"
  type:"nn_relu"
  top:"Node_330"
  bottom:"Node_329"
  layer_param {
    idx:330
    in_0 {name:"Node_329:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_330:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_334"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_334"
  bottom:"Node_330"
  layer_param {
    idx:334
    in_0 {name:"Node_330:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_334:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_331:0', 'min': 'Node_332:0', 'max': 'Node_333:0'}
  }
}
layer {
  name:"Node_335"
  type:"annotation_cast_hint"
  top:"Node_335"
  bottom:"Node_334"
  layer_param {
    idx:335
    in_0 {name:"Node_334:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_335:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_336"
  type:"annotation_stop_fusion"
  top:"Node_336"
  bottom:"Node_335"
  layer_param {
    idx:336
    in_0 {name:"Node_335:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_336:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_338"
  type:"const"
  top:"Node_338"
  layer_param {
    idx:338
    out_0 {name:"Node_338:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_342"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_342"
  bottom:"Node_338"
  layer_param {
    idx:342
    in_0 {name:"Node_338:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_342:0",dtype:float32,shape:[64, 64, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_339:0', 'min': 'Node_340:0', 'max': 'Node_341:0'}
  }
}
layer {
  name:"Node_343"
  type:"nn_conv2d"
  top:"Node_343"
  bottom:"Node_336"
  bottom:"Node_342"
  layer_param {
    idx:343
    in_0 {name:"Node_336:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_342:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_343:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_347"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_347"
  bottom:"Node_343"
  layer_param {
    idx:347
    in_0 {name:"Node_343:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_347:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_344:0', 'min': 'Node_345:0', 'max': 'Node_346:0'}
  }
}
layer {
  name:"Node_348"
  type:"annotation_cast_hint"
  top:"Node_348"
  bottom:"Node_347"
  layer_param {
    idx:348
    in_0 {name:"Node_347:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_348:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_349"
  type:"annotation_stop_fusion"
  top:"Node_349"
  bottom:"Node_348"
  layer_param {
    idx:349
    in_0 {name:"Node_348:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_349:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_351"
  type:"const"
  top:"Node_351"
  layer_param {
    idx:351
    out_0 {name:"Node_351:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_355"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_355"
  bottom:"Node_351"
  layer_param {
    idx:355
    in_0 {name:"Node_351:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_355:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_352:0', 'min': 'Node_353:0', 'max': 'Node_354:0'}
  }
}
layer {
  name:"Node_356"
  type:"multiply"
  top:"Node_356"
  bottom:"Node_349"
  bottom:"Node_355"
  layer_param {
    idx:356
    in_0 {name:"Node_349:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_355:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_356:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_358"
  type:"const"
  top:"Node_358"
  layer_param {
    idx:358
    out_0 {name:"Node_358:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_362"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_362"
  bottom:"Node_358"
  layer_param {
    idx:362
    in_0 {name:"Node_358:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_362:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_359:0', 'min': 'Node_360:0', 'max': 'Node_361:0'}
  }
}
layer {
  name:"Node_363"
  type:"add"
  top:"Node_363"
  bottom:"Node_356"
  bottom:"Node_362"
  layer_param {
    idx:363
    in_0 {name:"Node_356:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_362:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_363:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_367"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_367"
  bottom:"Node_363"
  layer_param {
    idx:367
    in_0 {name:"Node_363:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_367:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_364:0', 'min': 'Node_365:0', 'max': 'Node_366:0'}
  }
}
layer {
  name:"Node_368"
  type:"annotation_cast_hint"
  top:"Node_368"
  bottom:"Node_367"
  layer_param {
    idx:368
    in_0 {name:"Node_367:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_368:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_369"
  type:"annotation_stop_fusion"
  top:"Node_369"
  bottom:"Node_368"
  layer_param {
    idx:369
    in_0 {name:"Node_368:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_369:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_373"
  type:"annotation_cast_hint"
  top:"Node_373"
  bottom:"Node_300"
  layer_param {
    idx:373
    in_0 {name:"Node_300:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_373:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_374"
  type:"annotation_stop_fusion"
  top:"Node_374"
  bottom:"Node_373"
  layer_param {
    idx:374
    in_0 {name:"Node_373:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_374:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_375"
  type:"add"
  top:"Node_375"
  bottom:"Node_369"
  bottom:"Node_374"
  layer_param {
    idx:375
    in_0 {name:"Node_369:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_374:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_375:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_376"
  type:"nn_relu"
  top:"Node_376"
  bottom:"Node_375"
  layer_param {
    idx:376
    in_0 {name:"Node_375:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_376:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_380"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_380"
  bottom:"Node_376"
  layer_param {
    idx:380
    in_0 {name:"Node_376:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_380:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_377:0', 'min': 'Node_378:0', 'max': 'Node_379:0'}
  }
}
layer {
  name:"Node_381"
  type:"annotation_cast_hint"
  top:"Node_381"
  bottom:"Node_380"
  layer_param {
    idx:381
    in_0 {name:"Node_380:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_381:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_382"
  type:"annotation_stop_fusion"
  top:"Node_382"
  bottom:"Node_381"
  layer_param {
    idx:382
    in_0 {name:"Node_381:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_382:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_384"
  type:"const"
  top:"Node_384"
  layer_param {
    idx:384
    out_0 {name:"Node_384:0",dtype:float32,shape:[128, 64, 3, 3]}
  }
}
layer {
  name:"Node_388"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_388"
  bottom:"Node_384"
  layer_param {
    idx:388
    in_0 {name:"Node_384:0",dtype:float32,shape:[128, 64, 3, 3]}
    out_0 {name:"Node_388:0",dtype:float32,shape:[128, 64, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_385:0', 'min': 'Node_386:0', 'max': 'Node_387:0'}
  }
}
layer {
  name:"Node_389"
  type:"nn_conv2d"
  top:"Node_389"
  bottom:"Node_382"
  bottom:"Node_388"
  layer_param {
    idx:389
    in_0 {name:"Node_382:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_388:0",dtype:float32,shape:[128, 64, 3, 3]}
    out_0 {name:"Node_389:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_393"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_393"
  bottom:"Node_389"
  layer_param {
    idx:393
    in_0 {name:"Node_389:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_393:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_390:0', 'min': 'Node_391:0', 'max': 'Node_392:0'}
  }
}
layer {
  name:"Node_394"
  type:"annotation_cast_hint"
  top:"Node_394"
  bottom:"Node_393"
  layer_param {
    idx:394
    in_0 {name:"Node_393:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_394:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_395"
  type:"annotation_stop_fusion"
  top:"Node_395"
  bottom:"Node_394"
  layer_param {
    idx:395
    in_0 {name:"Node_394:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_395:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_397"
  type:"const"
  top:"Node_397"
  layer_param {
    idx:397
    out_0 {name:"Node_397:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_401"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_401"
  bottom:"Node_397"
  layer_param {
    idx:401
    in_0 {name:"Node_397:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_401:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_398:0', 'min': 'Node_399:0', 'max': 'Node_400:0'}
  }
}
layer {
  name:"Node_402"
  type:"multiply"
  top:"Node_402"
  bottom:"Node_395"
  bottom:"Node_401"
  layer_param {
    idx:402
    in_0 {name:"Node_395:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_401:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_402:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_404"
  type:"const"
  top:"Node_404"
  layer_param {
    idx:404
    out_0 {name:"Node_404:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_408"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_408"
  bottom:"Node_404"
  layer_param {
    idx:408
    in_0 {name:"Node_404:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_408:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_405:0', 'min': 'Node_406:0', 'max': 'Node_407:0'}
  }
}
layer {
  name:"Node_409"
  type:"add"
  top:"Node_409"
  bottom:"Node_402"
  bottom:"Node_408"
  layer_param {
    idx:409
    in_0 {name:"Node_402:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_408:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_409:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_410"
  type:"nn_relu"
  top:"Node_410"
  bottom:"Node_409"
  layer_param {
    idx:410
    in_0 {name:"Node_409:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_410:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_414"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_414"
  bottom:"Node_410"
  layer_param {
    idx:414
    in_0 {name:"Node_410:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_414:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_411:0', 'min': 'Node_412:0', 'max': 'Node_413:0'}
  }
}
layer {
  name:"Node_415"
  type:"annotation_cast_hint"
  top:"Node_415"
  bottom:"Node_414"
  layer_param {
    idx:415
    in_0 {name:"Node_414:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_415:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_416"
  type:"annotation_stop_fusion"
  top:"Node_416"
  bottom:"Node_415"
  layer_param {
    idx:416
    in_0 {name:"Node_415:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_416:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_418"
  type:"const"
  top:"Node_418"
  layer_param {
    idx:418
    out_0 {name:"Node_418:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_422"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_422"
  bottom:"Node_418"
  layer_param {
    idx:422
    in_0 {name:"Node_418:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_422:0",dtype:float32,shape:[128, 128, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_419:0', 'min': 'Node_420:0', 'max': 'Node_421:0'}
  }
}
layer {
  name:"Node_423"
  type:"nn_conv2d"
  top:"Node_423"
  bottom:"Node_416"
  bottom:"Node_422"
  layer_param {
    idx:423
    in_0 {name:"Node_416:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_422:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_423:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_427"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_427"
  bottom:"Node_423"
  layer_param {
    idx:427
    in_0 {name:"Node_423:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_427:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_424:0', 'min': 'Node_425:0', 'max': 'Node_426:0'}
  }
}
layer {
  name:"Node_428"
  type:"annotation_cast_hint"
  top:"Node_428"
  bottom:"Node_427"
  layer_param {
    idx:428
    in_0 {name:"Node_427:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_428:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_429"
  type:"annotation_stop_fusion"
  top:"Node_429"
  bottom:"Node_428"
  layer_param {
    idx:429
    in_0 {name:"Node_428:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_429:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_431"
  type:"const"
  top:"Node_431"
  layer_param {
    idx:431
    out_0 {name:"Node_431:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_435"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_435"
  bottom:"Node_431"
  layer_param {
    idx:435
    in_0 {name:"Node_431:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_435:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_432:0', 'min': 'Node_433:0', 'max': 'Node_434:0'}
  }
}
layer {
  name:"Node_436"
  type:"multiply"
  top:"Node_436"
  bottom:"Node_429"
  bottom:"Node_435"
  layer_param {
    idx:436
    in_0 {name:"Node_429:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_435:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_436:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_438"
  type:"const"
  top:"Node_438"
  layer_param {
    idx:438
    out_0 {name:"Node_438:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_442"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_442"
  bottom:"Node_438"
  layer_param {
    idx:442
    in_0 {name:"Node_438:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_442:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_439:0', 'min': 'Node_440:0', 'max': 'Node_441:0'}
  }
}
layer {
  name:"Node_443"
  type:"add"
  top:"Node_443"
  bottom:"Node_436"
  bottom:"Node_442"
  layer_param {
    idx:443
    in_0 {name:"Node_436:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_442:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_443:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_447"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_447"
  bottom:"Node_443"
  layer_param {
    idx:447
    in_0 {name:"Node_443:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_447:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_444:0', 'min': 'Node_445:0', 'max': 'Node_446:0'}
  }
}
layer {
  name:"Node_448"
  type:"annotation_cast_hint"
  top:"Node_448"
  bottom:"Node_447"
  layer_param {
    idx:448
    in_0 {name:"Node_447:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_448:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_449"
  type:"annotation_stop_fusion"
  top:"Node_449"
  bottom:"Node_448"
  layer_param {
    idx:449
    in_0 {name:"Node_448:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_449:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_462"
  type:"annotation_cast_hint"
  top:"Node_462"
  bottom:"Node_380"
  layer_param {
    idx:462
    in_0 {name:"Node_380:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_462:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_463"
  type:"annotation_stop_fusion"
  top:"Node_463"
  bottom:"Node_462"
  layer_param {
    idx:463
    in_0 {name:"Node_462:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_463:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_465"
  type:"const"
  top:"Node_465"
  layer_param {
    idx:465
    out_0 {name:"Node_465:0",dtype:float32,shape:[128, 64, 1, 1]}
  }
}
layer {
  name:"Node_469"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_469"
  bottom:"Node_465"
  layer_param {
    idx:469
    in_0 {name:"Node_465:0",dtype:float32,shape:[128, 64, 1, 1]}
    out_0 {name:"Node_469:0",dtype:float32,shape:[128, 64, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_466:0', 'min': 'Node_467:0', 'max': 'Node_468:0'}
  }
}
layer {
  name:"Node_470"
  type:"nn_conv2d"
  top:"Node_470"
  bottom:"Node_463"
  bottom:"Node_469"
  layer_param {
    idx:470
    in_0 {name:"Node_463:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_469:0",dtype:float32,shape:[128, 64, 1, 1]}
    out_0 {name:"Node_470:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_474"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_474"
  bottom:"Node_470"
  layer_param {
    idx:474
    in_0 {name:"Node_470:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_474:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_471:0', 'min': 'Node_472:0', 'max': 'Node_473:0'}
  }
}
layer {
  name:"Node_475"
  type:"annotation_cast_hint"
  top:"Node_475"
  bottom:"Node_474"
  layer_param {
    idx:475
    in_0 {name:"Node_474:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_475:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_476"
  type:"annotation_stop_fusion"
  top:"Node_476"
  bottom:"Node_475"
  layer_param {
    idx:476
    in_0 {name:"Node_475:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_476:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_478"
  type:"const"
  top:"Node_478"
  layer_param {
    idx:478
    out_0 {name:"Node_478:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_482"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_482"
  bottom:"Node_478"
  layer_param {
    idx:482
    in_0 {name:"Node_478:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_482:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_479:0', 'min': 'Node_480:0', 'max': 'Node_481:0'}
  }
}
layer {
  name:"Node_483"
  type:"multiply"
  top:"Node_483"
  bottom:"Node_476"
  bottom:"Node_482"
  layer_param {
    idx:483
    in_0 {name:"Node_476:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_482:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_483:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_485"
  type:"const"
  top:"Node_485"
  layer_param {
    idx:485
    out_0 {name:"Node_485:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_489"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_489"
  bottom:"Node_485"
  layer_param {
    idx:489
    in_0 {name:"Node_485:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_489:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_486:0', 'min': 'Node_487:0', 'max': 'Node_488:0'}
  }
}
layer {
  name:"Node_490"
  type:"add"
  top:"Node_490"
  bottom:"Node_483"
  bottom:"Node_489"
  layer_param {
    idx:490
    in_0 {name:"Node_483:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_489:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_490:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_494"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_494"
  bottom:"Node_490"
  layer_param {
    idx:494
    in_0 {name:"Node_490:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_494:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_491:0', 'min': 'Node_492:0', 'max': 'Node_493:0'}
  }
}
layer {
  name:"Node_495"
  type:"annotation_cast_hint"
  top:"Node_495"
  bottom:"Node_494"
  layer_param {
    idx:495
    in_0 {name:"Node_494:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_495:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_496"
  type:"annotation_stop_fusion"
  top:"Node_496"
  bottom:"Node_495"
  layer_param {
    idx:496
    in_0 {name:"Node_495:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_496:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_497"
  type:"add"
  top:"Node_497"
  bottom:"Node_449"
  bottom:"Node_496"
  layer_param {
    idx:497
    in_0 {name:"Node_449:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_496:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_497:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_498"
  type:"nn_relu"
  top:"Node_498"
  bottom:"Node_497"
  layer_param {
    idx:498
    in_0 {name:"Node_497:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_498:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_502"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_502"
  bottom:"Node_498"
  layer_param {
    idx:502
    in_0 {name:"Node_498:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_502:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_499:0', 'min': 'Node_500:0', 'max': 'Node_501:0'}
  }
}
layer {
  name:"Node_503"
  type:"annotation_cast_hint"
  top:"Node_503"
  bottom:"Node_502"
  layer_param {
    idx:503
    in_0 {name:"Node_502:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_503:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_504"
  type:"annotation_stop_fusion"
  top:"Node_504"
  bottom:"Node_503"
  layer_param {
    idx:504
    in_0 {name:"Node_503:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_504:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_506"
  type:"const"
  top:"Node_506"
  layer_param {
    idx:506
    out_0 {name:"Node_506:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_510"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_510"
  bottom:"Node_506"
  layer_param {
    idx:510
    in_0 {name:"Node_506:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_510:0",dtype:float32,shape:[128, 128, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_507:0', 'min': 'Node_508:0', 'max': 'Node_509:0'}
  }
}
layer {
  name:"Node_511"
  type:"nn_conv2d"
  top:"Node_511"
  bottom:"Node_504"
  bottom:"Node_510"
  layer_param {
    idx:511
    in_0 {name:"Node_504:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_510:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_511:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_515"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_515"
  bottom:"Node_511"
  layer_param {
    idx:515
    in_0 {name:"Node_511:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_515:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_512:0', 'min': 'Node_513:0', 'max': 'Node_514:0'}
  }
}
layer {
  name:"Node_516"
  type:"annotation_cast_hint"
  top:"Node_516"
  bottom:"Node_515"
  layer_param {
    idx:516
    in_0 {name:"Node_515:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_516:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_517"
  type:"annotation_stop_fusion"
  top:"Node_517"
  bottom:"Node_516"
  layer_param {
    idx:517
    in_0 {name:"Node_516:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_517:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_519"
  type:"const"
  top:"Node_519"
  layer_param {
    idx:519
    out_0 {name:"Node_519:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_523"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_523"
  bottom:"Node_519"
  layer_param {
    idx:523
    in_0 {name:"Node_519:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_523:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_520:0', 'min': 'Node_521:0', 'max': 'Node_522:0'}
  }
}
layer {
  name:"Node_524"
  type:"multiply"
  top:"Node_524"
  bottom:"Node_517"
  bottom:"Node_523"
  layer_param {
    idx:524
    in_0 {name:"Node_517:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_523:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_524:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_526"
  type:"const"
  top:"Node_526"
  layer_param {
    idx:526
    out_0 {name:"Node_526:0",dtype:float32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_530"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_530"
  bottom:"Node_526"
  layer_param {
    idx:530
    in_0 {name:"Node_526:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_530:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_527:0', 'min': 'Node_528:0', 'max': 'Node_529:0'}
  }
}
layer {
  name:"Node_531"
  type:"add"
  top:"Node_531"
  bottom:"Node_524"
  bottom:"Node_530"
  layer_param {
    idx:531
    in_0 {name:"Node_524:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_530:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_531:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_532"
  type:"nn_relu"
  top:"Node_532"
  bottom:"Node_531"
  layer_param {
    idx:532
    in_0 {name:"Node_531:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_532:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_536"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_536"
  bottom:"Node_532"
  layer_param {
    idx:536
    in_0 {name:"Node_532:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_536:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_533:0', 'min': 'Node_534:0', 'max': 'Node_535:0'}
  }
}
layer {
  name:"Node_537"
  type:"annotation_cast_hint"
  top:"Node_537"
  bottom:"Node_536"
  layer_param {
    idx:537
    in_0 {name:"Node_536:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_537:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_538"
  type:"annotation_stop_fusion"
  top:"Node_538"
  bottom:"Node_537"
  layer_param {
    idx:538
    in_0 {name:"Node_537:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_538:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_540"
  type:"const"
  top:"Node_540"
  layer_param {
    idx:540
    out_0 {name:"Node_540:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_544"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_544"
  bottom:"Node_540"
  layer_param {
    idx:544
    in_0 {name:"Node_540:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_544:0",dtype:float32,shape:[128, 128, 3, 3]}
    attrs {'kind': 2, 'sign': 1, 'rounding': 'round', 'scale': 'Node_541:0', 'min': 'Node_542:0', 'max': 'Node_543:0'}
  }
}
layer {
  name:"Node_545"
  type:"nn_conv2d"
  top:"Node_545"
  bottom:"Node_538"
  bottom:"Node_544"
  layer_param {
    idx:545
    in_0 {name:"Node_538:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_544:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_545:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_549"
  type:"relay_op_annotation_simulated_quantize"
  top:"Node_549"
  bottom:"Node_545"
  layer_param {
    idx:549
    in_0 {name:"Node_545:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_549:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'kind': 1, 'sign': 1, 'rounding': 'round', 'scale': 'Node_546:0', 'min': 'Node_547:0', 'max': 'Node_548:0'}
  }
}
layer {
  name:"Node_550"
  type:"annotation_cast_hint"
  top:"Node_550"
  bottom:"Node_549"
  layer_param {
    idx:550
