name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:65
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"Node_67"
  type:"const"
  top:"Node_67"
  layer_param {
    idx:67
    out_0 {name:"Node_67:0",dtype:float32,shape:[64, 3, 7, 7]}
  }
}
layer {
  name:"Node_73"
  type:"const"
  top:"Node_73"
  layer_param {
    idx:73
    out_0 {name:"Node_73:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_76"
  type:"const"
  top:"Node_76"
  layer_param {
    idx:76
    out_0 {name:"Node_76:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_77"
  type:"const"
  top:"Node_77"
  layer_param {
    idx:77
    out_0 {name:"Node_77:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_78"
  type:"add"
  top:"Node_78"
  bottom:"Node_76"
  bottom:"Node_77"
  layer_param {
    idx:78
    in_0 {name:"Node_76:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_77:0",dtype:float32,shape:[]}
    out_0 {name:"Node_78:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_79"
  type:"sqrt"
  top:"Node_79"
  bottom:"Node_78"
  layer_param {
    idx:79
    in_0 {name:"Node_78:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_79:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_80"
  type:"divide"
  top:"Node_80"
  bottom:"Node_73"
  bottom:"Node_79"
  layer_param {
    idx:80
    in_0 {name:"Node_73:0",dtype:float32,shape:[]}
    in_1 {name:"Node_79:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_80:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_81"
  type:"const"
  top:"Node_81"
  layer_param {
    idx:81
    out_0 {name:"Node_81:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_82"
  type:"multiply"
  top:"Node_82"
  bottom:"Node_80"
  bottom:"Node_81"
  layer_param {
    idx:82
    in_0 {name:"Node_80:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_81:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_82:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_83"
  type:"expand_dims"
  top:"Node_83"
  bottom:"Node_82"
  layer_param {
    idx:83
    in_0 {name:"Node_82:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_83:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_84"
  type:"squeeze"
  top:"Node_84"
  bottom:"Node_83"
  layer_param {
    idx:84
    in_0 {name:"Node_83:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_84:0",dtype:float32,shape:[64]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_85"
  type:"expand_dims"
  top:"Node_85"
  bottom:"Node_84"
  layer_param {
    idx:85
    in_0 {name:"Node_84:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_85:0",dtype:float32,shape:[64, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_86"
  type:"multiply"
  top:"Node_86"
  bottom:"Node_67"
  bottom:"Node_85"
  layer_param {
    idx:86
    in_0 {name:"Node_67:0",dtype:float32,shape:[64, 3, 7, 7]}
    in_1 {name:"Node_85:0",dtype:float32,shape:[64, 1, 1, 1]}
    out_0 {name:"Node_86:0",dtype:float32,shape:[64, 3, 7, 7]}
  }
}
layer {
  name:"Node_87"
  type:"nn.conv2d"
  top:"Node_87"
  bottom:"input0"
  bottom:"Node_86"
  layer_param {
    idx:87
    in_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_86:0",dtype:float32,shape:[64, 3, 7, 7]}
    out_0 {name:"Node_87:0",dtype:float32,shape:[1, 64, 112, 112]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_92"
  type:"const"
  top:"Node_92"
  layer_param {
    idx:92
    out_0 {name:"Node_92:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_93"
  type:"negative"
  top:"Node_93"
  bottom:"Node_92"
  layer_param {
    idx:93
    in_0 {name:"Node_92:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_93:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_95"
  type:"multiply"
  top:"Node_95"
  bottom:"Node_93"
  bottom:"Node_82"
  layer_param {
    idx:95
    in_0 {name:"Node_93:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_82:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_95:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_96"
  type:"const"
  top:"Node_96"
  layer_param {
    idx:96
    out_0 {name:"Node_96:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_97"
  type:"add"
  top:"Node_97"
  bottom:"Node_95"
  bottom:"Node_96"
  layer_param {
    idx:97
    in_0 {name:"Node_95:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_96:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_97:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_98"
  type:"expand_dims"
  top:"Node_98"
  bottom:"Node_97"
  layer_param {
    idx:98
    in_0 {name:"Node_97:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_98:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_99"
  type:"add"
  top:"Node_99"
  bottom:"Node_87"
  bottom:"Node_98"
  layer_param {
    idx:99
    in_0 {name:"Node_87:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_98:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_99:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_100"
  type:"nn.relu"
  top:"Node_100"
  bottom:"Node_99"
  layer_param {
    idx:100
    in_0 {name:"Node_99:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_100:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_101"
  type:"nn.max_pool2d"
  top:"Node_101"
  bottom:"Node_100"
  layer_param {
    idx:101
    in_0 {name:"Node_100:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_101:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_103"
  type:"const"
  top:"Node_103"
  layer_param {
    idx:103
    out_0 {name:"Node_103:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_109"
  type:"const"
  top:"Node_109"
  layer_param {
    idx:109
    out_0 {name:"Node_109:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_112"
  type:"const"
  top:"Node_112"
  layer_param {
    idx:112
    out_0 {name:"Node_112:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_113"
  type:"const"
  top:"Node_113"
  layer_param {
    idx:113
    out_0 {name:"Node_113:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_114"
  type:"add"
  top:"Node_114"
  bottom:"Node_112"
  bottom:"Node_113"
  layer_param {
    idx:114
    in_0 {name:"Node_112:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_113:0",dtype:float32,shape:[]}
    out_0 {name:"Node_114:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_115"
  type:"sqrt"
  top:"Node_115"
  bottom:"Node_114"
  layer_param {
    idx:115
    in_0 {name:"Node_114:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_115:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_116"
  type:"divide"
  top:"Node_116"
  bottom:"Node_109"
  bottom:"Node_115"
  layer_param {
    idx:116
    in_0 {name:"Node_109:0",dtype:float32,shape:[]}
    in_1 {name:"Node_115:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_116:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_117"
  type:"const"
  top:"Node_117"
  layer_param {
    idx:117
    out_0 {name:"Node_117:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_118"
  type:"multiply"
  top:"Node_118"
  bottom:"Node_116"
  bottom:"Node_117"
  layer_param {
    idx:118
    in_0 {name:"Node_116:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_117:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_118:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_119"
  type:"expand_dims"
  top:"Node_119"
  bottom:"Node_118"
  layer_param {
    idx:119
    in_0 {name:"Node_118:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_119:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_120"
  type:"squeeze"
  top:"Node_120"
  bottom:"Node_119"
  layer_param {
    idx:120
    in_0 {name:"Node_119:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_120:0",dtype:float32,shape:[64]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_121"
  type:"expand_dims"
  top:"Node_121"
  bottom:"Node_120"
  layer_param {
    idx:121
    in_0 {name:"Node_120:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_121:0",dtype:float32,shape:[64, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_122"
  type:"multiply"
  top:"Node_122"
  bottom:"Node_103"
  bottom:"Node_121"
  layer_param {
    idx:122
    in_0 {name:"Node_103:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_1 {name:"Node_121:0",dtype:float32,shape:[64, 1, 1, 1]}
    out_0 {name:"Node_122:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_123"
  type:"nn.conv2d"
  top:"Node_123"
  bottom:"Node_101"
  bottom:"Node_122"
  layer_param {
    idx:123
    in_0 {name:"Node_101:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_122:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_123:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_128"
  type:"const"
  top:"Node_128"
  layer_param {
    idx:128
    out_0 {name:"Node_128:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_129"
  type:"negative"
  top:"Node_129"
  bottom:"Node_128"
  layer_param {
    idx:129
    in_0 {name:"Node_128:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_129:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_131"
  type:"multiply"
  top:"Node_131"
  bottom:"Node_129"
  bottom:"Node_118"
  layer_param {
    idx:131
    in_0 {name:"Node_129:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_118:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_131:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_132"
  type:"const"
  top:"Node_132"
  layer_param {
    idx:132
    out_0 {name:"Node_132:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_133"
  type:"add"
  top:"Node_133"
  bottom:"Node_131"
  bottom:"Node_132"
  layer_param {
    idx:133
    in_0 {name:"Node_131:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_132:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_133:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_134"
  type:"expand_dims"
  top:"Node_134"
  bottom:"Node_133"
  layer_param {
    idx:134
    in_0 {name:"Node_133:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_134:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_135"
  type:"add"
  top:"Node_135"
  bottom:"Node_123"
  bottom:"Node_134"
  layer_param {
    idx:135
    in_0 {name:"Node_123:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_134:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_135:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_136"
  type:"nn.relu"
  top:"Node_136"
  bottom:"Node_135"
  layer_param {
    idx:136
    in_0 {name:"Node_135:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_136:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_138"
  type:"const"
  top:"Node_138"
  layer_param {
    idx:138
    out_0 {name:"Node_138:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_144"
  type:"const"
  top:"Node_144"
  layer_param {
    idx:144
    out_0 {name:"Node_144:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_147"
  type:"const"
  top:"Node_147"
  layer_param {
    idx:147
    out_0 {name:"Node_147:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_148"
  type:"const"
  top:"Node_148"
  layer_param {
    idx:148
    out_0 {name:"Node_148:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_149"
  type:"add"
  top:"Node_149"
  bottom:"Node_147"
  bottom:"Node_148"
  layer_param {
    idx:149
    in_0 {name:"Node_147:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_148:0",dtype:float32,shape:[]}
    out_0 {name:"Node_149:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_150"
  type:"sqrt"
  top:"Node_150"
  bottom:"Node_149"
  layer_param {
    idx:150
    in_0 {name:"Node_149:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_150:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_151"
  type:"divide"
  top:"Node_151"
  bottom:"Node_144"
  bottom:"Node_150"
  layer_param {
    idx:151
    in_0 {name:"Node_144:0",dtype:float32,shape:[]}
    in_1 {name:"Node_150:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_151:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_152"
  type:"const"
  top:"Node_152"
  layer_param {
    idx:152
    out_0 {name:"Node_152:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_153"
  type:"multiply"
  top:"Node_153"
  bottom:"Node_151"
  bottom:"Node_152"
  layer_param {
    idx:153
    in_0 {name:"Node_151:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_152:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_153:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_154"
  type:"expand_dims"
  top:"Node_154"
  bottom:"Node_153"
  layer_param {
    idx:154
    in_0 {name:"Node_153:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_154:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_155"
  type:"squeeze"
  top:"Node_155"
  bottom:"Node_154"
  layer_param {
    idx:155
    in_0 {name:"Node_154:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_155:0",dtype:float32,shape:[64]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_156"
  type:"expand_dims"
  top:"Node_156"
  bottom:"Node_155"
  layer_param {
    idx:156
    in_0 {name:"Node_155:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_156:0",dtype:float32,shape:[64, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_157"
  type:"multiply"
  top:"Node_157"
  bottom:"Node_138"
  bottom:"Node_156"
  layer_param {
    idx:157
    in_0 {name:"Node_138:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_1 {name:"Node_156:0",dtype:float32,shape:[64, 1, 1, 1]}
    out_0 {name:"Node_157:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_158"
  type:"nn.conv2d"
  top:"Node_158"
  bottom:"Node_136"
  bottom:"Node_157"
  layer_param {
    idx:158
    in_0 {name:"Node_136:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_157:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_158:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_163"
  type:"const"
  top:"Node_163"
  layer_param {
    idx:163
    out_0 {name:"Node_163:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_164"
  type:"negative"
  top:"Node_164"
  bottom:"Node_163"
  layer_param {
    idx:164
    in_0 {name:"Node_163:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_164:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_166"
  type:"multiply"
  top:"Node_166"
  bottom:"Node_164"
  bottom:"Node_153"
  layer_param {
    idx:166
    in_0 {name:"Node_164:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_153:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_166:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_167"
  type:"const"
  top:"Node_167"
  layer_param {
    idx:167
    out_0 {name:"Node_167:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_168"
  type:"add"
  top:"Node_168"
  bottom:"Node_166"
  bottom:"Node_167"
  layer_param {
    idx:168
    in_0 {name:"Node_166:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_167:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_168:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_169"
  type:"expand_dims"
  top:"Node_169"
  bottom:"Node_168"
  layer_param {
    idx:169
    in_0 {name:"Node_168:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_169:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_170"
  type:"add"
  top:"Node_170"
  bottom:"Node_158"
  bottom:"Node_169"
  layer_param {
    idx:170
    in_0 {name:"Node_158:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_169:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_170:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_172"
  type:"add"
  top:"Node_172"
  bottom:"Node_170"
  bottom:"Node_101"
  layer_param {
    idx:172
    in_0 {name:"Node_170:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_101:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_172:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_173"
  type:"nn.relu"
  top:"Node_173"
  bottom:"Node_172"
  layer_param {
    idx:173
    in_0 {name:"Node_172:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_173:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_175"
  type:"const"
  top:"Node_175"
  layer_param {
    idx:175
    out_0 {name:"Node_175:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_181"
  type:"const"
  top:"Node_181"
  layer_param {
    idx:181
    out_0 {name:"Node_181:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_184"
  type:"const"
  top:"Node_184"
  layer_param {
    idx:184
    out_0 {name:"Node_184:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_185"
  type:"const"
  top:"Node_185"
  layer_param {
    idx:185
    out_0 {name:"Node_185:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_186"
  type:"add"
  top:"Node_186"
  bottom:"Node_184"
  bottom:"Node_185"
  layer_param {
    idx:186
    in_0 {name:"Node_184:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_185:0",dtype:float32,shape:[]}
    out_0 {name:"Node_186:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_187"
  type:"sqrt"
  top:"Node_187"
  bottom:"Node_186"
  layer_param {
    idx:187
    in_0 {name:"Node_186:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_187:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_188"
  type:"divide"
  top:"Node_188"
  bottom:"Node_181"
  bottom:"Node_187"
  layer_param {
    idx:188
    in_0 {name:"Node_181:0",dtype:float32,shape:[]}
    in_1 {name:"Node_187:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_188:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_189"
  type:"const"
  top:"Node_189"
  layer_param {
    idx:189
    out_0 {name:"Node_189:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_190"
  type:"multiply"
  top:"Node_190"
  bottom:"Node_188"
  bottom:"Node_189"
  layer_param {
    idx:190
    in_0 {name:"Node_188:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_189:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_190:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_191"
  type:"expand_dims"
  top:"Node_191"
  bottom:"Node_190"
  layer_param {
    idx:191
    in_0 {name:"Node_190:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_191:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_192"
  type:"squeeze"
  top:"Node_192"
  bottom:"Node_191"
  layer_param {
    idx:192
    in_0 {name:"Node_191:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_192:0",dtype:float32,shape:[64]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_193"
  type:"expand_dims"
  top:"Node_193"
  bottom:"Node_192"
  layer_param {
    idx:193
    in_0 {name:"Node_192:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_193:0",dtype:float32,shape:[64, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_194"
  type:"multiply"
  top:"Node_194"
  bottom:"Node_175"
  bottom:"Node_193"
  layer_param {
    idx:194
    in_0 {name:"Node_175:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_1 {name:"Node_193:0",dtype:float32,shape:[64, 1, 1, 1]}
    out_0 {name:"Node_194:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_195"
  type:"nn.conv2d"
  top:"Node_195"
  bottom:"Node_173"
  bottom:"Node_194"
  layer_param {
    idx:195
    in_0 {name:"Node_173:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_194:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_195:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_200"
  type:"const"
  top:"Node_200"
  layer_param {
    idx:200
    out_0 {name:"Node_200:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_201"
  type:"negative"
  top:"Node_201"
  bottom:"Node_200"
  layer_param {
    idx:201
    in_0 {name:"Node_200:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_201:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_203"
  type:"multiply"
  top:"Node_203"
  bottom:"Node_201"
  bottom:"Node_190"
  layer_param {
    idx:203
    in_0 {name:"Node_201:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_190:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_203:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_204"
  type:"const"
  top:"Node_204"
  layer_param {
    idx:204
    out_0 {name:"Node_204:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_205"
  type:"add"
  top:"Node_205"
  bottom:"Node_203"
  bottom:"Node_204"
  layer_param {
    idx:205
    in_0 {name:"Node_203:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_204:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_205:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_206"
  type:"expand_dims"
  top:"Node_206"
  bottom:"Node_205"
  layer_param {
    idx:206
    in_0 {name:"Node_205:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_206:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_207"
  type:"add"
  top:"Node_207"
  bottom:"Node_195"
  bottom:"Node_206"
  layer_param {
    idx:207
    in_0 {name:"Node_195:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_206:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_207:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_208"
  type:"nn.relu"
  top:"Node_208"
  bottom:"Node_207"
  layer_param {
    idx:208
    in_0 {name:"Node_207:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_208:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_210"
  type:"const"
  top:"Node_210"
  layer_param {
    idx:210
    out_0 {name:"Node_210:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_216"
  type:"const"
  top:"Node_216"
  layer_param {
    idx:216
    out_0 {name:"Node_216:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_219"
  type:"const"
  top:"Node_219"
  layer_param {
    idx:219
    out_0 {name:"Node_219:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_220"
  type:"const"
  top:"Node_220"
  layer_param {
    idx:220
    out_0 {name:"Node_220:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_221"
  type:"add"
  top:"Node_221"
  bottom:"Node_219"
  bottom:"Node_220"
  layer_param {
    idx:221
    in_0 {name:"Node_219:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_220:0",dtype:float32,shape:[]}
    out_0 {name:"Node_221:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_222"
  type:"sqrt"
  top:"Node_222"
  bottom:"Node_221"
  layer_param {
    idx:222
    in_0 {name:"Node_221:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_222:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_223"
  type:"divide"
  top:"Node_223"
  bottom:"Node_216"
  bottom:"Node_222"
  layer_param {
    idx:223
    in_0 {name:"Node_216:0",dtype:float32,shape:[]}
    in_1 {name:"Node_222:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_223:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_224"
  type:"const"
  top:"Node_224"
  layer_param {
    idx:224
    out_0 {name:"Node_224:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_225"
  type:"multiply"
  top:"Node_225"
  bottom:"Node_223"
  bottom:"Node_224"
  layer_param {
    idx:225
    in_0 {name:"Node_223:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_224:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_225:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_226"
  type:"expand_dims"
  top:"Node_226"
  bottom:"Node_225"
  layer_param {
    idx:226
    in_0 {name:"Node_225:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_226:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_227"
  type:"squeeze"
  top:"Node_227"
  bottom:"Node_226"
  layer_param {
    idx:227
    in_0 {name:"Node_226:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_227:0",dtype:float32,shape:[64]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_228"
  type:"expand_dims"
  top:"Node_228"
  bottom:"Node_227"
  layer_param {
    idx:228
    in_0 {name:"Node_227:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_228:0",dtype:float32,shape:[64, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_229"
  type:"multiply"
  top:"Node_229"
  bottom:"Node_210"
  bottom:"Node_228"
  layer_param {
    idx:229
    in_0 {name:"Node_210:0",dtype:float32,shape:[64, 64, 3, 3]}
    in_1 {name:"Node_228:0",dtype:float32,shape:[64, 1, 1, 1]}
    out_0 {name:"Node_229:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_230"
  type:"nn.conv2d"
  top:"Node_230"
  bottom:"Node_208"
  bottom:"Node_229"
  layer_param {
    idx:230
    in_0 {name:"Node_208:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_229:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_230:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_235"
  type:"const"
  top:"Node_235"
  layer_param {
    idx:235
    out_0 {name:"Node_235:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_236"
  type:"negative"
  top:"Node_236"
  bottom:"Node_235"
  layer_param {
    idx:236
    in_0 {name:"Node_235:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_236:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_238"
  type:"multiply"
  top:"Node_238"
  bottom:"Node_236"
  bottom:"Node_225"
  layer_param {
    idx:238
    in_0 {name:"Node_236:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_225:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_238:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_239"
  type:"const"
  top:"Node_239"
  layer_param {
    idx:239
    out_0 {name:"Node_239:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_240"
  type:"add"
  top:"Node_240"
  bottom:"Node_238"
  bottom:"Node_239"
  layer_param {
    idx:240
    in_0 {name:"Node_238:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_239:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_240:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_241"
  type:"expand_dims"
  top:"Node_241"
  bottom:"Node_240"
  layer_param {
    idx:241
    in_0 {name:"Node_240:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_241:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_242"
  type:"add"
  top:"Node_242"
  bottom:"Node_230"
  bottom:"Node_241"
  layer_param {
    idx:242
    in_0 {name:"Node_230:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_241:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_242:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_244"
  type:"add"
  top:"Node_244"
  bottom:"Node_242"
  bottom:"Node_173"
  layer_param {
    idx:244
    in_0 {name:"Node_242:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_173:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_244:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_245"
  type:"nn.relu"
  top:"Node_245"
  bottom:"Node_244"
  layer_param {
    idx:245
    in_0 {name:"Node_244:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_245:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_247"
  type:"const"
  top:"Node_247"
  layer_param {
    idx:247
    out_0 {name:"Node_247:0",dtype:float32,shape:[128, 64, 3, 3]}
  }
}
layer {
  name:"Node_253"
  type:"const"
  top:"Node_253"
  layer_param {
    idx:253
    out_0 {name:"Node_253:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_256"
  type:"const"
  top:"Node_256"
  layer_param {
    idx:256
    out_0 {name:"Node_256:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_257"
  type:"const"
  top:"Node_257"
  layer_param {
    idx:257
    out_0 {name:"Node_257:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_258"
  type:"add"
  top:"Node_258"
  bottom:"Node_256"
  bottom:"Node_257"
  layer_param {
    idx:258
    in_0 {name:"Node_256:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_257:0",dtype:float32,shape:[]}
    out_0 {name:"Node_258:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_259"
  type:"sqrt"
  top:"Node_259"
  bottom:"Node_258"
  layer_param {
    idx:259
    in_0 {name:"Node_258:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_259:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_260"
  type:"divide"
  top:"Node_260"
  bottom:"Node_253"
  bottom:"Node_259"
  layer_param {
    idx:260
    in_0 {name:"Node_253:0",dtype:float32,shape:[]}
    in_1 {name:"Node_259:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_260:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_261"
  type:"const"
  top:"Node_261"
  layer_param {
    idx:261
    out_0 {name:"Node_261:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_262"
  type:"multiply"
  top:"Node_262"
  bottom:"Node_260"
  bottom:"Node_261"
  layer_param {
    idx:262
    in_0 {name:"Node_260:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_261:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_262:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_263"
  type:"expand_dims"
  top:"Node_263"
  bottom:"Node_262"
  layer_param {
    idx:263
    in_0 {name:"Node_262:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_263:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_264"
  type:"squeeze"
  top:"Node_264"
  bottom:"Node_263"
  layer_param {
    idx:264
    in_0 {name:"Node_263:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_264:0",dtype:float32,shape:[128]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_265"
  type:"expand_dims"
  top:"Node_265"
  bottom:"Node_264"
  layer_param {
    idx:265
    in_0 {name:"Node_264:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_265:0",dtype:float32,shape:[128, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_266"
  type:"multiply"
  top:"Node_266"
  bottom:"Node_247"
  bottom:"Node_265"
  layer_param {
    idx:266
    in_0 {name:"Node_247:0",dtype:float32,shape:[128, 64, 3, 3]}
    in_1 {name:"Node_265:0",dtype:float32,shape:[128, 1, 1, 1]}
    out_0 {name:"Node_266:0",dtype:float32,shape:[128, 64, 3, 3]}
  }
}
layer {
  name:"Node_267"
  type:"nn.conv2d"
  top:"Node_267"
  bottom:"Node_245"
  bottom:"Node_266"
  layer_param {
    idx:267
    in_0 {name:"Node_245:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_266:0",dtype:float32,shape:[128, 64, 3, 3]}
    out_0 {name:"Node_267:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_272"
  type:"const"
  top:"Node_272"
  layer_param {
    idx:272
    out_0 {name:"Node_272:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_273"
  type:"negative"
  top:"Node_273"
  bottom:"Node_272"
  layer_param {
    idx:273
    in_0 {name:"Node_272:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_273:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_275"
  type:"multiply"
  top:"Node_275"
  bottom:"Node_273"
  bottom:"Node_262"
  layer_param {
    idx:275
    in_0 {name:"Node_273:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_262:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_275:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_276"
  type:"const"
  top:"Node_276"
  layer_param {
    idx:276
    out_0 {name:"Node_276:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_277"
  type:"add"
  top:"Node_277"
  bottom:"Node_275"
  bottom:"Node_276"
  layer_param {
    idx:277
    in_0 {name:"Node_275:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_276:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_277:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_278"
  type:"expand_dims"
  top:"Node_278"
  bottom:"Node_277"
  layer_param {
    idx:278
    in_0 {name:"Node_277:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_278:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_279"
  type:"add"
  top:"Node_279"
  bottom:"Node_267"
  bottom:"Node_278"
  layer_param {
    idx:279
    in_0 {name:"Node_267:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_278:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_279:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_280"
  type:"nn.relu"
  top:"Node_280"
  bottom:"Node_279"
  layer_param {
    idx:280
    in_0 {name:"Node_279:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_280:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_282"
  type:"const"
  top:"Node_282"
  layer_param {
    idx:282
    out_0 {name:"Node_282:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_288"
  type:"const"
  top:"Node_288"
  layer_param {
    idx:288
    out_0 {name:"Node_288:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_291"
  type:"const"
  top:"Node_291"
  layer_param {
    idx:291
    out_0 {name:"Node_291:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_292"
  type:"const"
  top:"Node_292"
  layer_param {
    idx:292
    out_0 {name:"Node_292:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_293"
  type:"add"
  top:"Node_293"
  bottom:"Node_291"
  bottom:"Node_292"
  layer_param {
    idx:293
    in_0 {name:"Node_291:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_292:0",dtype:float32,shape:[]}
    out_0 {name:"Node_293:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_294"
  type:"sqrt"
  top:"Node_294"
  bottom:"Node_293"
  layer_param {
    idx:294
    in_0 {name:"Node_293:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_294:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_295"
  type:"divide"
  top:"Node_295"
  bottom:"Node_288"
  bottom:"Node_294"
  layer_param {
    idx:295
    in_0 {name:"Node_288:0",dtype:float32,shape:[]}
    in_1 {name:"Node_294:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_295:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_296"
  type:"const"
  top:"Node_296"
  layer_param {
    idx:296
    out_0 {name:"Node_296:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_297"
  type:"multiply"
  top:"Node_297"
  bottom:"Node_295"
  bottom:"Node_296"
  layer_param {
    idx:297
    in_0 {name:"Node_295:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_296:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_297:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_298"
  type:"expand_dims"
  top:"Node_298"
  bottom:"Node_297"
  layer_param {
    idx:298
    in_0 {name:"Node_297:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_298:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_299"
  type:"squeeze"
  top:"Node_299"
  bottom:"Node_298"
  layer_param {
    idx:299
    in_0 {name:"Node_298:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_299:0",dtype:float32,shape:[128]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_300"
  type:"expand_dims"
  top:"Node_300"
  bottom:"Node_299"
  layer_param {
    idx:300
    in_0 {name:"Node_299:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_300:0",dtype:float32,shape:[128, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_301"
  type:"multiply"
  top:"Node_301"
  bottom:"Node_282"
  bottom:"Node_300"
  layer_param {
    idx:301
    in_0 {name:"Node_282:0",dtype:float32,shape:[128, 128, 3, 3]}
    in_1 {name:"Node_300:0",dtype:float32,shape:[128, 1, 1, 1]}
    out_0 {name:"Node_301:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_302"
  type:"nn.conv2d"
  top:"Node_302"
  bottom:"Node_280"
  bottom:"Node_301"
  layer_param {
    idx:302
    in_0 {name:"Node_280:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_301:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_302:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_307"
  type:"const"
  top:"Node_307"
  layer_param {
    idx:307
    out_0 {name:"Node_307:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_308"
  type:"negative"
  top:"Node_308"
  bottom:"Node_307"
  layer_param {
    idx:308
    in_0 {name:"Node_307:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_308:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_310"
  type:"multiply"
  top:"Node_310"
  bottom:"Node_308"
  bottom:"Node_297"
  layer_param {
    idx:310
    in_0 {name:"Node_308:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_297:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_310:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_311"
  type:"const"
  top:"Node_311"
  layer_param {
    idx:311
    out_0 {name:"Node_311:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_312"
  type:"add"
  top:"Node_312"
  bottom:"Node_310"
  bottom:"Node_311"
  layer_param {
    idx:312
    in_0 {name:"Node_310:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_311:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_312:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_313"
  type:"expand_dims"
  top:"Node_313"
  bottom:"Node_312"
  layer_param {
    idx:313
    in_0 {name:"Node_312:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_313:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_314"
  type:"add"
  top:"Node_314"
  bottom:"Node_302"
  bottom:"Node_313"
  layer_param {
    idx:314
    in_0 {name:"Node_302:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_313:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_314:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_319"
  type:"const"
  top:"Node_319"
  layer_param {
    idx:319
    out_0 {name:"Node_319:0",dtype:float32,shape:[128, 64, 1, 1]}
  }
}
layer {
  name:"Node_325"
  type:"const"
  top:"Node_325"
  layer_param {
    idx:325
    out_0 {name:"Node_325:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_328"
  type:"const"
  top:"Node_328"
  layer_param {
    idx:328
    out_0 {name:"Node_328:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_329"
  type:"const"
  top:"Node_329"
  layer_param {
    idx:329
    out_0 {name:"Node_329:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_330"
  type:"add"
  top:"Node_330"
  bottom:"Node_328"
  bottom:"Node_329"
  layer_param {
    idx:330
    in_0 {name:"Node_328:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_329:0",dtype:float32,shape:[]}
    out_0 {name:"Node_330:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_331"
  type:"sqrt"
  top:"Node_331"
  bottom:"Node_330"
  layer_param {
    idx:331
    in_0 {name:"Node_330:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_331:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_332"
  type:"divide"
  top:"Node_332"
  bottom:"Node_325"
  bottom:"Node_331"
  layer_param {
    idx:332
    in_0 {name:"Node_325:0",dtype:float32,shape:[]}
    in_1 {name:"Node_331:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_332:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_333"
  type:"const"
  top:"Node_333"
  layer_param {
    idx:333
    out_0 {name:"Node_333:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_334"
  type:"multiply"
  top:"Node_334"
  bottom:"Node_332"
  bottom:"Node_333"
  layer_param {
    idx:334
    in_0 {name:"Node_332:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_333:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_334:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_335"
  type:"expand_dims"
  top:"Node_335"
  bottom:"Node_334"
  layer_param {
    idx:335
    in_0 {name:"Node_334:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_335:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_336"
  type:"squeeze"
  top:"Node_336"
  bottom:"Node_335"
  layer_param {
    idx:336
    in_0 {name:"Node_335:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_336:0",dtype:float32,shape:[128]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_337"
  type:"expand_dims"
  top:"Node_337"
  bottom:"Node_336"
  layer_param {
    idx:337
    in_0 {name:"Node_336:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_337:0",dtype:float32,shape:[128, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_338"
  type:"multiply"
  top:"Node_338"
  bottom:"Node_319"
  bottom:"Node_337"
  layer_param {
    idx:338
    in_0 {name:"Node_319:0",dtype:float32,shape:[128, 64, 1, 1]}
    in_1 {name:"Node_337:0",dtype:float32,shape:[128, 1, 1, 1]}
    out_0 {name:"Node_338:0",dtype:float32,shape:[128, 64, 1, 1]}
  }
}
layer {
  name:"Node_339"
  type:"nn.conv2d"
  top:"Node_339"
  bottom:"Node_245"
  bottom:"Node_338"
  layer_param {
    idx:339
    in_0 {name:"Node_245:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_338:0",dtype:float32,shape:[128, 64, 1, 1]}
    out_0 {name:"Node_339:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_344"
  type:"const"
  top:"Node_344"
  layer_param {
    idx:344
    out_0 {name:"Node_344:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_345"
  type:"negative"
  top:"Node_345"
  bottom:"Node_344"
  layer_param {
    idx:345
    in_0 {name:"Node_344:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_345:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_347"
  type:"multiply"
  top:"Node_347"
  bottom:"Node_345"
  bottom:"Node_334"
  layer_param {
    idx:347
    in_0 {name:"Node_345:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_334:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_347:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_348"
  type:"const"
  top:"Node_348"
  layer_param {
    idx:348
    out_0 {name:"Node_348:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_349"
  type:"add"
  top:"Node_349"
  bottom:"Node_347"
  bottom:"Node_348"
  layer_param {
    idx:349
    in_0 {name:"Node_347:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_348:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_349:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_350"
  type:"expand_dims"
  top:"Node_350"
  bottom:"Node_349"
  layer_param {
    idx:350
    in_0 {name:"Node_349:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_350:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_351"
  type:"add"
  top:"Node_351"
  bottom:"Node_339"
  bottom:"Node_350"
  layer_param {
    idx:351
    in_0 {name:"Node_339:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_350:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_351:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_352"
  type:"add"
  top:"Node_352"
  bottom:"Node_314"
  bottom:"Node_351"
  layer_param {
    idx:352
    in_0 {name:"Node_314:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_351:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_352:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_353"
  type:"nn.relu"
  top:"Node_353"
  bottom:"Node_352"
  layer_param {
    idx:353
    in_0 {name:"Node_352:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_353:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_355"
  type:"const"
  top:"Node_355"
  layer_param {
    idx:355
    out_0 {name:"Node_355:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_361"
  type:"const"
  top:"Node_361"
  layer_param {
    idx:361
    out_0 {name:"Node_361:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_364"
  type:"const"
  top:"Node_364"
  layer_param {
    idx:364
    out_0 {name:"Node_364:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_365"
  type:"const"
  top:"Node_365"
  layer_param {
    idx:365
    out_0 {name:"Node_365:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_366"
  type:"add"
  top:"Node_366"
  bottom:"Node_364"
  bottom:"Node_365"
  layer_param {
    idx:366
    in_0 {name:"Node_364:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_365:0",dtype:float32,shape:[]}
    out_0 {name:"Node_366:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_367"
  type:"sqrt"
  top:"Node_367"
  bottom:"Node_366"
  layer_param {
    idx:367
    in_0 {name:"Node_366:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_367:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_368"
  type:"divide"
  top:"Node_368"
  bottom:"Node_361"
  bottom:"Node_367"
  layer_param {
    idx:368
    in_0 {name:"Node_361:0",dtype:float32,shape:[]}
    in_1 {name:"Node_367:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_368:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_369"
  type:"const"
  top:"Node_369"
  layer_param {
    idx:369
    out_0 {name:"Node_369:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_370"
  type:"multiply"
  top:"Node_370"
  bottom:"Node_368"
  bottom:"Node_369"
  layer_param {
    idx:370
    in_0 {name:"Node_368:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_369:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_370:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_371"
  type:"expand_dims"
  top:"Node_371"
  bottom:"Node_370"
  layer_param {
    idx:371
    in_0 {name:"Node_370:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_371:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_372"
  type:"squeeze"
  top:"Node_372"
  bottom:"Node_371"
  layer_param {
    idx:372
    in_0 {name:"Node_371:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_372:0",dtype:float32,shape:[128]}
    attrs {'axis': [1, 2]}
  }
}
layer {
  name:"Node_373"
  type:"expand_dims"
  top:"Node_373"
  bottom:"Node_372"
  layer_param {
    idx:373
    in_0 {name:"Node_372:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_373:0",dtype:float32,shape:[128, 1, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 3}
  }
}
layer {
  name:"Node_374"
  type:"multiply"
  top:"Node_374"
  bottom:"Node_355"
  bottom:"Node_373"
  layer_param {
    idx:374
    in_0 {name:"Node_355:0",dtype:float32,shape:[128, 128, 3, 3]}
    in_1 {name:"Node_373:0",dtype:float32,shape:[128, 1, 1, 1]}
    out_0 {name:"Node_374:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_375"
  type:"nn.conv2d"
  top:"Node_375"
  bottom:"Node_353"
  bottom:"Node_374"
  layer_param {
    idx:375
    in_0 {name:"Node_353:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_374:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_375:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_380"
  type:"const"
  top:"Node_380"
  layer_param {
    idx:380
    out_0 {name:"Node_380:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_381"
  type:"negative"
  top:"Node_381"
  bottom:"Node_380"
  layer_param {
    idx:381
    in_0 {name:"Node_380:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_381:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_383"
  type:"multiply"
  top:"Node_383"
  bottom:"Node_381"
  bottom:"Node_370"
  layer_param {
    idx:383
    in_0 {name:"Node_381:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_370:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_383:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_384"
  type:"const"
  top:"Node_384"
  layer_param {
    idx:384
    out_0 {name:"Node_384:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_385"
  type:"add"
  top:"Node_385"
  bottom:"Node_383"
  bottom:"Node_384"
  layer_param {
    idx:385
    in_0 {name:"Node_383:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_384:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_385:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_386"
  type:"expand_dims"
  top:"Node_386"
  bottom:"Node_385"
  layer_param {
    idx:386
    in_0 {name:"Node_385:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_386:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_387"
  type:"add"
  top:"Node_387"
