name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:82
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"Node_83"
  type:"const"
  top:"Node_83"
  layer_param {
    idx:83
    out_0 {name:"Node_83:0",dtype:float32,shape:[64, 3, 7, 7]}
  }
}
layer {
  name:"Node_84"
  type:"nn.conv2d"
  top:"Node_84"
  bottom:"input0"
  bottom:"Node_83"
  layer_param {
    idx:84
    in_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_83:0",dtype:float32,shape:[64, 3, 7, 7]}
    out_0 {name:"Node_84:0",dtype:float32,shape:[1, 64, 112, 112]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_88"
  type:"const"
  top:"Node_88"
  layer_param {
    idx:88
    out_0 {name:"Node_88:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_91"
  type:"const"
  top:"Node_91"
  layer_param {
    idx:91
    out_0 {name:"Node_91:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_92"
  type:"const"
  top:"Node_92"
  layer_param {
    idx:92
    out_0 {name:"Node_92:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_93"
  type:"add"
  top:"Node_93"
  bottom:"Node_91"
  bottom:"Node_92"
  layer_param {
    idx:93
    in_0 {name:"Node_91:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_92:0",dtype:float32,shape:[]}
    out_0 {name:"Node_93:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_94"
  type:"sqrt"
  top:"Node_94"
  bottom:"Node_93"
  layer_param {
    idx:94
    in_0 {name:"Node_93:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_94:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_95"
  type:"divide"
  top:"Node_95"
  bottom:"Node_88"
  bottom:"Node_94"
  layer_param {
    idx:95
    in_0 {name:"Node_88:0",dtype:float32,shape:[]}
    in_1 {name:"Node_94:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_95:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_96"
  type:"const"
  top:"Node_96"
  layer_param {
    idx:96
    out_0 {name:"Node_96:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_97"
  type:"multiply"
  top:"Node_97"
  bottom:"Node_95"
  bottom:"Node_96"
  layer_param {
    idx:97
    in_0 {name:"Node_95:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_96:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_97:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_98"
  type:"expand_dims"
  top:"Node_98"
  bottom:"Node_97"
  layer_param {
    idx:98
    in_0 {name:"Node_97:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_98:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_99"
  type:"multiply"
  top:"Node_99"
  bottom:"Node_84"
  bottom:"Node_98"
  layer_param {
    idx:99
    in_0 {name:"Node_84:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_98:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_99:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_104"
  type:"const"
  top:"Node_104"
  layer_param {
    idx:104
    out_0 {name:"Node_104:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_105"
  type:"negative"
  top:"Node_105"
  bottom:"Node_104"
  layer_param {
    idx:105
    in_0 {name:"Node_104:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_105:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_107"
  type:"multiply"
  top:"Node_107"
  bottom:"Node_105"
  bottom:"Node_97"
  layer_param {
    idx:107
    in_0 {name:"Node_105:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_97:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_107:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_108"
  type:"const"
  top:"Node_108"
  layer_param {
    idx:108
    out_0 {name:"Node_108:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_109"
  type:"add"
  top:"Node_109"
  bottom:"Node_107"
  bottom:"Node_108"
  layer_param {
    idx:109
    in_0 {name:"Node_107:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_108:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_109:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_110"
  type:"expand_dims"
  top:"Node_110"
  bottom:"Node_109"
  layer_param {
    idx:110
    in_0 {name:"Node_109:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_110:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_111"
  type:"add"
  top:"Node_111"
  bottom:"Node_99"
  bottom:"Node_110"
  layer_param {
    idx:111
    in_0 {name:"Node_99:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_110:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_111:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_112"
  type:"nn.relu"
  top:"Node_112"
  bottom:"Node_111"
  layer_param {
    idx:112
    in_0 {name:"Node_111:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_112:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_113"
  type:"nn.max_pool2d"
  top:"Node_113"
  bottom:"Node_112"
  layer_param {
    idx:113
    in_0 {name:"Node_112:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_113:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_114"
  type:"const"
  top:"Node_114"
  layer_param {
    idx:114
    out_0 {name:"Node_114:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_115"
  type:"nn.conv2d"
  top:"Node_115"
  bottom:"Node_113"
  bottom:"Node_114"
  layer_param {
    idx:115
    in_0 {name:"Node_113:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_114:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_115:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_119"
  type:"const"
  top:"Node_119"
  layer_param {
    idx:119
    out_0 {name:"Node_119:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_122"
  type:"const"
  top:"Node_122"
  layer_param {
    idx:122
    out_0 {name:"Node_122:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_123"
  type:"const"
  top:"Node_123"
  layer_param {
    idx:123
    out_0 {name:"Node_123:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_124"
  type:"add"
  top:"Node_124"
  bottom:"Node_122"
  bottom:"Node_123"
  layer_param {
    idx:124
    in_0 {name:"Node_122:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_123:0",dtype:float32,shape:[]}
    out_0 {name:"Node_124:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_125"
  type:"sqrt"
  top:"Node_125"
  bottom:"Node_124"
  layer_param {
    idx:125
    in_0 {name:"Node_124:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_125:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_126"
  type:"divide"
  top:"Node_126"
  bottom:"Node_119"
  bottom:"Node_125"
  layer_param {
    idx:126
    in_0 {name:"Node_119:0",dtype:float32,shape:[]}
    in_1 {name:"Node_125:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_126:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_127"
  type:"const"
  top:"Node_127"
  layer_param {
    idx:127
    out_0 {name:"Node_127:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_128"
  type:"multiply"
  top:"Node_128"
  bottom:"Node_126"
  bottom:"Node_127"
  layer_param {
    idx:128
    in_0 {name:"Node_126:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_127:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_128:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_129"
  type:"expand_dims"
  top:"Node_129"
  bottom:"Node_128"
  layer_param {
    idx:129
    in_0 {name:"Node_128:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_129:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_130"
  type:"multiply"
  top:"Node_130"
  bottom:"Node_115"
  bottom:"Node_129"
  layer_param {
    idx:130
    in_0 {name:"Node_115:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_129:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_130:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_135"
  type:"const"
  top:"Node_135"
  layer_param {
    idx:135
    out_0 {name:"Node_135:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_136"
  type:"negative"
  top:"Node_136"
  bottom:"Node_135"
  layer_param {
    idx:136
    in_0 {name:"Node_135:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_136:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_138"
  type:"multiply"
  top:"Node_138"
  bottom:"Node_136"
  bottom:"Node_128"
  layer_param {
    idx:138
    in_0 {name:"Node_136:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_128:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_138:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_139"
  type:"const"
  top:"Node_139"
  layer_param {
    idx:139
    out_0 {name:"Node_139:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_140"
  type:"add"
  top:"Node_140"
  bottom:"Node_138"
  bottom:"Node_139"
  layer_param {
    idx:140
    in_0 {name:"Node_138:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_139:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_140:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_141"
  type:"expand_dims"
  top:"Node_141"
  bottom:"Node_140"
  layer_param {
    idx:141
    in_0 {name:"Node_140:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_141:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_142"
  type:"add"
  top:"Node_142"
  bottom:"Node_130"
  bottom:"Node_141"
  layer_param {
    idx:142
    in_0 {name:"Node_130:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_141:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_142:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_143"
  type:"nn.relu"
  top:"Node_143"
  bottom:"Node_142"
  layer_param {
    idx:143
    in_0 {name:"Node_142:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_143:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_144"
  type:"const"
  top:"Node_144"
  layer_param {
    idx:144
    out_0 {name:"Node_144:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_145"
  type:"nn.conv2d"
  top:"Node_145"
  bottom:"Node_143"
  bottom:"Node_144"
  layer_param {
    idx:145
    in_0 {name:"Node_143:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_144:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_145:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_149"
  type:"const"
  top:"Node_149"
  layer_param {
    idx:149
    out_0 {name:"Node_149:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_152"
  type:"const"
  top:"Node_152"
  layer_param {
    idx:152
    out_0 {name:"Node_152:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_153"
  type:"const"
  top:"Node_153"
  layer_param {
    idx:153
    out_0 {name:"Node_153:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_154"
  type:"add"
  top:"Node_154"
  bottom:"Node_152"
  bottom:"Node_153"
  layer_param {
    idx:154
    in_0 {name:"Node_152:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_153:0",dtype:float32,shape:[]}
    out_0 {name:"Node_154:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_155"
  type:"sqrt"
  top:"Node_155"
  bottom:"Node_154"
  layer_param {
    idx:155
    in_0 {name:"Node_154:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_155:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_156"
  type:"divide"
  top:"Node_156"
  bottom:"Node_149"
  bottom:"Node_155"
  layer_param {
    idx:156
    in_0 {name:"Node_149:0",dtype:float32,shape:[]}
    in_1 {name:"Node_155:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_156:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_157"
  type:"const"
  top:"Node_157"
  layer_param {
    idx:157
    out_0 {name:"Node_157:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_158"
  type:"multiply"
  top:"Node_158"
  bottom:"Node_156"
  bottom:"Node_157"
  layer_param {
    idx:158
    in_0 {name:"Node_156:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_157:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_158:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_159"
  type:"expand_dims"
  top:"Node_159"
  bottom:"Node_158"
  layer_param {
    idx:159
    in_0 {name:"Node_158:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_159:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_160"
  type:"multiply"
  top:"Node_160"
  bottom:"Node_145"
  bottom:"Node_159"
  layer_param {
    idx:160
    in_0 {name:"Node_145:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_159:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_160:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_165"
  type:"const"
  top:"Node_165"
  layer_param {
    idx:165
    out_0 {name:"Node_165:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_166"
  type:"negative"
  top:"Node_166"
  bottom:"Node_165"
  layer_param {
    idx:166
    in_0 {name:"Node_165:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_166:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_168"
  type:"multiply"
  top:"Node_168"
  bottom:"Node_166"
  bottom:"Node_158"
  layer_param {
    idx:168
    in_0 {name:"Node_166:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_158:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_168:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_169"
  type:"const"
  top:"Node_169"
  layer_param {
    idx:169
    out_0 {name:"Node_169:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_170"
  type:"add"
  top:"Node_170"
  bottom:"Node_168"
  bottom:"Node_169"
  layer_param {
    idx:170
    in_0 {name:"Node_168:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_169:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_170:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_171"
  type:"expand_dims"
  top:"Node_171"
  bottom:"Node_170"
  layer_param {
    idx:171
    in_0 {name:"Node_170:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_171:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_172"
  type:"add"
  top:"Node_172"
  bottom:"Node_160"
  bottom:"Node_171"
  layer_param {
    idx:172
    in_0 {name:"Node_160:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_171:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_172:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_174"
  type:"add"
  top:"Node_174"
  bottom:"Node_172"
  bottom:"Node_113"
  layer_param {
    idx:174
    in_0 {name:"Node_172:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_113:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_174:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_175"
  type:"nn.relu"
  top:"Node_175"
  bottom:"Node_174"
  layer_param {
    idx:175
    in_0 {name:"Node_174:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_175:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_176"
  type:"const"
  top:"Node_176"
  layer_param {
    idx:176
    out_0 {name:"Node_176:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_177"
  type:"nn.conv2d"
  top:"Node_177"
  bottom:"Node_175"
  bottom:"Node_176"
  layer_param {
    idx:177
    in_0 {name:"Node_175:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_176:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_177:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_181"
  type:"const"
  top:"Node_181"
  layer_param {
    idx:181
    out_0 {name:"Node_181:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_184"
  type:"const"
  top:"Node_184"
  layer_param {
    idx:184
    out_0 {name:"Node_184:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_185"
  type:"const"
  top:"Node_185"
  layer_param {
    idx:185
    out_0 {name:"Node_185:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_186"
  type:"add"
  top:"Node_186"
  bottom:"Node_184"
  bottom:"Node_185"
  layer_param {
    idx:186
    in_0 {name:"Node_184:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_185:0",dtype:float32,shape:[]}
    out_0 {name:"Node_186:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_187"
  type:"sqrt"
  top:"Node_187"
  bottom:"Node_186"
  layer_param {
    idx:187
    in_0 {name:"Node_186:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_187:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_188"
  type:"divide"
  top:"Node_188"
  bottom:"Node_181"
  bottom:"Node_187"
  layer_param {
    idx:188
    in_0 {name:"Node_181:0",dtype:float32,shape:[]}
    in_1 {name:"Node_187:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_188:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_189"
  type:"const"
  top:"Node_189"
  layer_param {
    idx:189
    out_0 {name:"Node_189:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_190"
  type:"multiply"
  top:"Node_190"
  bottom:"Node_188"
  bottom:"Node_189"
  layer_param {
    idx:190
    in_0 {name:"Node_188:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_189:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_190:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_191"
  type:"expand_dims"
  top:"Node_191"
  bottom:"Node_190"
  layer_param {
    idx:191
    in_0 {name:"Node_190:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_191:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_192"
  type:"multiply"
  top:"Node_192"
  bottom:"Node_177"
  bottom:"Node_191"
  layer_param {
    idx:192
    in_0 {name:"Node_177:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_191:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_192:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_197"
  type:"const"
  top:"Node_197"
  layer_param {
    idx:197
    out_0 {name:"Node_197:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_198"
  type:"negative"
  top:"Node_198"
  bottom:"Node_197"
  layer_param {
    idx:198
    in_0 {name:"Node_197:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_198:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_200"
  type:"multiply"
  top:"Node_200"
  bottom:"Node_198"
  bottom:"Node_190"
  layer_param {
    idx:200
    in_0 {name:"Node_198:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_190:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_200:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_201"
  type:"const"
  top:"Node_201"
  layer_param {
    idx:201
    out_0 {name:"Node_201:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_202"
  type:"add"
  top:"Node_202"
  bottom:"Node_200"
  bottom:"Node_201"
  layer_param {
    idx:202
    in_0 {name:"Node_200:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_201:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_202:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_203"
  type:"expand_dims"
  top:"Node_203"
  bottom:"Node_202"
  layer_param {
    idx:203
    in_0 {name:"Node_202:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_203:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_204"
  type:"add"
  top:"Node_204"
  bottom:"Node_192"
  bottom:"Node_203"
  layer_param {
    idx:204
    in_0 {name:"Node_192:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_203:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_204:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_205"
  type:"nn.relu"
  top:"Node_205"
  bottom:"Node_204"
  layer_param {
    idx:205
    in_0 {name:"Node_204:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_205:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_206"
  type:"const"
  top:"Node_206"
  layer_param {
    idx:206
    out_0 {name:"Node_206:0",dtype:float32,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_207"
  type:"nn.conv2d"
  top:"Node_207"
  bottom:"Node_205"
  bottom:"Node_206"
  layer_param {
    idx:207
    in_0 {name:"Node_205:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_206:0",dtype:float32,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_207:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_211"
  type:"const"
  top:"Node_211"
  layer_param {
    idx:211
    out_0 {name:"Node_211:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_214"
  type:"const"
  top:"Node_214"
  layer_param {
    idx:214
    out_0 {name:"Node_214:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_215"
  type:"const"
  top:"Node_215"
  layer_param {
    idx:215
    out_0 {name:"Node_215:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_216"
  type:"add"
  top:"Node_216"
  bottom:"Node_214"
  bottom:"Node_215"
  layer_param {
    idx:216
    in_0 {name:"Node_214:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_215:0",dtype:float32,shape:[]}
    out_0 {name:"Node_216:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_217"
  type:"sqrt"
  top:"Node_217"
  bottom:"Node_216"
  layer_param {
    idx:217
    in_0 {name:"Node_216:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_217:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_218"
  type:"divide"
  top:"Node_218"
  bottom:"Node_211"
  bottom:"Node_217"
  layer_param {
    idx:218
    in_0 {name:"Node_211:0",dtype:float32,shape:[]}
    in_1 {name:"Node_217:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_218:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_219"
  type:"const"
  top:"Node_219"
  layer_param {
    idx:219
    out_0 {name:"Node_219:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_220"
  type:"multiply"
  top:"Node_220"
  bottom:"Node_218"
  bottom:"Node_219"
  layer_param {
    idx:220
    in_0 {name:"Node_218:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_219:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_220:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_221"
  type:"expand_dims"
  top:"Node_221"
  bottom:"Node_220"
  layer_param {
    idx:221
    in_0 {name:"Node_220:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_221:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_222"
  type:"multiply"
  top:"Node_222"
  bottom:"Node_207"
  bottom:"Node_221"
  layer_param {
    idx:222
    in_0 {name:"Node_207:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_221:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_222:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_227"
  type:"const"
  top:"Node_227"
  layer_param {
    idx:227
    out_0 {name:"Node_227:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_228"
  type:"negative"
  top:"Node_228"
  bottom:"Node_227"
  layer_param {
    idx:228
    in_0 {name:"Node_227:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_228:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_230"
  type:"multiply"
  top:"Node_230"
  bottom:"Node_228"
  bottom:"Node_220"
  layer_param {
    idx:230
    in_0 {name:"Node_228:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_220:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_230:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_231"
  type:"const"
  top:"Node_231"
  layer_param {
    idx:231
    out_0 {name:"Node_231:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_232"
  type:"add"
  top:"Node_232"
  bottom:"Node_230"
  bottom:"Node_231"
  layer_param {
    idx:232
    in_0 {name:"Node_230:0",dtype:float32,shape:[64]}
    in_1 {name:"Node_231:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_232:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_233"
  type:"expand_dims"
  top:"Node_233"
  bottom:"Node_232"
  layer_param {
    idx:233
    in_0 {name:"Node_232:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_233:0",dtype:float32,shape:[64, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_234"
  type:"add"
  top:"Node_234"
  bottom:"Node_222"
  bottom:"Node_233"
  layer_param {
    idx:234
    in_0 {name:"Node_222:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_233:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_234:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_236"
  type:"add"
  top:"Node_236"
  bottom:"Node_234"
  bottom:"Node_175"
  layer_param {
    idx:236
    in_0 {name:"Node_234:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_175:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_236:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_237"
  type:"nn.relu"
  top:"Node_237"
  bottom:"Node_236"
  layer_param {
    idx:237
    in_0 {name:"Node_236:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_237:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_238"
  type:"const"
  top:"Node_238"
  layer_param {
    idx:238
    out_0 {name:"Node_238:0",dtype:float32,shape:[128, 64, 3, 3]}
  }
}
layer {
  name:"Node_239"
  type:"nn.conv2d"
  top:"Node_239"
  bottom:"Node_237"
  bottom:"Node_238"
  layer_param {
    idx:239
    in_0 {name:"Node_237:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_238:0",dtype:float32,shape:[128, 64, 3, 3]}
    out_0 {name:"Node_239:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_243"
  type:"const"
  top:"Node_243"
  layer_param {
    idx:243
    out_0 {name:"Node_243:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_246"
  type:"const"
  top:"Node_246"
  layer_param {
    idx:246
    out_0 {name:"Node_246:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_247"
  type:"const"
  top:"Node_247"
  layer_param {
    idx:247
    out_0 {name:"Node_247:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_248"
  type:"add"
  top:"Node_248"
  bottom:"Node_246"
  bottom:"Node_247"
  layer_param {
    idx:248
    in_0 {name:"Node_246:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_247:0",dtype:float32,shape:[]}
    out_0 {name:"Node_248:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_249"
  type:"sqrt"
  top:"Node_249"
  bottom:"Node_248"
  layer_param {
    idx:249
    in_0 {name:"Node_248:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_249:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_250"
  type:"divide"
  top:"Node_250"
  bottom:"Node_243"
  bottom:"Node_249"
  layer_param {
    idx:250
    in_0 {name:"Node_243:0",dtype:float32,shape:[]}
    in_1 {name:"Node_249:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_250:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_251"
  type:"const"
  top:"Node_251"
  layer_param {
    idx:251
    out_0 {name:"Node_251:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_252"
  type:"multiply"
  top:"Node_252"
  bottom:"Node_250"
  bottom:"Node_251"
  layer_param {
    idx:252
    in_0 {name:"Node_250:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_251:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_252:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_253"
  type:"expand_dims"
  top:"Node_253"
  bottom:"Node_252"
  layer_param {
    idx:253
    in_0 {name:"Node_252:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_253:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_254"
  type:"multiply"
  top:"Node_254"
  bottom:"Node_239"
  bottom:"Node_253"
  layer_param {
    idx:254
    in_0 {name:"Node_239:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_253:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_254:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_259"
  type:"const"
  top:"Node_259"
  layer_param {
    idx:259
    out_0 {name:"Node_259:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_260"
  type:"negative"
  top:"Node_260"
  bottom:"Node_259"
  layer_param {
    idx:260
    in_0 {name:"Node_259:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_260:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_262"
  type:"multiply"
  top:"Node_262"
  bottom:"Node_260"
  bottom:"Node_252"
  layer_param {
    idx:262
    in_0 {name:"Node_260:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_252:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_262:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_263"
  type:"const"
  top:"Node_263"
  layer_param {
    idx:263
    out_0 {name:"Node_263:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_264"
  type:"add"
  top:"Node_264"
  bottom:"Node_262"
  bottom:"Node_263"
  layer_param {
    idx:264
    in_0 {name:"Node_262:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_263:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_264:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_265"
  type:"expand_dims"
  top:"Node_265"
  bottom:"Node_264"
  layer_param {
    idx:265
    in_0 {name:"Node_264:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_265:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_266"
  type:"add"
  top:"Node_266"
  bottom:"Node_254"
  bottom:"Node_265"
  layer_param {
    idx:266
    in_0 {name:"Node_254:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_265:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_266:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_267"
  type:"nn.relu"
  top:"Node_267"
  bottom:"Node_266"
  layer_param {
    idx:267
    in_0 {name:"Node_266:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_267:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_268"
  type:"const"
  top:"Node_268"
  layer_param {
    idx:268
    out_0 {name:"Node_268:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_269"
  type:"nn.conv2d"
  top:"Node_269"
  bottom:"Node_267"
  bottom:"Node_268"
  layer_param {
    idx:269
    in_0 {name:"Node_267:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_268:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_269:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_273"
  type:"const"
  top:"Node_273"
  layer_param {
    idx:273
    out_0 {name:"Node_273:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_276"
  type:"const"
  top:"Node_276"
  layer_param {
    idx:276
    out_0 {name:"Node_276:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_277"
  type:"const"
  top:"Node_277"
  layer_param {
    idx:277
    out_0 {name:"Node_277:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_278"
  type:"add"
  top:"Node_278"
  bottom:"Node_276"
  bottom:"Node_277"
  layer_param {
    idx:278
    in_0 {name:"Node_276:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_277:0",dtype:float32,shape:[]}
    out_0 {name:"Node_278:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_279"
  type:"sqrt"
  top:"Node_279"
  bottom:"Node_278"
  layer_param {
    idx:279
    in_0 {name:"Node_278:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_279:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_280"
  type:"divide"
  top:"Node_280"
  bottom:"Node_273"
  bottom:"Node_279"
  layer_param {
    idx:280
    in_0 {name:"Node_273:0",dtype:float32,shape:[]}
    in_1 {name:"Node_279:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_280:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_281"
  type:"const"
  top:"Node_281"
  layer_param {
    idx:281
    out_0 {name:"Node_281:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_282"
  type:"multiply"
  top:"Node_282"
  bottom:"Node_280"
  bottom:"Node_281"
  layer_param {
    idx:282
    in_0 {name:"Node_280:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_281:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_282:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_283"
  type:"expand_dims"
  top:"Node_283"
  bottom:"Node_282"
  layer_param {
    idx:283
    in_0 {name:"Node_282:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_283:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_284"
  type:"multiply"
  top:"Node_284"
  bottom:"Node_269"
  bottom:"Node_283"
  layer_param {
    idx:284
    in_0 {name:"Node_269:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_283:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_284:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_289"
  type:"const"
  top:"Node_289"
  layer_param {
    idx:289
    out_0 {name:"Node_289:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_290"
  type:"negative"
  top:"Node_290"
  bottom:"Node_289"
  layer_param {
    idx:290
    in_0 {name:"Node_289:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_290:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_292"
  type:"multiply"
  top:"Node_292"
  bottom:"Node_290"
  bottom:"Node_282"
  layer_param {
    idx:292
    in_0 {name:"Node_290:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_282:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_292:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_293"
  type:"const"
  top:"Node_293"
  layer_param {
    idx:293
    out_0 {name:"Node_293:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_294"
  type:"add"
  top:"Node_294"
  bottom:"Node_292"
  bottom:"Node_293"
  layer_param {
    idx:294
    in_0 {name:"Node_292:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_293:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_294:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_295"
  type:"expand_dims"
  top:"Node_295"
  bottom:"Node_294"
  layer_param {
    idx:295
    in_0 {name:"Node_294:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_295:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_296"
  type:"add"
  top:"Node_296"
  bottom:"Node_284"
  bottom:"Node_295"
  layer_param {
    idx:296
    in_0 {name:"Node_284:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_295:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_296:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_301"
  type:"const"
  top:"Node_301"
  layer_param {
    idx:301
    out_0 {name:"Node_301:0",dtype:float32,shape:[128, 64, 1, 1]}
  }
}
layer {
  name:"Node_302"
  type:"nn.conv2d"
  top:"Node_302"
  bottom:"Node_237"
  bottom:"Node_301"
  layer_param {
    idx:302
    in_0 {name:"Node_237:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_301:0",dtype:float32,shape:[128, 64, 1, 1]}
    out_0 {name:"Node_302:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_306"
  type:"const"
  top:"Node_306"
  layer_param {
    idx:306
    out_0 {name:"Node_306:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_309"
  type:"const"
  top:"Node_309"
  layer_param {
    idx:309
    out_0 {name:"Node_309:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_310"
  type:"const"
  top:"Node_310"
  layer_param {
    idx:310
    out_0 {name:"Node_310:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_311"
  type:"add"
  top:"Node_311"
  bottom:"Node_309"
  bottom:"Node_310"
  layer_param {
    idx:311
    in_0 {name:"Node_309:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_310:0",dtype:float32,shape:[]}
    out_0 {name:"Node_311:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_312"
  type:"sqrt"
  top:"Node_312"
  bottom:"Node_311"
  layer_param {
    idx:312
    in_0 {name:"Node_311:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_312:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_313"
  type:"divide"
  top:"Node_313"
  bottom:"Node_306"
  bottom:"Node_312"
  layer_param {
    idx:313
    in_0 {name:"Node_306:0",dtype:float32,shape:[]}
    in_1 {name:"Node_312:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_313:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_314"
  type:"const"
  top:"Node_314"
  layer_param {
    idx:314
    out_0 {name:"Node_314:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_315"
  type:"multiply"
  top:"Node_315"
  bottom:"Node_313"
  bottom:"Node_314"
  layer_param {
    idx:315
    in_0 {name:"Node_313:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_314:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_315:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_316"
  type:"expand_dims"
  top:"Node_316"
  bottom:"Node_315"
  layer_param {
    idx:316
    in_0 {name:"Node_315:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_316:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_317"
  type:"multiply"
  top:"Node_317"
  bottom:"Node_302"
  bottom:"Node_316"
  layer_param {
    idx:317
    in_0 {name:"Node_302:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_316:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_317:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_322"
  type:"const"
  top:"Node_322"
  layer_param {
    idx:322
    out_0 {name:"Node_322:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_323"
  type:"negative"
  top:"Node_323"
  bottom:"Node_322"
  layer_param {
    idx:323
    in_0 {name:"Node_322:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_323:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_325"
  type:"multiply"
  top:"Node_325"
  bottom:"Node_323"
  bottom:"Node_315"
  layer_param {
    idx:325
    in_0 {name:"Node_323:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_315:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_325:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_326"
  type:"const"
  top:"Node_326"
  layer_param {
    idx:326
    out_0 {name:"Node_326:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_327"
  type:"add"
  top:"Node_327"
  bottom:"Node_325"
  bottom:"Node_326"
  layer_param {
    idx:327
    in_0 {name:"Node_325:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_326:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_327:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_328"
  type:"expand_dims"
  top:"Node_328"
  bottom:"Node_327"
  layer_param {
    idx:328
    in_0 {name:"Node_327:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_328:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_329"
  type:"add"
  top:"Node_329"
  bottom:"Node_317"
  bottom:"Node_328"
  layer_param {
    idx:329
    in_0 {name:"Node_317:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_328:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_329:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_330"
  type:"add"
  top:"Node_330"
  bottom:"Node_296"
  bottom:"Node_329"
  layer_param {
    idx:330
    in_0 {name:"Node_296:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_329:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_330:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_331"
  type:"nn.relu"
  top:"Node_331"
  bottom:"Node_330"
  layer_param {
    idx:331
    in_0 {name:"Node_330:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_331:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_332"
  type:"const"
  top:"Node_332"
  layer_param {
    idx:332
    out_0 {name:"Node_332:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_333"
  type:"nn.conv2d"
  top:"Node_333"
  bottom:"Node_331"
  bottom:"Node_332"
  layer_param {
    idx:333
    in_0 {name:"Node_331:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_332:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_333:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_337"
  type:"const"
  top:"Node_337"
  layer_param {
    idx:337
    out_0 {name:"Node_337:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_340"
  type:"const"
  top:"Node_340"
  layer_param {
    idx:340
    out_0 {name:"Node_340:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_341"
  type:"const"
  top:"Node_341"
  layer_param {
    idx:341
    out_0 {name:"Node_341:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_342"
  type:"add"
  top:"Node_342"
  bottom:"Node_340"
  bottom:"Node_341"
  layer_param {
    idx:342
    in_0 {name:"Node_340:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_341:0",dtype:float32,shape:[]}
    out_0 {name:"Node_342:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_343"
  type:"sqrt"
  top:"Node_343"
  bottom:"Node_342"
  layer_param {
    idx:343
    in_0 {name:"Node_342:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_343:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_344"
  type:"divide"
  top:"Node_344"
  bottom:"Node_337"
  bottom:"Node_343"
  layer_param {
    idx:344
    in_0 {name:"Node_337:0",dtype:float32,shape:[]}
    in_1 {name:"Node_343:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_344:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_345"
  type:"const"
  top:"Node_345"
  layer_param {
    idx:345
    out_0 {name:"Node_345:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_346"
  type:"multiply"
  top:"Node_346"
  bottom:"Node_344"
  bottom:"Node_345"
  layer_param {
    idx:346
    in_0 {name:"Node_344:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_345:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_346:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_347"
  type:"expand_dims"
  top:"Node_347"
  bottom:"Node_346"
  layer_param {
    idx:347
    in_0 {name:"Node_346:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_347:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_348"
  type:"multiply"
  top:"Node_348"
  bottom:"Node_333"
  bottom:"Node_347"
  layer_param {
    idx:348
    in_0 {name:"Node_333:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_347:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_348:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_353"
  type:"const"
  top:"Node_353"
  layer_param {
    idx:353
    out_0 {name:"Node_353:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_354"
  type:"negative"
  top:"Node_354"
  bottom:"Node_353"
  layer_param {
    idx:354
    in_0 {name:"Node_353:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_354:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_356"
  type:"multiply"
  top:"Node_356"
  bottom:"Node_354"
  bottom:"Node_346"
  layer_param {
    idx:356
    in_0 {name:"Node_354:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_346:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_356:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_357"
  type:"const"
  top:"Node_357"
  layer_param {
    idx:357
    out_0 {name:"Node_357:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_358"
  type:"add"
  top:"Node_358"
  bottom:"Node_356"
  bottom:"Node_357"
  layer_param {
    idx:358
    in_0 {name:"Node_356:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_357:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_358:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_359"
  type:"expand_dims"
  top:"Node_359"
  bottom:"Node_358"
  layer_param {
    idx:359
    in_0 {name:"Node_358:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_359:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_360"
  type:"add"
  top:"Node_360"
  bottom:"Node_348"
  bottom:"Node_359"
  layer_param {
    idx:360
    in_0 {name:"Node_348:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_359:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_360:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_361"
  type:"nn.relu"
  top:"Node_361"
  bottom:"Node_360"
  layer_param {
    idx:361
    in_0 {name:"Node_360:0",dtype:float32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_361:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_362"
  type:"const"
  top:"Node_362"
  layer_param {
    idx:362
    out_0 {name:"Node_362:0",dtype:float32,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_363"
  type:"nn.conv2d"
  top:"Node_363"
  bottom:"Node_361"
  bottom:"Node_362"
  layer_param {
    idx:363
    in_0 {name:"Node_361:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_362:0",dtype:float32,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_363:0",dtype:float32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_367"
  type:"const"
  top:"Node_367"
  layer_param {
    idx:367
    out_0 {name:"Node_367:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_370"
  type:"const"
  top:"Node_370"
  layer_param {
    idx:370
    out_0 {name:"Node_370:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_371"
  type:"const"
  top:"Node_371"
  layer_param {
    idx:371
    out_0 {name:"Node_371:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_372"
  type:"add"
  top:"Node_372"
  bottom:"Node_370"
  bottom:"Node_371"
  layer_param {
    idx:372
    in_0 {name:"Node_370:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_371:0",dtype:float32,shape:[]}
    out_0 {name:"Node_372:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_373"
  type:"sqrt"
  top:"Node_373"
  bottom:"Node_372"
  layer_param {
    idx:373
    in_0 {name:"Node_372:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_373:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_374"
  type:"divide"
  top:"Node_374"
  bottom:"Node_367"
  bottom:"Node_373"
  layer_param {
    idx:374
    in_0 {name:"Node_367:0",dtype:float32,shape:[]}
    in_1 {name:"Node_373:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_374:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_375"
  type:"const"
  top:"Node_375"
  layer_param {
    idx:375
    out_0 {name:"Node_375:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_376"
  type:"multiply"
  top:"Node_376"
  bottom:"Node_374"
  bottom:"Node_375"
  layer_param {
    idx:376
    in_0 {name:"Node_374:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_375:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_376:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_377"
  type:"expand_dims"
  top:"Node_377"
  bottom:"Node_376"
  layer_param {
    idx:377
    in_0 {name:"Node_376:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_377:0",dtype:float32,shape:[128, 1, 1]}
    attrs {'axis': 1, 'num_newaxis': 2}
  }
}
layer {
  name:"Node_378"
  type:"multiply"
  top:"Node_378"
  bottom:"Node_363"
  bottom:"Node_377"
  layer_param {
    idx:378
    in_0 {name:"Node_363:0",dtype:float32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_377:0",dtype:float32,shape:[128, 1, 1]}
    out_0 {name:"Node_378:0",dtype:float32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_383"
  type:"const"
  top:"Node_383"
  layer_param {
    idx:383
    out_0 {name:"Node_383:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_384"
  type:"negative"
  top:"Node_384"
  bottom:"Node_383"
  layer_param {
    idx:384
    in_0 {name:"Node_383:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_384:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_386"
  type:"multiply"
  top:"Node_386"
  bottom:"Node_384"
  bottom:"Node_376"
  layer_param {
    idx:386
    in_0 {name:"Node_384:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_376:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_386:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_387"
  type:"const"
  top:"Node_387"
  layer_param {
    idx:387
    out_0 {name:"Node_387:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_388"
  type:"add"
  top:"Node_388"
  bottom:"Node_386"
  bottom:"Node_387"
  layer_param {
    idx:388
    in_0 {name:"Node_386:0",dtype:float32,shape:[128]}
    in_1 {name:"Node_387:0",dtype:float32,shape:[128]}
    out_0 {name:"Node_388:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"Node_389"
  type:"expand_dims"
  top:"Node_389"
  bottom:"Node_388"
  layer_param {
    idx:389
