name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:0
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"Node_364"
  type:"const"
  top:"Node_364"
  layer_param {
    idx:364
    out_0 {name:"Node_364:0",dtype:float32,shape:[64, 3, 7, 7]}
  }
}
layer {
  name:"Node_365"
  type:"nn_conv2d"
  top:"Node_365"
  bottom:"input0"
  bottom:"Node_364"
  layer_param {
    idx:365
    in_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_364:0",dtype:float32,shape:[64, 3, 7, 7]}
    out_0 {name:"Node_365:0",dtype:float32,shape:[1, 64, 112, 112]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_366"
  type:"annotation_stop_fusion"
  top:"Node_366"
  bottom:"Node_365"
  layer_param {
    idx:366
    in_0 {name:"Node_365:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_366:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_367"
  type:"const"
  top:"Node_367"
  layer_param {
    idx:367
    out_0 {name:"Node_367:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_368"
  type:"multiply"
  top:"Node_368"
  bottom:"Node_366"
  bottom:"Node_367"
  layer_param {
    idx:368
    in_0 {name:"Node_366:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_367:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_368:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_369"
  type:"const"
  top:"Node_369"
  layer_param {
    idx:369
    out_0 {name:"Node_369:0",dtype:float32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_370"
  type:"add"
  top:"Node_370"
  bottom:"Node_368"
  bottom:"Node_369"
  layer_param {
    idx:370
    in_0 {name:"Node_368:0",dtype:float32,shape:[1, 64, 112, 112]}
    in_1 {name:"Node_369:0",dtype:float32,shape:[64, 1, 1]}
    out_0 {name:"Node_370:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_371"
  type:"nn_relu"
  top:"Node_371"
  bottom:"Node_370"
  layer_param {
    idx:371
    in_0 {name:"Node_370:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_371:0",dtype:float32,shape:[1, 64, 112, 112]}
  }
}
layer {
  name:"Node_372"
  type:"nn_max_pool2d"
  top:"Node_372"
  bottom:"Node_371"
  layer_param {
    idx:372
    in_0 {name:"Node_371:0",dtype:float32,shape:[1, 64, 112, 112]}
    out_0 {name:"Node_372:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW32c', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_373"
  type:"annotation_stop_fusion"
  top:"Node_373"
  bottom:"Node_372"
  layer_param {
    idx:373
    in_0 {name:"Node_372:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_373:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_374"
  type:"const"
  top:"Node_374"
  layer_param {
    idx:374
    out_0 {name:"Node_374:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_375"
  type:"multiply"
  top:"Node_375"
  bottom:"Node_373"
  bottom:"Node_374"
  layer_param {
    idx:375
    in_0 {name:"Node_373:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_374:0",dtype:float32,shape:[]}
    out_0 {name:"Node_375:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_376"
  type:"round"
  top:"Node_376"
  bottom:"Node_375"
  layer_param {
    idx:376
    in_0 {name:"Node_375:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_376:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_377"
  type:"clip"
  top:"Node_377"
  bottom:"Node_376"
  layer_param {
    idx:377
    in_0 {name:"Node_376:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_377:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_378"
  type:"cast"
  top:"Node_378"
  bottom:"Node_377"
  layer_param {
    idx:378
    in_0 {name:"Node_377:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_378:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_379"
  type:"const"
  top:"Node_379"
  layer_param {
    idx:379
    out_0 {name:"Node_379:0",dtype:int8,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_380"
  type:"nn_conv2d"
  top:"Node_380"
  bottom:"Node_378"
  bottom:"Node_379"
  layer_param {
    idx:380
    in_0 {name:"Node_378:0",dtype:int8,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_379:0",dtype:int8,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_380:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_381"
  type:"cast"
  top:"Node_381"
  bottom:"Node_380"
  layer_param {
    idx:381
    in_0 {name:"Node_380:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_381:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_382"
  type:"fixed_point_multiply"
  top:"Node_382"
  bottom:"Node_381"
  layer_param {
    idx:382
    in_0 {name:"Node_381:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_382:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_383"
  type:"clip"
  top:"Node_383"
  bottom:"Node_382"
  layer_param {
    idx:383
    in_0 {name:"Node_382:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_383:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_384"
  type:"cast"
  top:"Node_384"
  bottom:"Node_383"
  layer_param {
    idx:384
    in_0 {name:"Node_383:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_384:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_385"
  type:"cast"
  top:"Node_385"
  bottom:"Node_384"
  layer_param {
    idx:385
    in_0 {name:"Node_384:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_385:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_386"
  type:"annotation_stop_fusion"
  top:"Node_386"
  bottom:"Node_385"
  layer_param {
    idx:386
    in_0 {name:"Node_385:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_386:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_387"
  type:"cast"
  top:"Node_387"
  bottom:"Node_386"
  layer_param {
    idx:387
    in_0 {name:"Node_386:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_387:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_388"
  type:"const"
  top:"Node_388"
  layer_param {
    idx:388
    out_0 {name:"Node_388:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_389"
  type:"multiply"
  top:"Node_389"
  bottom:"Node_387"
  bottom:"Node_388"
  layer_param {
    idx:389
    in_0 {name:"Node_387:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_388:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_389:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_390"
  type:"const"
  top:"Node_390"
  layer_param {
    idx:390
    out_0 {name:"Node_390:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_391"
  type:"add"
  top:"Node_391"
  bottom:"Node_389"
  bottom:"Node_390"
  layer_param {
    idx:391
    in_0 {name:"Node_389:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_390:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_391:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_392"
  type:"nn_relu"
  top:"Node_392"
  bottom:"Node_391"
  layer_param {
    idx:392
    in_0 {name:"Node_391:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_392:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_393"
  type:"cast"
  top:"Node_393"
  bottom:"Node_392"
  layer_param {
    idx:393
    in_0 {name:"Node_392:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_393:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_394"
  type:"fixed_point_multiply"
  top:"Node_394"
  bottom:"Node_393"
  layer_param {
    idx:394
    in_0 {name:"Node_393:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_394:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_395"
  type:"clip"
  top:"Node_395"
  bottom:"Node_394"
  layer_param {
    idx:395
    in_0 {name:"Node_394:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_395:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_396"
  type:"cast"
  top:"Node_396"
  bottom:"Node_395"
  layer_param {
    idx:396
    in_0 {name:"Node_395:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_396:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_397"
  type:"cast"
  top:"Node_397"
  bottom:"Node_396"
  layer_param {
    idx:397
    in_0 {name:"Node_396:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_397:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_398"
  type:"annotation_stop_fusion"
  top:"Node_398"
  bottom:"Node_397"
  layer_param {
    idx:398
    in_0 {name:"Node_397:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_398:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_399"
  type:"const"
  top:"Node_399"
  layer_param {
    idx:399
    out_0 {name:"Node_399:0",dtype:int8,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_400"
  type:"nn_conv2d"
  top:"Node_400"
  bottom:"Node_398"
  bottom:"Node_399"
  layer_param {
    idx:400
    in_0 {name:"Node_398:0",dtype:int8,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_399:0",dtype:int8,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_400:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_401"
  type:"cast"
  top:"Node_401"
  bottom:"Node_400"
  layer_param {
    idx:401
    in_0 {name:"Node_400:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_401:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_402"
  type:"fixed_point_multiply"
  top:"Node_402"
  bottom:"Node_401"
  layer_param {
    idx:402
    in_0 {name:"Node_401:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_402:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_403"
  type:"clip"
  top:"Node_403"
  bottom:"Node_402"
  layer_param {
    idx:403
    in_0 {name:"Node_402:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_403:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_404"
  type:"cast"
  top:"Node_404"
  bottom:"Node_403"
  layer_param {
    idx:404
    in_0 {name:"Node_403:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_404:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_405"
  type:"cast"
  top:"Node_405"
  bottom:"Node_404"
  layer_param {
    idx:405
    in_0 {name:"Node_404:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_405:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_406"
  type:"annotation_stop_fusion"
  top:"Node_406"
  bottom:"Node_405"
  layer_param {
    idx:406
    in_0 {name:"Node_405:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_406:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_407"
  type:"cast"
  top:"Node_407"
  bottom:"Node_406"
  layer_param {
    idx:407
    in_0 {name:"Node_406:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_407:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_408"
  type:"const"
  top:"Node_408"
  layer_param {
    idx:408
    out_0 {name:"Node_408:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_409"
  type:"multiply"
  top:"Node_409"
  bottom:"Node_407"
  bottom:"Node_408"
  layer_param {
    idx:409
    in_0 {name:"Node_407:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_408:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_409:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_410"
  type:"const"
  top:"Node_410"
  layer_param {
    idx:410
    out_0 {name:"Node_410:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_411"
  type:"add"
  top:"Node_411"
  bottom:"Node_409"
  bottom:"Node_410"
  layer_param {
    idx:411
    in_0 {name:"Node_409:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_410:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_411:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_412"
  type:"cast"
  top:"Node_412"
  bottom:"Node_411"
  layer_param {
    idx:412
    in_0 {name:"Node_411:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_412:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_413"
  type:"fixed_point_multiply"
  top:"Node_413"
  bottom:"Node_412"
  layer_param {
    idx:413
    in_0 {name:"Node_412:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_413:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_414"
  type:"clip"
  top:"Node_414"
  bottom:"Node_413"
  layer_param {
    idx:414
    in_0 {name:"Node_413:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_414:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_415"
  type:"cast"
  top:"Node_415"
  bottom:"Node_414"
  layer_param {
    idx:415
    in_0 {name:"Node_414:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_415:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_416"
  type:"cast"
  top:"Node_416"
  bottom:"Node_415"
  layer_param {
    idx:416
    in_0 {name:"Node_415:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_416:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_417"
  type:"annotation_stop_fusion"
  top:"Node_417"
  bottom:"Node_416"
  layer_param {
    idx:417
    in_0 {name:"Node_416:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_417:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_418"
  type:"cast"
  top:"Node_418"
  bottom:"Node_417"
  layer_param {
    idx:418
    in_0 {name:"Node_417:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_418:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_419"
  type:"fixed_point_multiply"
  top:"Node_419"
  bottom:"Node_418"
  layer_param {
    idx:419
    in_0 {name:"Node_418:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_419:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_420"
  type:"cast"
  top:"Node_420"
  bottom:"Node_419"
  layer_param {
    idx:420
    in_0 {name:"Node_419:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_420:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_428"
  type:"annotation_stop_fusion"
  top:"Node_428"
  bottom:"Node_372"
  layer_param {
    idx:428
    in_0 {name:"Node_372:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_428:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_429"
  type:"const"
  top:"Node_429"
  layer_param {
    idx:429
    out_0 {name:"Node_429:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_430"
  type:"multiply"
  top:"Node_430"
  bottom:"Node_428"
  bottom:"Node_429"
  layer_param {
    idx:430
    in_0 {name:"Node_428:0",dtype:float32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_429:0",dtype:float32,shape:[]}
    out_0 {name:"Node_430:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_431"
  type:"round"
  top:"Node_431"
  bottom:"Node_430"
  layer_param {
    idx:431
    in_0 {name:"Node_430:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_431:0",dtype:float32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_432"
  type:"clip"
  top:"Node_432"
  bottom:"Node_431"
  layer_param {
    idx:432
    in_0 {name:"Node_431:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_432:0",dtype:float32,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_433"
  type:"cast"
  top:"Node_433"
  bottom:"Node_432"
  layer_param {
    idx:433
    in_0 {name:"Node_432:0",dtype:float32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_433:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_434"
  type:"annotation_stop_fusion"
  top:"Node_434"
  bottom:"Node_433"
  layer_param {
    idx:434
    in_0 {name:"Node_433:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_434:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_435"
  type:"add"
  top:"Node_435"
  bottom:"Node_420"
  bottom:"Node_434"
  layer_param {
    idx:435
    in_0 {name:"Node_420:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_434:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_435:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_436"
  type:"nn_relu"
  top:"Node_436"
  bottom:"Node_435"
  layer_param {
    idx:436
    in_0 {name:"Node_435:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_436:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_437"
  type:"cast"
  top:"Node_437"
  bottom:"Node_436"
  layer_param {
    idx:437
    in_0 {name:"Node_436:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_437:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_438"
  type:"fixed_point_multiply"
  top:"Node_438"
  bottom:"Node_437"
  layer_param {
    idx:438
    in_0 {name:"Node_437:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_438:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_439"
  type:"clip"
  top:"Node_439"
  bottom:"Node_438"
  layer_param {
    idx:439
    in_0 {name:"Node_438:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_439:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_440"
  type:"cast"
  top:"Node_440"
  bottom:"Node_439"
  layer_param {
    idx:440
    in_0 {name:"Node_439:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_440:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_441"
  type:"cast"
  top:"Node_441"
  bottom:"Node_440"
  layer_param {
    idx:441
    in_0 {name:"Node_440:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_441:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_442"
  type:"annotation_stop_fusion"
  top:"Node_442"
  bottom:"Node_441"
  layer_param {
    idx:442
    in_0 {name:"Node_441:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_442:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_443"
  type:"const"
  top:"Node_443"
  layer_param {
    idx:443
    out_0 {name:"Node_443:0",dtype:int8,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_444"
  type:"nn_conv2d"
  top:"Node_444"
  bottom:"Node_442"
  bottom:"Node_443"
  layer_param {
    idx:444
    in_0 {name:"Node_442:0",dtype:int8,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_443:0",dtype:int8,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_444:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_445"
  type:"cast"
  top:"Node_445"
  bottom:"Node_444"
  layer_param {
    idx:445
    in_0 {name:"Node_444:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_445:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_446"
  type:"fixed_point_multiply"
  top:"Node_446"
  bottom:"Node_445"
  layer_param {
    idx:446
    in_0 {name:"Node_445:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_446:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_447"
  type:"clip"
  top:"Node_447"
  bottom:"Node_446"
  layer_param {
    idx:447
    in_0 {name:"Node_446:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_447:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_448"
  type:"cast"
  top:"Node_448"
  bottom:"Node_447"
  layer_param {
    idx:448
    in_0 {name:"Node_447:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_448:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_449"
  type:"cast"
  top:"Node_449"
  bottom:"Node_448"
  layer_param {
    idx:449
    in_0 {name:"Node_448:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_449:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_450"
  type:"annotation_stop_fusion"
  top:"Node_450"
  bottom:"Node_449"
  layer_param {
    idx:450
    in_0 {name:"Node_449:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_450:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_451"
  type:"cast"
  top:"Node_451"
  bottom:"Node_450"
  layer_param {
    idx:451
    in_0 {name:"Node_450:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_451:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_452"
  type:"const"
  top:"Node_452"
  layer_param {
    idx:452
    out_0 {name:"Node_452:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_453"
  type:"multiply"
  top:"Node_453"
  bottom:"Node_451"
  bottom:"Node_452"
  layer_param {
    idx:453
    in_0 {name:"Node_451:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_452:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_453:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_454"
  type:"const"
  top:"Node_454"
  layer_param {
    idx:454
    out_0 {name:"Node_454:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_455"
  type:"add"
  top:"Node_455"
  bottom:"Node_453"
  bottom:"Node_454"
  layer_param {
    idx:455
    in_0 {name:"Node_453:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_454:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_455:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_456"
  type:"nn_relu"
  top:"Node_456"
  bottom:"Node_455"
  layer_param {
    idx:456
    in_0 {name:"Node_455:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_456:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_457"
  type:"cast"
  top:"Node_457"
  bottom:"Node_456"
  layer_param {
    idx:457
    in_0 {name:"Node_456:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_457:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_458"
  type:"fixed_point_multiply"
  top:"Node_458"
  bottom:"Node_457"
  layer_param {
    idx:458
    in_0 {name:"Node_457:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_458:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_459"
  type:"clip"
  top:"Node_459"
  bottom:"Node_458"
  layer_param {
    idx:459
    in_0 {name:"Node_458:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_459:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_460"
  type:"cast"
  top:"Node_460"
  bottom:"Node_459"
  layer_param {
    idx:460
    in_0 {name:"Node_459:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_460:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_461"
  type:"cast"
  top:"Node_461"
  bottom:"Node_460"
  layer_param {
    idx:461
    in_0 {name:"Node_460:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_461:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_462"
  type:"annotation_stop_fusion"
  top:"Node_462"
  bottom:"Node_461"
  layer_param {
    idx:462
    in_0 {name:"Node_461:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_462:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_463"
  type:"const"
  top:"Node_463"
  layer_param {
    idx:463
    out_0 {name:"Node_463:0",dtype:int8,shape:[64, 64, 3, 3]}
  }
}
layer {
  name:"Node_464"
  type:"nn_conv2d"
  top:"Node_464"
  bottom:"Node_462"
  bottom:"Node_463"
  layer_param {
    idx:464
    in_0 {name:"Node_462:0",dtype:int8,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_463:0",dtype:int8,shape:[64, 64, 3, 3]}
    out_0 {name:"Node_464:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_465"
  type:"cast"
  top:"Node_465"
  bottom:"Node_464"
  layer_param {
    idx:465
    in_0 {name:"Node_464:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_465:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_466"
  type:"fixed_point_multiply"
  top:"Node_466"
  bottom:"Node_465"
  layer_param {
    idx:466
    in_0 {name:"Node_465:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_466:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_467"
  type:"clip"
  top:"Node_467"
  bottom:"Node_466"
  layer_param {
    idx:467
    in_0 {name:"Node_466:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_467:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_468"
  type:"cast"
  top:"Node_468"
  bottom:"Node_467"
  layer_param {
    idx:468
    in_0 {name:"Node_467:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_468:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_469"
  type:"cast"
  top:"Node_469"
  bottom:"Node_468"
  layer_param {
    idx:469
    in_0 {name:"Node_468:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_469:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_470"
  type:"annotation_stop_fusion"
  top:"Node_470"
  bottom:"Node_469"
  layer_param {
    idx:470
    in_0 {name:"Node_469:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_470:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_471"
  type:"cast"
  top:"Node_471"
  bottom:"Node_470"
  layer_param {
    idx:471
    in_0 {name:"Node_470:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_471:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_472"
  type:"const"
  top:"Node_472"
  layer_param {
    idx:472
    out_0 {name:"Node_472:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_473"
  type:"multiply"
  top:"Node_473"
  bottom:"Node_471"
  bottom:"Node_472"
  layer_param {
    idx:473
    in_0 {name:"Node_471:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_472:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_473:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_474"
  type:"const"
  top:"Node_474"
  layer_param {
    idx:474
    out_0 {name:"Node_474:0",dtype:int32,shape:[64, 1, 1]}
  }
}
layer {
  name:"Node_475"
  type:"add"
  top:"Node_475"
  bottom:"Node_473"
  bottom:"Node_474"
  layer_param {
    idx:475
    in_0 {name:"Node_473:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_474:0",dtype:int32,shape:[64, 1, 1]}
    out_0 {name:"Node_475:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_476"
  type:"cast"
  top:"Node_476"
  bottom:"Node_475"
  layer_param {
    idx:476
    in_0 {name:"Node_475:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_476:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_477"
  type:"fixed_point_multiply"
  top:"Node_477"
  bottom:"Node_476"
  layer_param {
    idx:477
    in_0 {name:"Node_476:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_477:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_478"
  type:"clip"
  top:"Node_478"
  bottom:"Node_477"
  layer_param {
    idx:478
    in_0 {name:"Node_477:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_478:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_479"
  type:"cast"
  top:"Node_479"
  bottom:"Node_478"
  layer_param {
    idx:479
    in_0 {name:"Node_478:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_479:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_480"
  type:"cast"
  top:"Node_480"
  bottom:"Node_479"
  layer_param {
    idx:480
    in_0 {name:"Node_479:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_480:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_481"
  type:"annotation_stop_fusion"
  top:"Node_481"
  bottom:"Node_480"
  layer_param {
    idx:481
    in_0 {name:"Node_480:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_481:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_482"
  type:"cast"
  top:"Node_482"
  bottom:"Node_481"
  layer_param {
    idx:482
    in_0 {name:"Node_481:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_482:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_489"
  type:"cast"
  top:"Node_489"
  bottom:"Node_440"
  layer_param {
    idx:489
    in_0 {name:"Node_440:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_489:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_490"
  type:"annotation_stop_fusion"
  top:"Node_490"
  bottom:"Node_489"
  layer_param {
    idx:490
    in_0 {name:"Node_489:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_490:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_491"
  type:"cast"
  top:"Node_491"
  bottom:"Node_490"
  layer_param {
    idx:491
    in_0 {name:"Node_490:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_491:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_492"
  type:"fixed_point_multiply"
  top:"Node_492"
  bottom:"Node_491"
  layer_param {
    idx:492
    in_0 {name:"Node_491:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_492:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_493"
  type:"cast"
  top:"Node_493"
  bottom:"Node_492"
  layer_param {
    idx:493
    in_0 {name:"Node_492:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_493:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_494"
  type:"add"
  top:"Node_494"
  bottom:"Node_482"
  bottom:"Node_493"
  layer_param {
    idx:494
    in_0 {name:"Node_482:0",dtype:int32,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_493:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_494:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_495"
  type:"nn_relu"
  top:"Node_495"
  bottom:"Node_494"
  layer_param {
    idx:495
    in_0 {name:"Node_494:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_495:0",dtype:int32,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_496"
  type:"cast"
  top:"Node_496"
  bottom:"Node_495"
  layer_param {
    idx:496
    in_0 {name:"Node_495:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_496:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_497"
  type:"fixed_point_multiply"
  top:"Node_497"
  bottom:"Node_496"
  layer_param {
    idx:497
    in_0 {name:"Node_496:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_497:0",dtype:int64,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_498"
  type:"clip"
  top:"Node_498"
  bottom:"Node_497"
  layer_param {
    idx:498
    in_0 {name:"Node_497:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_498:0",dtype:int64,shape:[1, 64, 56, 56]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_499"
  type:"cast"
  top:"Node_499"
  bottom:"Node_498"
  layer_param {
    idx:499
    in_0 {name:"Node_498:0",dtype:int64,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_499:0",dtype:int32,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_500"
  type:"cast"
  top:"Node_500"
  bottom:"Node_499"
  layer_param {
    idx:500
    in_0 {name:"Node_499:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_500:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_501"
  type:"annotation_stop_fusion"
  top:"Node_501"
  bottom:"Node_500"
  layer_param {
    idx:501
    in_0 {name:"Node_500:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_501:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_502"
  type:"const"
  top:"Node_502"
  layer_param {
    idx:502
    out_0 {name:"Node_502:0",dtype:int8,shape:[128, 64, 3, 3]}
  }
}
layer {
  name:"Node_503"
  type:"nn_conv2d"
  top:"Node_503"
  bottom:"Node_501"
  bottom:"Node_502"
  layer_param {
    idx:503
    in_0 {name:"Node_501:0",dtype:int8,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_502:0",dtype:int8,shape:[128, 64, 3, 3]}
    out_0 {name:"Node_503:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_504"
  type:"cast"
  top:"Node_504"
  bottom:"Node_503"
  layer_param {
    idx:504
    in_0 {name:"Node_503:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_504:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_505"
  type:"fixed_point_multiply"
  top:"Node_505"
  bottom:"Node_504"
  layer_param {
    idx:505
    in_0 {name:"Node_504:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_505:0",dtype:int64,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_506"
  type:"clip"
  top:"Node_506"
  bottom:"Node_505"
  layer_param {
    idx:506
    in_0 {name:"Node_505:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_506:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_507"
  type:"cast"
  top:"Node_507"
  bottom:"Node_506"
  layer_param {
    idx:507
    in_0 {name:"Node_506:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_507:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_508"
  type:"cast"
  top:"Node_508"
  bottom:"Node_507"
  layer_param {
    idx:508
    in_0 {name:"Node_507:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_508:0",dtype:int8,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_509"
  type:"annotation_stop_fusion"
  top:"Node_509"
  bottom:"Node_508"
  layer_param {
    idx:509
    in_0 {name:"Node_508:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_509:0",dtype:int8,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_510"
  type:"cast"
  top:"Node_510"
  bottom:"Node_509"
  layer_param {
    idx:510
    in_0 {name:"Node_509:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_510:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_511"
  type:"const"
  top:"Node_511"
  layer_param {
    idx:511
    out_0 {name:"Node_511:0",dtype:int32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_512"
  type:"multiply"
  top:"Node_512"
  bottom:"Node_510"
  bottom:"Node_511"
  layer_param {
    idx:512
    in_0 {name:"Node_510:0",dtype:int32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_511:0",dtype:int32,shape:[128, 1, 1]}
    out_0 {name:"Node_512:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_513"
  type:"const"
  top:"Node_513"
  layer_param {
    idx:513
    out_0 {name:"Node_513:0",dtype:int32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_514"
  type:"add"
  top:"Node_514"
  bottom:"Node_512"
  bottom:"Node_513"
  layer_param {
    idx:514
    in_0 {name:"Node_512:0",dtype:int32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_513:0",dtype:int32,shape:[128, 1, 1]}
    out_0 {name:"Node_514:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_515"
  type:"nn_relu"
  top:"Node_515"
  bottom:"Node_514"
  layer_param {
    idx:515
    in_0 {name:"Node_514:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_515:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_516"
  type:"cast"
  top:"Node_516"
  bottom:"Node_515"
  layer_param {
    idx:516
    in_0 {name:"Node_515:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_516:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_517"
  type:"fixed_point_multiply"
  top:"Node_517"
  bottom:"Node_516"
  layer_param {
    idx:517
    in_0 {name:"Node_516:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_517:0",dtype:int64,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_518"
  type:"clip"
  top:"Node_518"
  bottom:"Node_517"
  layer_param {
    idx:518
    in_0 {name:"Node_517:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_518:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_519"
  type:"cast"
  top:"Node_519"
  bottom:"Node_518"
  layer_param {
    idx:519
    in_0 {name:"Node_518:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_519:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_520"
  type:"cast"
  top:"Node_520"
  bottom:"Node_519"
  layer_param {
    idx:520
    in_0 {name:"Node_519:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_520:0",dtype:int8,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_521"
  type:"annotation_stop_fusion"
  top:"Node_521"
  bottom:"Node_520"
  layer_param {
    idx:521
    in_0 {name:"Node_520:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_521:0",dtype:int8,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_522"
  type:"const"
  top:"Node_522"
  layer_param {
    idx:522
    out_0 {name:"Node_522:0",dtype:int8,shape:[128, 128, 3, 3]}
  }
}
layer {
  name:"Node_523"
  type:"nn_conv2d"
  top:"Node_523"
  bottom:"Node_521"
  bottom:"Node_522"
  layer_param {
    idx:523
    in_0 {name:"Node_521:0",dtype:int8,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_522:0",dtype:int8,shape:[128, 128, 3, 3]}
    out_0 {name:"Node_523:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_524"
  type:"cast"
  top:"Node_524"
  bottom:"Node_523"
  layer_param {
    idx:524
    in_0 {name:"Node_523:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_524:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_525"
  type:"fixed_point_multiply"
  top:"Node_525"
  bottom:"Node_524"
  layer_param {
    idx:525
    in_0 {name:"Node_524:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_525:0",dtype:int64,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_526"
  type:"clip"
  top:"Node_526"
  bottom:"Node_525"
  layer_param {
    idx:526
    in_0 {name:"Node_525:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_526:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_527"
  type:"cast"
  top:"Node_527"
  bottom:"Node_526"
  layer_param {
    idx:527
    in_0 {name:"Node_526:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_527:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_528"
  type:"cast"
  top:"Node_528"
  bottom:"Node_527"
  layer_param {
    idx:528
    in_0 {name:"Node_527:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_528:0",dtype:int8,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_529"
  type:"annotation_stop_fusion"
  top:"Node_529"
  bottom:"Node_528"
  layer_param {
    idx:529
    in_0 {name:"Node_528:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_529:0",dtype:int8,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_530"
  type:"cast"
  top:"Node_530"
  bottom:"Node_529"
  layer_param {
    idx:530
    in_0 {name:"Node_529:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_530:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_531"
  type:"const"
  top:"Node_531"
  layer_param {
    idx:531
    out_0 {name:"Node_531:0",dtype:int32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_532"
  type:"multiply"
  top:"Node_532"
  bottom:"Node_530"
  bottom:"Node_531"
  layer_param {
    idx:532
    in_0 {name:"Node_530:0",dtype:int32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_531:0",dtype:int32,shape:[128, 1, 1]}
    out_0 {name:"Node_532:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_533"
  type:"const"
  top:"Node_533"
  layer_param {
    idx:533
    out_0 {name:"Node_533:0",dtype:int32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_534"
  type:"add"
  top:"Node_534"
  bottom:"Node_532"
  bottom:"Node_533"
  layer_param {
    idx:534
    in_0 {name:"Node_532:0",dtype:int32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_533:0",dtype:int32,shape:[128, 1, 1]}
    out_0 {name:"Node_534:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_535"
  type:"cast"
  top:"Node_535"
  bottom:"Node_534"
  layer_param {
    idx:535
    in_0 {name:"Node_534:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_535:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_536"
  type:"fixed_point_multiply"
  top:"Node_536"
  bottom:"Node_535"
  layer_param {
    idx:536
    in_0 {name:"Node_535:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_536:0",dtype:int64,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_537"
  type:"clip"
  top:"Node_537"
  bottom:"Node_536"
  layer_param {
    idx:537
    in_0 {name:"Node_536:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_537:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_538"
  type:"cast"
  top:"Node_538"
  bottom:"Node_537"
  layer_param {
    idx:538
    in_0 {name:"Node_537:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_538:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_539"
  type:"cast"
  top:"Node_539"
  bottom:"Node_538"
  layer_param {
    idx:539
    in_0 {name:"Node_538:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_539:0",dtype:int8,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_540"
  type:"annotation_stop_fusion"
  top:"Node_540"
  bottom:"Node_539"
  layer_param {
    idx:540
    in_0 {name:"Node_539:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_540:0",dtype:int8,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_541"
  type:"cast"
  top:"Node_541"
  bottom:"Node_540"
  layer_param {
    idx:541
    in_0 {name:"Node_540:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_541:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_542"
  type:"fixed_point_multiply"
  top:"Node_542"
  bottom:"Node_541"
  layer_param {
    idx:542
    in_0 {name:"Node_541:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_542:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_543"
  type:"cast"
  top:"Node_543"
  bottom:"Node_542"
  layer_param {
    idx:543
    in_0 {name:"Node_542:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_543:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_564"
  type:"cast"
  top:"Node_564"
  bottom:"Node_499"
  layer_param {
    idx:564
    in_0 {name:"Node_499:0",dtype:int32,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_564:0",dtype:int8,shape:[1, 64, 56, 56]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_565"
  type:"annotation_stop_fusion"
  top:"Node_565"
  bottom:"Node_564"
  layer_param {
    idx:565
    in_0 {name:"Node_564:0",dtype:int8,shape:[1, 64, 56, 56]}
    out_0 {name:"Node_565:0",dtype:int8,shape:[1, 64, 56, 56]}
  }
}
layer {
  name:"Node_566"
  type:"const"
  top:"Node_566"
  layer_param {
    idx:566
    out_0 {name:"Node_566:0",dtype:int8,shape:[128, 64, 1, 1]}
  }
}
layer {
  name:"Node_567"
  type:"nn_conv2d"
  top:"Node_567"
  bottom:"Node_565"
  bottom:"Node_566"
  layer_param {
    idx:567
    in_0 {name:"Node_565:0",dtype:int8,shape:[1, 64, 56, 56]}
    in_1 {name:"Node_566:0",dtype:int8,shape:[128, 64, 1, 1]}
    out_0 {name:"Node_567:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_568"
  type:"cast"
  top:"Node_568"
  bottom:"Node_567"
  layer_param {
    idx:568
    in_0 {name:"Node_567:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_568:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_569"
  type:"fixed_point_multiply"
  top:"Node_569"
  bottom:"Node_568"
  layer_param {
    idx:569
    in_0 {name:"Node_568:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_569:0",dtype:int64,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_570"
  type:"clip"
  top:"Node_570"
  bottom:"Node_569"
  layer_param {
    idx:570
    in_0 {name:"Node_569:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_570:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_571"
  type:"cast"
  top:"Node_571"
  bottom:"Node_570"
  layer_param {
    idx:571
    in_0 {name:"Node_570:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_571:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_572"
  type:"cast"
  top:"Node_572"
  bottom:"Node_571"
  layer_param {
    idx:572
    in_0 {name:"Node_571:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_572:0",dtype:int8,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_573"
  type:"annotation_stop_fusion"
  top:"Node_573"
  bottom:"Node_572"
  layer_param {
    idx:573
    in_0 {name:"Node_572:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_573:0",dtype:int8,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_574"
  type:"cast"
  top:"Node_574"
  bottom:"Node_573"
  layer_param {
    idx:574
    in_0 {name:"Node_573:0",dtype:int8,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_574:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_575"
  type:"const"
  top:"Node_575"
  layer_param {
    idx:575
    out_0 {name:"Node_575:0",dtype:int32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_576"
  type:"multiply"
  top:"Node_576"
  bottom:"Node_574"
  bottom:"Node_575"
  layer_param {
    idx:576
    in_0 {name:"Node_574:0",dtype:int32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_575:0",dtype:int32,shape:[128, 1, 1]}
    out_0 {name:"Node_576:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_577"
  type:"const"
  top:"Node_577"
  layer_param {
    idx:577
    out_0 {name:"Node_577:0",dtype:int32,shape:[128, 1, 1]}
  }
}
layer {
  name:"Node_578"
  type:"add"
  top:"Node_578"
  bottom:"Node_576"
  bottom:"Node_577"
  layer_param {
    idx:578
    in_0 {name:"Node_576:0",dtype:int32,shape:[1, 128, 28, 28]}
    in_1 {name:"Node_577:0",dtype:int32,shape:[128, 1, 1]}
    out_0 {name:"Node_578:0",dtype:int32,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_579"
  type:"cast"
  top:"Node_579"
  bottom:"Node_578"
  layer_param {
    idx:579
    in_0 {name:"Node_578:0",dtype:int32,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_579:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_580"
  type:"fixed_point_multiply"
  top:"Node_580"
  bottom:"Node_579"
  layer_param {
    idx:580
    in_0 {name:"Node_579:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_580:0",dtype:int64,shape:[1, 128, 28, 28]}
  }
}
layer {
  name:"Node_581"
  type:"clip"
  top:"Node_581"
  bottom:"Node_580"
  layer_param {
    idx:581
    in_0 {name:"Node_580:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_581:0",dtype:int64,shape:[1, 128, 28, 28]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_582"
  type:"cast"
  top:"Node_582"
  bottom:"Node_581"
  layer_param {
    idx:582
    in_0 {name:"Node_581:0",dtype:int64,shape:[1, 128, 28, 28]}
    out_0 {name:"Node_582:0",dtype:int32,shape:[1, 128, 28, 28]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_583"
  type:"cast"
  top:"Node_583"
  bottom:"Node_582"
  layer_param {
    idx:583
    in_0 {name:"Node_582:0",dtype:int32,shape:[1, 128, 28, 28]}
