name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:0
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"p0"
  type:"input"
  top:"p0"
  layer_param {
    idx:1
    out_0 {name:"p0:0",dtype:float32,shape:[1, 512]}
  }
}
layer {
  name:"p1"
  type:"input"
  top:"p1"
  layer_param {
    idx:2
    out_0 {name:"p1:0",dtype:float32,shape:[100, 512, 10]}
  }
}
layer {
  name:"p2"
  type:"input"
  top:"p2"
  layer_param {
    idx:3
    out_0 {name:"p2:0",dtype:float32,shape:[1000]}
  }
}
layer {
  name:"Node_8"
  type:"nn_contrib_dense_pack"
  top:"Node_8"
  bottom:"p0"
  bottom:"p1"
  layer_param {
    idx:8
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512]}
    in_1 {name:"p1:0",dtype:float32,shape:[100, 512, 10]}
    out_0 {name:"Node_8:0",dtype:float32,shape:[1, 1000]}
    attrs {'units': None, 'out_dtype': 'float32'}
  }
}
layer {
  name:"Node_10"
  type:"add"
  top:"Node_10"
  bottom:"Node_8"
  bottom:"p2"
  layer_param {
    idx:10
    in_0 {name:"Node_8:0",dtype:float32,shape:[1, 1000]}
    in_1 {name:"p2:0",dtype:float32,shape:[1000]}
    out_0 {name:"Node_10:0",dtype:float32,shape:[1, 1000]}
  }
}
layer {
  name:"Node_11"
  type:"function"
  top:"Node_11"
  bottom:"p0"
  bottom:"p1"
  bottom:"p2"
  bottom:"Node_10"
  layer_param {
    idx:11
    in_0 {name:"p0:0",dtype:float32,shape:[1, 512]}
    in_1 {name:"p1:0",dtype:float32,shape:[100, 512, 10]}
    in_2 {name:"p2:0",dtype:float32,shape:[1000]}
    in_3 {name:"Node_10:0",dtype:float32,shape:[1, 1000]}
    out_0 {name:"Node_11:0",dtype:float32,shape:[1, 1000]}
  }
}
layer {
  name:"p0_1"
  type:"input"
  top:"p0_1"
  layer_param {
    idx:12
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"Node_17"
  type:"layout_transform"
  top:"Node_17"
  bottom:"p0_1"
  layer_param {
    idx:17
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_17:0",dtype:float32,shape:[1, 512, 1, 1]}
    attrs {'src_layout': 'NCHW8c', 'dst_layout': 'NCHW'}
  }
}
layer {
  name:"Node_18"
  type:"reshape"
  top:"Node_18"
  bottom:"Node_17"
  layer_param {
    idx:18
    in_0 {name:"Node_17:0",dtype:float32,shape:[1, 512, 1, 1]}
    out_0 {name:"Node_18:0",dtype:float32,shape:[1, 512, 1, 1]}
    attrs {'newshape': [0, -1, 1, 1]}
  }
}
layer {
  name:"Node_19"
  type:"squeeze"
  top:"Node_19"
  bottom:"Node_18"
  layer_param {
    idx:19
    in_0 {name:"Node_18:0",dtype:float32,shape:[1, 512, 1, 1]}
    out_0 {name:"Node_19:0",dtype:float32,shape:[1, 512]}
    attrs {'axis': [2, 3]}
  }
}
layer {
  name:"Node_20"
  type:"function"
  top:"Node_20"
  bottom:"p0_1"
  bottom:"Node_19"
  layer_param {
    idx:20
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 1, 1, 8]}
    in_1 {name:"Node_19:0",dtype:float32,shape:[1, 512]}
    out_0 {name:"Node_20:0",dtype:float32,shape:[1, 512]}
  }
}
layer {
  name:"p0_2"
  type:"input"
  top:"p0_2"
  layer_param {
    idx:21
    out_0 {name:"p0:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_24"
  type:"nn_adaptive_avg_pool2d"
  top:"Node_24"
  bottom:"p0_2"
  layer_param {
    idx:24
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_24:0",dtype:float32,shape:[1, 64, 1, 1, 8]}
    attrs {'output_size': [1, 1], 'layout': 'NCHW8c'}
  }
}
layer {
  name:"Node_25"
  type:"function"
  top:"Node_25"
  bottom:"p0_2"
  bottom:"Node_24"
  layer_param {
    idx:25
    in_0 {name:"p0:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"Node_24:0",dtype:float32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_25:0",dtype:float32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"p0_3"
  type:"input"
  top:"p0_3"
  layer_param {
    idx:26
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_30"
  type:"cast"
  top:"Node_30"
  bottom:"p0_3"
  layer_param {
    idx:30
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_30:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'float32'}
  }
}
layer {
  name:"Node_31"
  type:"const"
  top:"Node_31"
  layer_param {
    idx:31
    out_0 {name:"Node_31:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_32"
  type:"multiply"
  top:"Node_32"
  bottom:"Node_30"
  bottom:"Node_31"
  layer_param {
    idx:32
    in_0 {name:"Node_30:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"Node_31:0",dtype:float32,shape:[]}
    out_0 {name:"Node_32:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_33"
  type:"function"
  top:"Node_33"
  bottom:"p0_3"
  bottom:"Node_32"
  layer_param {
    idx:33
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"Node_32:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_33:0",dtype:float32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_4"
  type:"input"
  top:"p0_4"
  layer_param {
    idx:34
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_1"
  type:"input"
  top:"p1_1"
  layer_param {
    idx:35
    out_0 {name:"p1:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_42"
  type:"cast"
  top:"Node_42"
  bottom:"p0_4"
  layer_param {
    idx:42
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_42:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_43"
  type:"fixed_point_multiply"
  top:"Node_43"
  bottom:"Node_42"
  layer_param {
    idx:43
    in_0 {name:"Node_42:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_43:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_46"
  type:"cast"
  top:"Node_46"
  bottom:"p1_1"
  layer_param {
    idx:46
    in_0 {name:"p1:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_46:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_47"
  type:"add"
  top:"Node_47"
  bottom:"Node_43"
  bottom:"Node_46"
  layer_param {
    idx:47
    in_0 {name:"Node_43:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"Node_46:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_47:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_48"
  type:"nn_relu"
  top:"Node_48"
  bottom:"Node_47"
  layer_param {
    idx:48
    in_0 {name:"Node_47:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_48:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_49"
  type:"cast"
  top:"Node_49"
  bottom:"Node_48"
  layer_param {
    idx:49
    in_0 {name:"Node_48:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_49:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_50"
  type:"function"
  top:"Node_50"
  bottom:"p0_4"
  bottom:"p1_1"
  bottom:"Node_49"
  layer_param {
    idx:50
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_2 {name:"Node_49:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_50:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_5"
  type:"input"
  top:"p0_5"
  layer_param {
    idx:51
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_2"
  type:"input"
  top:"p1_2"
  layer_param {
    idx:52
    out_0 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"p2_1"
  type:"input"
  top:"p2_1"
  layer_param {
    idx:53
    out_0 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"Node_63"
  type:"cast"
  top:"Node_63"
  bottom:"p0_5"
  layer_param {
    idx:63
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_63:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_65"
  type:"multiply"
  top:"Node_65"
  bottom:"Node_63"
  bottom:"p1_2"
  layer_param {
    idx:65
    in_0 {name:"Node_63:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_65:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_67"
  type:"add"
  top:"Node_67"
  bottom:"Node_65"
  bottom:"p2_1"
  layer_param {
    idx:67
    in_0 {name:"Node_65:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_67:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_68"
  type:"cast"
  top:"Node_68"
  bottom:"Node_67"
  layer_param {
    idx:68
    in_0 {name:"Node_67:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_68:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_69"
  type:"fixed_point_multiply"
  top:"Node_69"
  bottom:"Node_68"
  layer_param {
    idx:69
    in_0 {name:"Node_68:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_69:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_70"
  type:"clip"
  top:"Node_70"
  bottom:"Node_69"
  layer_param {
    idx:70
    in_0 {name:"Node_69:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_70:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_71"
  type:"cast"
  top:"Node_71"
  bottom:"Node_70"
  layer_param {
    idx:71
    in_0 {name:"Node_70:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_71:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_72"
  type:"cast"
  top:"Node_72"
  bottom:"Node_71"
  layer_param {
    idx:72
    in_0 {name:"Node_71:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_72:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_73"
  type:"function"
  top:"Node_73"
  bottom:"p0_5"
  bottom:"p1_2"
  bottom:"p2_1"
  bottom:"Node_72"
  layer_param {
    idx:73
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_2 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_3 {name:"Node_72:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_73:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_6"
  type:"input"
  top:"p0_6"
  layer_param {
    idx:74
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_3"
  type:"input"
  top:"p1_3"
  layer_param {
    idx:75
    out_0 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_84"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_84"
  bottom:"p0_6"
  bottom:"p1_3"
  layer_param {
    idx:84
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
    out_0 {name:"Node_84:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_85"
  type:"cast"
  top:"Node_85"
  bottom:"Node_84"
  layer_param {
    idx:85
    in_0 {name:"Node_84:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_85:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_86"
  type:"fixed_point_multiply"
  top:"Node_86"
  bottom:"Node_85"
  layer_param {
    idx:86
    in_0 {name:"Node_85:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_86:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_87"
  type:"clip"
  top:"Node_87"
  bottom:"Node_86"
  layer_param {
    idx:87
    in_0 {name:"Node_86:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_87:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_88"
  type:"cast"
  top:"Node_88"
  bottom:"Node_87"
  layer_param {
    idx:88
    in_0 {name:"Node_87:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_88:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_89"
  type:"cast"
  top:"Node_89"
  bottom:"Node_88"
  layer_param {
    idx:89
    in_0 {name:"Node_88:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_89:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_90"
  type:"function"
  top:"Node_90"
  bottom:"p0_6"
  bottom:"p1_3"
  bottom:"Node_89"
  layer_param {
    idx:90
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
    in_2 {name:"Node_89:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_90:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_7"
  type:"input"
  top:"p0_7"
  layer_param {
    idx:91
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_4"
  type:"input"
  top:"p1_4"
  layer_param {
    idx:92
    out_0 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"p2_2"
  type:"input"
  top:"p2_2"
  layer_param {
    idx:93
    out_0 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"Node_104"
  type:"cast"
  top:"Node_104"
  bottom:"p0_7"
  layer_param {
    idx:104
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_104:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_106"
  type:"multiply"
  top:"Node_106"
  bottom:"Node_104"
  bottom:"p1_4"
  layer_param {
    idx:106
    in_0 {name:"Node_104:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_106:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_108"
  type:"add"
  top:"Node_108"
  bottom:"Node_106"
  bottom:"p2_2"
  layer_param {
    idx:108
    in_0 {name:"Node_106:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_108:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_109"
  type:"nn_relu"
  top:"Node_109"
  bottom:"Node_108"
  layer_param {
    idx:109
    in_0 {name:"Node_108:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_109:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_110"
  type:"cast"
  top:"Node_110"
  bottom:"Node_109"
  layer_param {
    idx:110
    in_0 {name:"Node_109:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_110:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_111"
  type:"fixed_point_multiply"
  top:"Node_111"
  bottom:"Node_110"
  layer_param {
    idx:111
    in_0 {name:"Node_110:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_111:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_112"
  type:"clip"
  top:"Node_112"
  bottom:"Node_111"
  layer_param {
    idx:112
    in_0 {name:"Node_111:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_112:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_113"
  type:"cast"
  top:"Node_113"
  bottom:"Node_112"
  layer_param {
    idx:113
    in_0 {name:"Node_112:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_113:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_114"
  type:"cast"
  top:"Node_114"
  bottom:"Node_113"
  layer_param {
    idx:114
    in_0 {name:"Node_113:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_114:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_115"
  type:"function"
  top:"Node_115"
  bottom:"p0_7"
  bottom:"p1_4"
  bottom:"p2_2"
  bottom:"Node_114"
  layer_param {
    idx:115
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_2 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_3 {name:"Node_114:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_115:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_8"
  type:"input"
  top:"p0_8"
  layer_param {
    idx:116
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_5"
  type:"input"
  top:"p1_5"
  layer_param {
    idx:117
    out_0 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_126"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_126"
  bottom:"p0_8"
  bottom:"p1_5"
  layer_param {
    idx:126
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
    out_0 {name:"Node_126:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_127"
  type:"cast"
  top:"Node_127"
  bottom:"Node_126"
  layer_param {
    idx:127
    in_0 {name:"Node_126:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_127:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_128"
  type:"fixed_point_multiply"
  top:"Node_128"
  bottom:"Node_127"
  layer_param {
    idx:128
    in_0 {name:"Node_127:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_128:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_129"
  type:"clip"
  top:"Node_129"
  bottom:"Node_128"
  layer_param {
    idx:129
    in_0 {name:"Node_128:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_129:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_130"
  type:"cast"
  top:"Node_130"
  bottom:"Node_129"
  layer_param {
    idx:130
    in_0 {name:"Node_129:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_130:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_131"
  type:"cast"
  top:"Node_131"
  bottom:"Node_130"
  layer_param {
    idx:131
    in_0 {name:"Node_130:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_131:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_132"
  type:"function"
  top:"Node_132"
  bottom:"p0_8"
  bottom:"p1_5"
  bottom:"Node_131"
  layer_param {
    idx:132
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
    in_2 {name:"Node_131:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_132:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_9"
  type:"input"
  top:"p0_9"
  layer_param {
    idx:133
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_6"
  type:"input"
  top:"p1_6"
  layer_param {
    idx:134
    out_0 {name:"p1:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_145"
  type:"cast"
  top:"Node_145"
  bottom:"p0_9"
  layer_param {
    idx:145
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_145:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_146"
  type:"fixed_point_multiply"
  top:"Node_146"
  bottom:"Node_145"
  layer_param {
    idx:146
    in_0 {name:"Node_145:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_146:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_149"
  type:"cast"
  top:"Node_149"
  bottom:"p1_6"
  layer_param {
    idx:149
    in_0 {name:"p1:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_149:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_150"
  type:"add"
  top:"Node_150"
  bottom:"Node_146"
  bottom:"Node_149"
  layer_param {
    idx:150
    in_0 {name:"Node_146:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"Node_149:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_150:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_151"
  type:"nn_relu"
  top:"Node_151"
  bottom:"Node_150"
  layer_param {
    idx:151
    in_0 {name:"Node_150:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_151:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_152"
  type:"cast"
  top:"Node_152"
  bottom:"Node_151"
  layer_param {
    idx:152
    in_0 {name:"Node_151:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_152:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_153"
  type:"fixed_point_multiply"
  top:"Node_153"
  bottom:"Node_152"
  layer_param {
    idx:153
    in_0 {name:"Node_152:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_153:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_154"
  type:"clip"
  top:"Node_154"
  bottom:"Node_153"
  layer_param {
    idx:154
    in_0 {name:"Node_153:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_154:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_155"
  type:"cast"
  top:"Node_155"
  bottom:"Node_154"
  layer_param {
    idx:155
    in_0 {name:"Node_154:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_155:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_156"
  type:"cast"
  top:"Node_156"
  bottom:"Node_155"
  layer_param {
    idx:156
    in_0 {name:"Node_155:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_156:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_157"
  type:"function"
  top:"Node_157"
  bottom:"p0_9"
  bottom:"p1_6"
  bottom:"Node_156"
  layer_param {
    idx:157
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_2 {name:"Node_156:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_157:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_10"
  type:"input"
  top:"p0_10"
  layer_param {
    idx:158
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_7"
  type:"input"
  top:"p1_7"
  layer_param {
    idx:159
    out_0 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"p2_3"
  type:"input"
  top:"p2_3"
  layer_param {
    idx:160
    out_0 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"Node_170"
  type:"cast"
  top:"Node_170"
  bottom:"p0_10"
  layer_param {
    idx:170
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_170:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_172"
  type:"multiply"
  top:"Node_172"
  bottom:"Node_170"
  bottom:"p1_7"
  layer_param {
    idx:172
    in_0 {name:"Node_170:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_172:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_174"
  type:"add"
  top:"Node_174"
  bottom:"Node_172"
  bottom:"p2_3"
  layer_param {
    idx:174
    in_0 {name:"Node_172:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_174:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_175"
  type:"cast"
  top:"Node_175"
  bottom:"Node_174"
  layer_param {
    idx:175
    in_0 {name:"Node_174:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_175:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_176"
  type:"fixed_point_multiply"
  top:"Node_176"
  bottom:"Node_175"
  layer_param {
    idx:176
    in_0 {name:"Node_175:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_176:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_177"
  type:"clip"
  top:"Node_177"
  bottom:"Node_176"
  layer_param {
    idx:177
    in_0 {name:"Node_176:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_177:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_178"
  type:"cast"
  top:"Node_178"
  bottom:"Node_177"
  layer_param {
    idx:178
    in_0 {name:"Node_177:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_178:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_179"
  type:"cast"
  top:"Node_179"
  bottom:"Node_178"
  layer_param {
    idx:179
    in_0 {name:"Node_178:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_179:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_180"
  type:"function"
  top:"Node_180"
  bottom:"p0_10"
  bottom:"p1_7"
  bottom:"p2_3"
  bottom:"Node_179"
  layer_param {
    idx:180
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_2 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_3 {name:"Node_179:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_180:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_11"
  type:"input"
  top:"p0_11"
  layer_param {
    idx:181
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_8"
  type:"input"
  top:"p1_8"
  layer_param {
    idx:182
    out_0 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_191"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_191"
  bottom:"p0_11"
  bottom:"p1_8"
  layer_param {
    idx:191
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
    out_0 {name:"Node_191:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_192"
  type:"cast"
  top:"Node_192"
  bottom:"Node_191"
  layer_param {
    idx:192
    in_0 {name:"Node_191:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_192:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_193"
  type:"fixed_point_multiply"
  top:"Node_193"
  bottom:"Node_192"
  layer_param {
    idx:193
    in_0 {name:"Node_192:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_193:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_194"
  type:"clip"
  top:"Node_194"
  bottom:"Node_193"
  layer_param {
    idx:194
    in_0 {name:"Node_193:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_194:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_195"
  type:"cast"
  top:"Node_195"
  bottom:"Node_194"
  layer_param {
    idx:195
    in_0 {name:"Node_194:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_195:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_196"
  type:"cast"
  top:"Node_196"
  bottom:"Node_195"
  layer_param {
    idx:196
    in_0 {name:"Node_195:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_196:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_197"
  type:"function"
  top:"Node_197"
  bottom:"p0_11"
  bottom:"p1_8"
  bottom:"Node_196"
  layer_param {
    idx:197
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 64, 3, 3, 8, 8]}
    in_2 {name:"Node_196:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_197:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_12"
  type:"input"
  top:"p0_12"
  layer_param {
    idx:198
    out_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p1_9"
  type:"input"
  top:"p1_9"
  layer_param {
    idx:199
    out_0 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"p2_4"
  type:"input"
  top:"p2_4"
  layer_param {
    idx:200
    out_0 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
  }
}
layer {
  name:"Node_211"
  type:"cast"
  top:"Node_211"
  bottom:"p0_12"
  layer_param {
    idx:211
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_211:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_213"
  type:"multiply"
  top:"Node_213"
  bottom:"Node_211"
  bottom:"p1_9"
  layer_param {
    idx:213
    in_0 {name:"Node_211:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_213:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_215"
  type:"add"
  top:"Node_215"
  bottom:"Node_213"
  bottom:"p2_4"
  layer_param {
    idx:215
    in_0 {name:"Node_213:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    out_0 {name:"Node_215:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_216"
  type:"nn_relu"
  top:"Node_216"
  bottom:"Node_215"
  layer_param {
    idx:216
    in_0 {name:"Node_215:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_216:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_217"
  type:"cast"
  top:"Node_217"
  bottom:"Node_216"
  layer_param {
    idx:217
    in_0 {name:"Node_216:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_217:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_218"
  type:"fixed_point_multiply"
  top:"Node_218"
  bottom:"Node_217"
  layer_param {
    idx:218
    in_0 {name:"Node_217:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_218:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_219"
  type:"clip"
  top:"Node_219"
  bottom:"Node_218"
  layer_param {
    idx:219
    in_0 {name:"Node_218:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_219:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_220"
  type:"cast"
  top:"Node_220"
  bottom:"Node_219"
  layer_param {
    idx:220
    in_0 {name:"Node_219:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_220:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_221"
  type:"cast"
  top:"Node_221"
  bottom:"Node_220"
  layer_param {
    idx:221
    in_0 {name:"Node_220:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_221:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_222"
  type:"function"
  top:"Node_222"
  bottom:"p0_12"
  bottom:"p1_9"
  bottom:"p2_4"
  bottom:"Node_221"
  layer_param {
    idx:222
    in_0 {name:"p0:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_2 {name:"p2:0",dtype:int32,shape:[1, 64, 1, 1, 8]}
    in_3 {name:"Node_221:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_222:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_13"
  type:"input"
  top:"p0_13"
  layer_param {
    idx:223
    out_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_10"
  type:"input"
  top:"p1_10"
  layer_param {
    idx:224
    out_0 {name:"p1:0",dtype:int8,shape:[64, 32, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_233"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_233"
  bottom:"p0_13"
  bottom:"p1_10"
  layer_param {
    idx:233
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 32, 3, 3, 8, 8]}
    out_0 {name:"Node_233:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 512, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_234"
  type:"cast"
  top:"Node_234"
  bottom:"Node_233"
  layer_param {
    idx:234
    in_0 {name:"Node_233:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_234:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_235"
  type:"fixed_point_multiply"
  top:"Node_235"
  bottom:"Node_234"
  layer_param {
    idx:235
    in_0 {name:"Node_234:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_235:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"Node_236"
  type:"clip"
  top:"Node_236"
  bottom:"Node_235"
  layer_param {
    idx:236
    in_0 {name:"Node_235:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_236:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_237"
  type:"cast"
  top:"Node_237"
  bottom:"Node_236"
  layer_param {
    idx:237
    in_0 {name:"Node_236:0",dtype:int64,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_237:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_238"
  type:"cast"
  top:"Node_238"
  bottom:"Node_237"
  layer_param {
    idx:238
    in_0 {name:"Node_237:0",dtype:int32,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_238:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_239"
  type:"function"
  top:"Node_239"
  bottom:"p0_13"
  bottom:"p1_10"
  bottom:"Node_238"
  layer_param {
    idx:239
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[64, 32, 3, 3, 8, 8]}
    in_2 {name:"Node_238:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
    out_0 {name:"Node_239:0",dtype:int8,shape:[1, 64, 7, 7, 8]}
  }
}
layer {
  name:"p0_14"
  type:"input"
  top:"p0_14"
  layer_param {
    idx:240
    out_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_11"
  type:"input"
  top:"p1_11"
  layer_param {
    idx:241
    out_0 {name:"p1:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_251"
  type:"cast"
  top:"Node_251"
  bottom:"p0_14"
  layer_param {
    idx:251
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_251:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_255"
  type:"cast"
  top:"Node_255"
  bottom:"p1_11"
  layer_param {
    idx:255
    in_0 {name:"p1:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_255:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_256"
  type:"fixed_point_multiply"
  top:"Node_256"
  bottom:"Node_255"
  layer_param {
    idx:256
    in_0 {name:"Node_255:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_256:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_257"
  type:"add"
  top:"Node_257"
  bottom:"Node_251"
  bottom:"Node_256"
  layer_param {
    idx:257
    in_0 {name:"Node_251:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"Node_256:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_257:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_258"
  type:"nn_relu"
  top:"Node_258"
  bottom:"Node_257"
  layer_param {
    idx:258
    in_0 {name:"Node_257:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_258:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_259"
  type:"cast"
  top:"Node_259"
  bottom:"Node_258"
  layer_param {
    idx:259
    in_0 {name:"Node_258:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_259:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_260"
  type:"fixed_point_multiply"
  top:"Node_260"
  bottom:"Node_259"
  layer_param {
    idx:260
    in_0 {name:"Node_259:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_260:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_261"
  type:"clip"
  top:"Node_261"
  bottom:"Node_260"
  layer_param {
    idx:261
    in_0 {name:"Node_260:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_261:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_262"
  type:"cast"
  top:"Node_262"
  bottom:"Node_261"
  layer_param {
    idx:262
    in_0 {name:"Node_261:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_262:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_263"
  type:"cast"
  top:"Node_263"
  bottom:"Node_262"
  layer_param {
    idx:263
    in_0 {name:"Node_262:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_263:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_264"
  type:"function"
  top:"Node_264"
  bottom:"p0_14"
  bottom:"p1_11"
  bottom:"Node_263"
  layer_param {
    idx:264
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_2 {name:"Node_263:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_264:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_15"
  type:"input"
  top:"p0_15"
  layer_param {
    idx:265
    out_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_12"
  type:"input"
  top:"p1_12"
  layer_param {
    idx:266
    out_0 {name:"p1:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"p2_5"
  type:"input"
  top:"p2_5"
  layer_param {
    idx:267
    out_0 {name:"p2:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"Node_277"
  type:"cast"
  top:"Node_277"
  bottom:"p0_15"
  layer_param {
    idx:277
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_277:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_279"
  type:"multiply"
  top:"Node_279"
  bottom:"Node_277"
  bottom:"p1_12"
  layer_param {
    idx:279
    in_0 {name:"Node_277:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"Node_279:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_281"
  type:"add"
  top:"Node_281"
  bottom:"Node_279"
  bottom:"p2_5"
  layer_param {
    idx:281
    in_0 {name:"Node_279:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p2:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"Node_281:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_282"
  type:"cast"
  top:"Node_282"
  bottom:"Node_281"
  layer_param {
    idx:282
    in_0 {name:"Node_281:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_282:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_283"
  type:"fixed_point_multiply"
  top:"Node_283"
  bottom:"Node_282"
  layer_param {
    idx:283
    in_0 {name:"Node_282:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_283:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_284"
  type:"clip"
  top:"Node_284"
  bottom:"Node_283"
  layer_param {
    idx:284
    in_0 {name:"Node_283:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_284:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_285"
  type:"cast"
  top:"Node_285"
  bottom:"Node_284"
  layer_param {
    idx:285
    in_0 {name:"Node_284:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_285:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_286"
  type:"cast"
  top:"Node_286"
  bottom:"Node_285"
  layer_param {
    idx:286
    in_0 {name:"Node_285:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_286:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_287"
  type:"function"
  top:"Node_287"
  bottom:"p0_15"
  bottom:"p1_12"
  bottom:"p2_5"
  bottom:"Node_286"
  layer_param {
    idx:287
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    in_2 {name:"p2:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    in_3 {name:"Node_286:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_287:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_16"
  type:"input"
  top:"p0_16"
  layer_param {
    idx:288
    out_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_13"
  type:"input"
  top:"p1_13"
  layer_param {
    idx:289
    out_0 {name:"p1:0",dtype:int8,shape:[32, 32, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_298"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_298"
  bottom:"p0_16"
  bottom:"p1_13"
  layer_param {
    idx:298
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[32, 32, 3, 3, 8, 8]}
    out_0 {name:"Node_298:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_299"
  type:"cast"
  top:"Node_299"
  bottom:"Node_298"
  layer_param {
    idx:299
    in_0 {name:"Node_298:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_299:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_300"
  type:"fixed_point_multiply"
  top:"Node_300"
  bottom:"Node_299"
  layer_param {
    idx:300
    in_0 {name:"Node_299:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_300:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_301"
  type:"clip"
  top:"Node_301"
  bottom:"Node_300"
  layer_param {
    idx:301
    in_0 {name:"Node_300:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_301:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_302"
  type:"cast"
  top:"Node_302"
  bottom:"Node_301"
  layer_param {
    idx:302
    in_0 {name:"Node_301:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_302:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_303"
  type:"cast"
  top:"Node_303"
  bottom:"Node_302"
  layer_param {
    idx:303
    in_0 {name:"Node_302:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_303:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_304"
  type:"function"
  top:"Node_304"
  bottom:"p0_16"
  bottom:"p1_13"
  bottom:"Node_303"
  layer_param {
    idx:304
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[32, 32, 3, 3, 8, 8]}
    in_2 {name:"Node_303:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_304:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_17"
  type:"input"
  top:"p0_17"
  layer_param {
    idx:305
    out_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_14"
  type:"input"
  top:"p1_14"
  layer_param {
    idx:306
    out_0 {name:"p1:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"p2_6"
  type:"input"
  top:"p2_6"
  layer_param {
    idx:307
    out_0 {name:"p2:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"Node_318"
  type:"cast"
  top:"Node_318"
  bottom:"p0_17"
  layer_param {
    idx:318
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_318:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_320"
  type:"multiply"
  top:"Node_320"
  bottom:"Node_318"
  bottom:"p1_14"
  layer_param {
    idx:320
    in_0 {name:"Node_318:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"Node_320:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_322"
  type:"add"
  top:"Node_322"
  bottom:"Node_320"
  bottom:"p2_6"
  layer_param {
    idx:322
    in_0 {name:"Node_320:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p2:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"Node_322:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_323"
  type:"nn_relu"
  top:"Node_323"
  bottom:"Node_322"
  layer_param {
    idx:323
    in_0 {name:"Node_322:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_323:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_324"
  type:"cast"
  top:"Node_324"
  bottom:"Node_323"
  layer_param {
    idx:324
    in_0 {name:"Node_323:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_324:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_325"
  type:"fixed_point_multiply"
  top:"Node_325"
  bottom:"Node_324"
  layer_param {
    idx:325
    in_0 {name:"Node_324:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_325:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_326"
  type:"clip"
  top:"Node_326"
  bottom:"Node_325"
  layer_param {
    idx:326
    in_0 {name:"Node_325:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_326:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_327"
  type:"cast"
  top:"Node_327"
  bottom:"Node_326"
  layer_param {
    idx:327
    in_0 {name:"Node_326:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_327:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_328"
  type:"cast"
  top:"Node_328"
  bottom:"Node_327"
  layer_param {
    idx:328
    in_0 {name:"Node_327:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_328:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_329"
  type:"function"
  top:"Node_329"
  bottom:"p0_17"
  bottom:"p1_14"
  bottom:"p2_6"
  bottom:"Node_328"
  layer_param {
    idx:329
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    in_2 {name:"p2:0",dtype:int32,shape:[1, 32, 1, 1, 8]}
    in_3 {name:"Node_328:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_329:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_18"
  type:"input"
  top:"p0_18"
  layer_param {
    idx:330
    out_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_15"
  type:"input"
  top:"p1_15"
  layer_param {
    idx:331
    out_0 {name:"p1:0",dtype:int8,shape:[32, 32, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_340"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_340"
  bottom:"p0_18"
  bottom:"p1_15"
  layer_param {
    idx:340
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[32, 32, 3, 3, 8, 8]}
    out_0 {name:"Node_340:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': 'int32'}
  }
}
layer {
  name:"Node_341"
  type:"cast"
  top:"Node_341"
  bottom:"Node_340"
  layer_param {
    idx:341
    in_0 {name:"Node_340:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_341:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int64'}
  }
}
layer {
  name:"Node_342"
  type:"fixed_point_multiply"
  top:"Node_342"
  bottom:"Node_341"
  layer_param {
    idx:342
    in_0 {name:"Node_341:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_342:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_343"
  type:"clip"
  top:"Node_343"
  bottom:"Node_342"
  layer_param {
    idx:343
    in_0 {name:"Node_342:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_343:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    attrs {'a_min': -127.0, 'a_max': 127.0}
  }
}
layer {
  name:"Node_344"
  type:"cast"
  top:"Node_344"
  bottom:"Node_343"
  layer_param {
    idx:344
    in_0 {name:"Node_343:0",dtype:int64,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_344:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_345"
  type:"cast"
  top:"Node_345"
  bottom:"Node_344"
  layer_param {
    idx:345
    in_0 {name:"Node_344:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_345:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int8'}
  }
}
layer {
  name:"Node_346"
  type:"function"
  top:"Node_346"
  bottom:"p0_18"
  bottom:"p1_15"
  bottom:"Node_345"
  layer_param {
    idx:346
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:int8,shape:[32, 32, 3, 3, 8, 8]}
    in_2 {name:"Node_345:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_346:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_19"
  type:"input"
  top:"p0_19"
  layer_param {
    idx:347
    out_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_16"
  type:"input"
  top:"p1_16"
  layer_param {
    idx:348
    out_0 {name:"p1:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_359"
  type:"cast"
  top:"Node_359"
  bottom:"p0_19"
  layer_param {
    idx:359
    in_0 {name:"p0:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_359:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_360"
  type:"fixed_point_multiply"
  top:"Node_360"
  bottom:"Node_359"
  layer_param {
    idx:360
    in_0 {name:"Node_359:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_360:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_363"
  type:"cast"
  top:"Node_363"
  bottom:"p1_16"
  layer_param {
    idx:363
    in_0 {name:"p1:0",dtype:int8,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_363:0",dtype:int32,shape:[1, 32, 14, 14, 8]}
    attrs {'dtype': 'int32'}
  }
}
layer {
  name:"Node_364"
