name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:0
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"x"
  type:"var"
  top:"x"
  bottom:"Node_6"
  layer_param {
    idx:1
    in_0 {name:"Node_6:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"p0"
  type:"input"
  top:"p0"
  layer_param {
    idx:2
    out_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"Node_5"
  type:"layout_transform"
  top:"Node_5"
  bottom:"p0"
  layer_param {
    idx:5
    in_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
    out_0 {name:"Node_5:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    attrs {'src_layout': 'NCHW', 'dst_layout': 'NCHW3c'}
  }
}
layer {
  name:"Node_6"
  type:"function"
  top:"Node_6"
  bottom:"p0"
  bottom:"Node_5"
  layer_param {
    idx:6
    in_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_5:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"Node_6:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"x_1"
  type:"var"
  top:"x_1"
  bottom:"Node_10"
  layer_param {
    idx:7
    in_0 {name:"Node_10:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"Node_10"
  type:"var_call"
  top:"Node_10"
  bottom:"x"
  bottom:"input0"
  layer_param {
    idx:10
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
    out_0 {name:"Node_10:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"x_2"
  type:"var"
  top:"x_2"
  bottom:"Node_12"
  layer_param {
    idx:11
    in_0 {name:"Node_12:0",dtype:float32,shape:[2, 1, 7, 7, 3, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[2, 1, 7, 7, 3, 32]}
  }
}
layer {
  name:"Node_12"
  type:"const"
  top:"Node_12"
  layer_param {
    idx:12
    out_0 {name:"Node_12:0",dtype:float32,shape:[2, 1, 7, 7, 3, 32]}
  }
}
layer {
  name:"x_3"
  type:"var"
  top:"x_3"
  bottom:"Node_14"
  layer_param {
    idx:13
    in_0 {name:"Node_14:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_14"
  type:"const"
  top:"Node_14"
  layer_param {
    idx:14
    out_0 {name:"Node_14:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"x_4"
  type:"var"
  top:"x_4"
  bottom:"Node_28"
  layer_param {
    idx:15
    in_0 {name:"Node_28:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
  }
}
layer {
  name:"p0_1"
  type:"input"
  top:"p0_1"
  layer_param {
    idx:16
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"p1"
  type:"input"
  top:"p1"
  layer_param {
    idx:17
    out_0 {name:"p1:0",dtype:float32,shape:[2, 1, 7, 7, 3, 32]}
  }
}
layer {
  name:"p2"
  type:"input"
  top:"p2"
  layer_param {
    idx:18
    out_0 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_24"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_24"
  bottom:"p0_1"
  bottom:"p1"
  layer_param {
    idx:24
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 7, 7, 3, 32]}
    out_0 {name:"Node_24:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW3c', 'kernel_layout': 'OIHW3i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_26"
  type:"add"
  top:"Node_26"
  bottom:"Node_24"
  bottom:"p2"
  layer_param {
    idx:26
    in_0 {name:"Node_24:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_26:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
  }
}
layer {
  name:"Node_27"
  type:"nn_relu"
  top:"Node_27"
  bottom:"Node_26"
  layer_param {
    idx:27
    in_0 {name:"Node_26:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    out_0 {name:"Node_27:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
  }
}
layer {
  name:"Node_28"
  type:"function"
  top:"Node_28"
  bottom:"p0_1"
  bottom:"p1"
  bottom:"p2"
  bottom:"Node_27"
  layer_param {
    idx:28
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 7, 7, 3, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    in_3 {name:"Node_27:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    out_0 {name:"Node_28:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
  }
}
layer {
  name:"x_5"
  type:"var"
  top:"x_5"
  bottom:"Node_34"
  layer_param {
    idx:29
    in_0 {name:"Node_34:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
  }
}
layer {
  name:"Node_34"
  type:"var_call"
  top:"Node_34"
  bottom:"x_4"
  bottom:"x_1"
  bottom:"x_2"
  bottom:"x_3"
  layer_param {
    idx:34
    in_0 {name:"x:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_2 {name:"x:0",dtype:float32,shape:[2, 1, 7, 7, 3, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_34:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
  }
}
layer {
  name:"x_6"
  type:"var"
  top:"x_6"
  bottom:"Node_40"
  layer_param {
    idx:35
    in_0 {name:"Node_40:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"p0_2"
  type:"input"
  top:"p0_2"
  layer_param {
    idx:36
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
  }
}
layer {
  name:"Node_39"
  type:"nn_max_pool2d"
  top:"Node_39"
  bottom:"p0_2"
  layer_param {
    idx:39
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    out_0 {name:"Node_39:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW32c', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_40"
  type:"function"
  top:"Node_40"
  bottom:"p0_2"
  bottom:"Node_39"
  layer_param {
    idx:40
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    in_1 {name:"Node_39:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_40:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_7"
  type:"var"
  top:"x_7"
  bottom:"Node_44"
  layer_param {
    idx:41
    in_0 {name:"Node_44:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_44"
  type:"var_call"
  top:"Node_44"
  bottom:"x_6"
  bottom:"x_5"
  layer_param {
    idx:44
    in_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 112, 112, 32]}
    out_0 {name:"Node_44:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_8"
  type:"var"
  top:"x_8"
  bottom:"Node_50"
  layer_param {
    idx:45
    in_0 {name:"Node_50:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p0_3"
  type:"input"
  top:"p0_3"
  layer_param {
    idx:46
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_49"
  type:"layout_transform"
  top:"Node_49"
  bottom:"p0_3"
  layer_param {
    idx:49
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_49:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    attrs {'src_layout': 'NCHW32c', 'dst_layout': 'NCHW64c'}
  }
}
layer {
  name:"Node_50"
  type:"function"
  top:"Node_50"
  bottom:"p0_3"
  bottom:"Node_49"
  layer_param {
    idx:50
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"Node_49:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"Node_50:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_9"
  type:"var"
  top:"x_9"
  bottom:"Node_54"
  layer_param {
    idx:51
    in_0 {name:"Node_54:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"Node_54"
  type:"var_call"
  top:"Node_54"
  bottom:"x_8"
  bottom:"x_7"
  layer_param {
    idx:54
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_54:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_10"
  type:"var"
  top:"x_10"
  bottom:"Node_56"
  layer_param {
    idx:55
    in_0 {name:"Node_56:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"Node_56"
  type:"const"
  top:"Node_56"
  layer_param {
    idx:56
    out_0 {name:"Node_56:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"x_11"
  type:"var"
  top:"x_11"
  bottom:"Node_58"
  layer_param {
    idx:57
    in_0 {name:"Node_58:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_58"
  type:"const"
  top:"Node_58"
  layer_param {
    idx:58
    out_0 {name:"Node_58:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"x_12"
  type:"var"
  top:"x_12"
  bottom:"Node_72"
  layer_param {
    idx:59
    in_0 {name:"Node_72:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"p0_4"
  type:"input"
  top:"p0_4"
  layer_param {
    idx:60
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p1_1"
  type:"input"
  top:"p1_1"
  layer_param {
    idx:61
    out_0 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"p2_1"
  type:"input"
  top:"p2_1"
  layer_param {
    idx:62
    out_0 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_68"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_68"
  bottom:"p0_4"
  bottom:"p1_1"
  layer_param {
    idx:68
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"Node_68:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW64c', 'kernel_layout': 'OIHW64i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_70"
  type:"add"
  top:"Node_70"
  bottom:"Node_68"
  bottom:"p2_1"
  layer_param {
    idx:70
    in_0 {name:"Node_68:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_70:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_71"
  type:"nn_relu"
  top:"Node_71"
  bottom:"Node_70"
  layer_param {
    idx:71
    in_0 {name:"Node_70:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_71:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_72"
  type:"function"
  top:"Node_72"
  bottom:"p0_4"
  bottom:"p1_1"
  bottom:"p2_1"
  bottom:"Node_71"
  layer_param {
    idx:72
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    in_3 {name:"Node_71:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_72:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_13"
  type:"var"
  top:"x_13"
  bottom:"Node_78"
  layer_param {
    idx:73
    in_0 {name:"Node_78:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_78"
  type:"var_call"
  top:"Node_78"
  bottom:"x_12"
  bottom:"x_9"
  bottom:"x_10"
  bottom:"x_11"
  layer_param {
    idx:78
    in_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_2 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_78:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_14"
  type:"var"
  top:"x_14"
  bottom:"Node_84"
  layer_param {
    idx:79
    in_0 {name:"Node_84:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p0_5"
  type:"input"
  top:"p0_5"
  layer_param {
    idx:80
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_83"
  type:"layout_transform"
  top:"Node_83"
  bottom:"p0_5"
  layer_param {
    idx:83
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_83:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    attrs {'src_layout': 'NCHW32c', 'dst_layout': 'NCHW64c'}
  }
}
layer {
  name:"Node_84"
  type:"function"
  top:"Node_84"
  bottom:"p0_5"
  bottom:"Node_83"
  layer_param {
    idx:84
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"Node_83:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"Node_84:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_15"
  type:"var"
  top:"x_15"
  bottom:"Node_88"
  layer_param {
    idx:85
    in_0 {name:"Node_88:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"Node_88"
  type:"var_call"
  top:"Node_88"
  bottom:"x_14"
  bottom:"x_13"
  layer_param {
    idx:88
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_88:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_16"
  type:"var"
  top:"x_16"
  bottom:"Node_90"
  layer_param {
    idx:89
    in_0 {name:"Node_90:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"Node_90"
  type:"const"
  top:"Node_90"
  layer_param {
    idx:90
    out_0 {name:"Node_90:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"x_17"
  type:"var"
  top:"x_17"
  bottom:"Node_92"
  layer_param {
    idx:91
    in_0 {name:"Node_92:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_92"
  type:"const"
  top:"Node_92"
  layer_param {
    idx:92
    out_0 {name:"Node_92:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"x_18"
  type:"var"
  top:"x_18"
  bottom:"Node_110"
  layer_param {
    idx:93
    in_0 {name:"Node_110:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"p0_6"
  type:"input"
  top:"p0_6"
  layer_param {
    idx:94
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p1_2"
  type:"input"
  top:"p1_2"
  layer_param {
    idx:95
    out_0 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"p2_2"
  type:"input"
  top:"p2_2"
  layer_param {
    idx:96
    out_0 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"p3"
  type:"input"
  top:"p3"
  layer_param {
    idx:97
    out_0 {name:"p3:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_104"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_104"
  bottom:"p0_6"
  bottom:"p1_2"
  layer_param {
    idx:104
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"Node_104:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW64c', 'kernel_layout': 'OIHW64i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_106"
  type:"add"
  top:"Node_106"
  bottom:"Node_104"
  bottom:"p2_2"
  layer_param {
    idx:106
    in_0 {name:"Node_104:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_106:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_108"
  type:"add"
  top:"Node_108"
  bottom:"Node_106"
  bottom:"p3"
  layer_param {
    idx:108
    in_0 {name:"Node_106:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_108:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_109"
  type:"nn_relu"
  top:"Node_109"
  bottom:"Node_108"
  layer_param {
    idx:109
    in_0 {name:"Node_108:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_109:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_110"
  type:"function"
  top:"Node_110"
  bottom:"p0_6"
  bottom:"p1_2"
  bottom:"p2_2"
  bottom:"p3"
  bottom:"Node_109"
  layer_param {
    idx:110
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_4 {name:"Node_109:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_110:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_19"
  type:"var"
  top:"x_19"
  bottom:"Node_117"
  layer_param {
    idx:111
    in_0 {name:"Node_117:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_117"
  type:"var_call"
  top:"Node_117"
  bottom:"x_18"
  bottom:"x_15"
  bottom:"x_16"
  bottom:"x_17"
  bottom:"x_7"
  layer_param {
    idx:117
    in_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_2 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    in_4 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_117:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_20"
  type:"var"
  top:"x_20"
  bottom:"Node_123"
  layer_param {
    idx:118
    in_0 {name:"Node_123:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p0_7"
  type:"input"
  top:"p0_7"
  layer_param {
    idx:119
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_122"
  type:"layout_transform"
  top:"Node_122"
  bottom:"p0_7"
  layer_param {
    idx:122
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_122:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    attrs {'src_layout': 'NCHW32c', 'dst_layout': 'NCHW64c'}
  }
}
layer {
  name:"Node_123"
  type:"function"
  top:"Node_123"
  bottom:"p0_7"
  bottom:"Node_122"
  layer_param {
    idx:123
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"Node_122:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"Node_123:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_21"
  type:"var"
  top:"x_21"
  bottom:"Node_127"
  layer_param {
    idx:124
    in_0 {name:"Node_127:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"Node_127"
  type:"var_call"
  top:"Node_127"
  bottom:"x_20"
  bottom:"x_19"
  layer_param {
    idx:127
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_127:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_22"
  type:"var"
  top:"x_22"
  bottom:"Node_129"
  layer_param {
    idx:128
    in_0 {name:"Node_129:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"Node_129"
  type:"const"
  top:"Node_129"
  layer_param {
    idx:129
    out_0 {name:"Node_129:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"x_23"
  type:"var"
  top:"x_23"
  bottom:"Node_131"
  layer_param {
    idx:130
    in_0 {name:"Node_131:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_131"
  type:"const"
  top:"Node_131"
  layer_param {
    idx:131
    out_0 {name:"Node_131:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"x_24"
  type:"var"
  top:"x_24"
  bottom:"Node_145"
  layer_param {
    idx:132
    in_0 {name:"Node_145:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"p0_8"
  type:"input"
  top:"p0_8"
  layer_param {
    idx:133
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p1_3"
  type:"input"
  top:"p1_3"
  layer_param {
    idx:134
    out_0 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"p2_3"
  type:"input"
  top:"p2_3"
  layer_param {
    idx:135
    out_0 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_141"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_141"
  bottom:"p0_8"
  bottom:"p1_3"
  layer_param {
    idx:141
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"Node_141:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW64c', 'kernel_layout': 'OIHW64i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_143"
  type:"add"
  top:"Node_143"
  bottom:"Node_141"
  bottom:"p2_3"
  layer_param {
    idx:143
    in_0 {name:"Node_141:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_143:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_144"
  type:"nn_relu"
  top:"Node_144"
  bottom:"Node_143"
  layer_param {
    idx:144
    in_0 {name:"Node_143:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_144:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_145"
  type:"function"
  top:"Node_145"
  bottom:"p0_8"
  bottom:"p1_3"
  bottom:"p2_3"
  bottom:"Node_144"
  layer_param {
    idx:145
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    in_3 {name:"Node_144:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_145:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_25"
  type:"var"
  top:"x_25"
  bottom:"Node_151"
  layer_param {
    idx:146
    in_0 {name:"Node_151:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_151"
  type:"var_call"
  top:"Node_151"
  bottom:"x_24"
  bottom:"x_21"
  bottom:"x_22"
  bottom:"x_23"
  layer_param {
    idx:151
    in_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_2 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_151:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_26"
  type:"var"
  top:"x_26"
  bottom:"Node_157"
  layer_param {
    idx:152
    in_0 {name:"Node_157:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p0_9"
  type:"input"
  top:"p0_9"
  layer_param {
    idx:153
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_156"
  type:"layout_transform"
  top:"Node_156"
  bottom:"p0_9"
  layer_param {
    idx:156
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_156:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    attrs {'src_layout': 'NCHW32c', 'dst_layout': 'NCHW64c'}
  }
}
layer {
  name:"Node_157"
  type:"function"
  top:"Node_157"
  bottom:"p0_9"
  bottom:"Node_156"
  layer_param {
    idx:157
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"Node_156:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"Node_157:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_27"
  type:"var"
  top:"x_27"
  bottom:"Node_161"
  layer_param {
    idx:158
    in_0 {name:"Node_161:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"Node_161"
  type:"var_call"
  top:"Node_161"
  bottom:"x_26"
  bottom:"x_25"
  layer_param {
    idx:161
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_161:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"x_28"
  type:"var"
  top:"x_28"
  bottom:"Node_163"
  layer_param {
    idx:162
    in_0 {name:"Node_163:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"Node_163"
  type:"const"
  top:"Node_163"
  layer_param {
    idx:163
    out_0 {name:"Node_163:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"x_29"
  type:"var"
  top:"x_29"
  bottom:"Node_165"
  layer_param {
    idx:164
    in_0 {name:"Node_165:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"Node_165"
  type:"const"
  top:"Node_165"
  layer_param {
    idx:165
    out_0 {name:"Node_165:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"x_30"
  type:"var"
  top:"x_30"
  bottom:"Node_183"
  layer_param {
    idx:166
    in_0 {name:"Node_183:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"p0_10"
  type:"input"
  top:"p0_10"
  layer_param {
    idx:167
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
  }
}
layer {
  name:"p1_4"
  type:"input"
  top:"p1_4"
  layer_param {
    idx:168
    out_0 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
  }
}
layer {
  name:"p2_4"
  type:"input"
  top:"p2_4"
  layer_param {
    idx:169
    out_0 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
  }
}
layer {
  name:"p3_1"
  type:"input"
  top:"p3_1"
  layer_param {
    idx:170
    out_0 {name:"p3:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_177"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_177"
  bottom:"p0_10"
  bottom:"p1_4"
  layer_param {
    idx:177
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    out_0 {name:"Node_177:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW64c', 'kernel_layout': 'OIHW64i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_179"
  type:"add"
  top:"Node_179"
  bottom:"Node_177"
  bottom:"p2_4"
  layer_param {
    idx:179
    in_0 {name:"Node_177:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    out_0 {name:"Node_179:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_181"
  type:"add"
  top:"Node_181"
  bottom:"Node_179"
  bottom:"p3_1"
  layer_param {
    idx:181
    in_0 {name:"Node_179:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_181:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_182"
  type:"nn_relu"
  top:"Node_182"
  bottom:"Node_181"
  layer_param {
    idx:182
    in_0 {name:"Node_181:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_182:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_183"
  type:"function"
  top:"Node_183"
  bottom:"p0_10"
  bottom:"p1_4"
  bottom:"p2_4"
  bottom:"p3_1"
  bottom:"Node_182"
  layer_param {
    idx:183
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_4 {name:"Node_182:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_183:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_31"
  type:"var"
  top:"x_31"
  bottom:"Node_190"
  layer_param {
    idx:184
    in_0 {name:"Node_190:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_190"
  type:"var_call"
  top:"Node_190"
  bottom:"x_30"
  bottom:"x_27"
  bottom:"x_28"
  bottom:"x_29"
  bottom:"x_19"
  layer_param {
    idx:190
    in_0 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 1, 56, 56, 64]}
    in_2 {name:"x:0",dtype:float32,shape:[2, 1, 3, 3, 64, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 32]}
    in_4 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_190:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"x_32"
  type:"var"
  top:"x_32"
  bottom:"Node_192"
  layer_param {
    idx:191
    in_0 {name:"Node_192:0",dtype:float32,shape:[2, 2, 3, 3, 32, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[2, 2, 3, 3, 32, 64]}
  }
}
layer {
  name:"Node_192"
  type:"const"
  top:"Node_192"
  layer_param {
    idx:192
    out_0 {name:"Node_192:0",dtype:float32,shape:[2, 2, 3, 3, 32, 64]}
  }
}
layer {
  name:"x_33"
  type:"var"
  top:"x_33"
  bottom:"Node_194"
  layer_param {
    idx:193
    in_0 {name:"Node_194:0",dtype:float32,shape:[1, 2, 1, 1, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 64]}
  }
}
layer {
  name:"Node_194"
  type:"const"
  top:"Node_194"
  layer_param {
    idx:194
    out_0 {name:"Node_194:0",dtype:float32,shape:[1, 2, 1, 1, 64]}
  }
}
layer {
  name:"x_34"
  type:"var"
  top:"x_34"
  bottom:"Node_208"
  layer_param {
    idx:195
    in_0 {name:"Node_208:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
  }
}
layer {
  name:"p0_11"
  type:"input"
  top:"p0_11"
  layer_param {
    idx:196
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"p1_5"
  type:"input"
  top:"p1_5"
  layer_param {
    idx:197
    out_0 {name:"p1:0",dtype:float32,shape:[2, 2, 3, 3, 32, 64]}
  }
}
layer {
  name:"p2_5"
  type:"input"
  top:"p2_5"
  layer_param {
    idx:198
    out_0 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 64]}
  }
}
layer {
  name:"Node_204"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_204"
  bottom:"p0_11"
  bottom:"p1_5"
  layer_param {
    idx:204
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 2, 3, 3, 32, 64]}
    out_0 {name:"Node_204:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW32c', 'kernel_layout': 'OIHW32i64o', 'out_layout': 'NCHW64c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_206"
  type:"add"
  top:"Node_206"
  bottom:"Node_204"
  bottom:"p2_5"
  layer_param {
    idx:206
    in_0 {name:"Node_204:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 64]}
    out_0 {name:"Node_206:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
  }
}
layer {
  name:"Node_207"
  type:"nn_relu"
  top:"Node_207"
  bottom:"Node_206"
  layer_param {
    idx:207
    in_0 {name:"Node_206:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    out_0 {name:"Node_207:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
  }
}
layer {
  name:"Node_208"
  type:"function"
  top:"Node_208"
  bottom:"p0_11"
  bottom:"p1_5"
  bottom:"p2_5"
  bottom:"Node_207"
  layer_param {
    idx:208
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"p1:0",dtype:float32,shape:[2, 2, 3, 3, 32, 64]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 2, 1, 1, 64]}
    in_3 {name:"Node_207:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    out_0 {name:"Node_208:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
  }
}
layer {
  name:"x_35"
  type:"var"
  top:"x_35"
  bottom:"Node_214"
  layer_param {
    idx:209
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
  }
}
layer {
  name:"Node_214"
  type:"var_call"
  top:"Node_214"
  bottom:"x_34"
  bottom:"x_31"
  bottom:"x_32"
  bottom:"x_33"
  layer_param {
    idx:214
    in_0 {name:"x:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_2 {name:"x:0",dtype:float32,shape:[2, 2, 3, 3, 32, 64]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 2, 1, 1, 64]}
    out_0 {name:"Node_214:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
  }
}
layer {
  name:"x_36"
  type:"var"
  top:"x_36"
  bottom:"Node_220"
  layer_param {
    idx:215
    in_0 {name:"Node_220:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"p0_12"
  type:"input"
  top:"p0_12"
  layer_param {
    idx:216
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
  }
}
layer {
  name:"Node_219"
  type:"layout_transform"
  top:"Node_219"
  bottom:"p0_12"
  layer_param {
    idx:219
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    out_0 {name:"Node_219:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    attrs {'src_layout': 'NCHW64c', 'dst_layout': 'NCHW128c'}
  }
}
layer {
  name:"Node_220"
  type:"function"
  top:"Node_220"
  bottom:"p0_12"
  bottom:"Node_219"
  layer_param {
    idx:220
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    in_1 {name:"Node_219:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    out_0 {name:"Node_220:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"x_37"
  type:"var"
  top:"x_37"
  bottom:"Node_224"
  layer_param {
    idx:221
    in_0 {name:"Node_224:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"Node_224"
  type:"var_call"
  top:"Node_224"
  bottom:"x_36"
  bottom:"x_35"
  layer_param {
    idx:224
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 28, 28, 64]}
    out_0 {name:"Node_224:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"x_38"
  type:"var"
  top:"x_38"
  bottom:"Node_226"
  layer_param {
    idx:225
    in_0 {name:"Node_226:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
  }
}
layer {
  name:"Node_226"
  type:"const"
  top:"Node_226"
  layer_param {
    idx:226
    out_0 {name:"Node_226:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
  }
}
layer {
  name:"x_39"
  type:"var"
  top:"x_39"
  bottom:"Node_228"
  layer_param {
    idx:227
    in_0 {name:"Node_228:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"Node_228"
  type:"const"
  top:"Node_228"
  layer_param {
    idx:228
    out_0 {name:"Node_228:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"x_40"
  type:"var"
  top:"x_40"
  bottom:"Node_234"
  layer_param {
    idx:229
    in_0 {name:"Node_234:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p0_13"
  type:"input"
  top:"p0_13"
  layer_param {
    idx:230
    out_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
  }
}
layer {
  name:"Node_233"
  type:"layout_transform"
  top:"Node_233"
  bottom:"p0_13"
  layer_param {
    idx:233
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_233:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'src_layout': 'NCHW32c', 'dst_layout': 'NCHW8c'}
  }
}
layer {
  name:"Node_234"
  type:"function"
  top:"Node_234"
  bottom:"p0_13"
  bottom:"Node_233"
  layer_param {
    idx:234
    in_0 {name:"p0:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    in_1 {name:"Node_233:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_234:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_41"
  type:"var"
  top:"x_41"
  bottom:"Node_238"
  layer_param {
    idx:235
    in_0 {name:"Node_238:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_238"
  type:"var_call"
  top:"Node_238"
  bottom:"x_40"
  bottom:"x_31"
  layer_param {
    idx:238
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 2, 56, 56, 32]}
    out_0 {name:"Node_238:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_42"
  type:"var"
  top:"x_42"
  bottom:"Node_240"
  layer_param {
    idx:239
    in_0 {name:"Node_240:0",dtype:float32,shape:[4, 8, 1, 1, 8, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[4, 8, 1, 1, 8, 32]}
  }
}
layer {
  name:"Node_240"
  type:"const"
  top:"Node_240"
  layer_param {
    idx:240
    out_0 {name:"Node_240:0",dtype:float32,shape:[4, 8, 1, 1, 8, 32]}
  }
}
layer {
  name:"x_43"
  type:"var"
  top:"x_43"
  bottom:"Node_242"
  layer_param {
    idx:241
    in_0 {name:"Node_242:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"Node_242"
  type:"const"
  top:"Node_242"
  layer_param {
    idx:242
    out_0 {name:"Node_242:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"x_44"
  type:"var"
  top:"x_44"
  bottom:"Node_254"
  layer_param {
    idx:243
    in_0 {name:"Node_254:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"p0_14"
  type:"input"
  top:"p0_14"
  layer_param {
    idx:244
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_6"
  type:"input"
  top:"p1_6"
  layer_param {
    idx:245
    out_0 {name:"p1:0",dtype:float32,shape:[4, 8, 1, 1, 8, 32]}
  }
}
layer {
  name:"p2_6"
  type:"input"
  top:"p2_6"
  layer_param {
    idx:246
    out_0 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"Node_251"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_251"
  bottom:"p0_14"
  bottom:"p1_6"
  layer_param {
    idx:251
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[4, 8, 1, 1, 8, 32]}
    out_0 {name:"Node_251:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [1, 1], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_253"
  type:"add"
  top:"Node_253"
  bottom:"Node_251"
  bottom:"p2_6"
  layer_param {
    idx:253
    in_0 {name:"Node_251:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"Node_253:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_254"
  type:"function"
  top:"Node_254"
  bottom:"p0_14"
  bottom:"p1_6"
  bottom:"p2_6"
  bottom:"Node_253"
  layer_param {
    idx:254
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[4, 8, 1, 1, 8, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    in_3 {name:"Node_253:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_254:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"x_45"
  type:"var"
  top:"x_45"
  bottom:"Node_260"
  layer_param {
    idx:255
    in_0 {name:"Node_260:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_260"
  type:"var_call"
  top:"Node_260"
  bottom:"x_44"
  bottom:"x_41"
  bottom:"x_42"
  bottom:"x_43"
  layer_param {
    idx:260
    in_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[4, 8, 1, 1, 8, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"Node_260:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"x_46"
  type:"var"
  top:"x_46"
  bottom:"Node_278"
  layer_param {
    idx:261
    in_0 {name:"Node_278:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"p0_15"
  type:"input"
  top:"p0_15"
  layer_param {
    idx:262
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"p1_7"
  type:"input"
  top:"p1_7"
  layer_param {
    idx:263
    out_0 {name:"p1:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
  }
}
layer {
  name:"p2_7"
  type:"input"
  top:"p2_7"
  layer_param {
    idx:264
    out_0 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"p3_2"
  type:"input"
  top:"p3_2"
  layer_param {
    idx:265
    out_0 {name:"p3:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_272"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_272"
  bottom:"p0_15"
  bottom:"p1_7"
  layer_param {
    idx:272
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_1 {name:"p1:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    out_0 {name:"Node_272:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW128c', 'kernel_layout': 'OIHW128i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_274"
  type:"add"
  top:"Node_274"
  bottom:"Node_272"
  bottom:"p2_7"
  layer_param {
    idx:274
    in_0 {name:"Node_272:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"Node_274:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_276"
  type:"add"
  top:"Node_276"
  bottom:"Node_274"
  bottom:"p3_2"
  layer_param {
    idx:276
    in_0 {name:"Node_274:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_276:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_277"
  type:"nn_relu"
  top:"Node_277"
  bottom:"Node_276"
  layer_param {
    idx:277
    in_0 {name:"Node_276:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_277:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_278"
  type:"function"
  top:"Node_278"
  bottom:"p0_15"
  bottom:"p1_7"
  bottom:"p2_7"
  bottom:"p3_2"
  bottom:"Node_277"
  layer_param {
    idx:278
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_1 {name:"p1:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_4 {name:"Node_277:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_278:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"x_47"
  type:"var"
  top:"x_47"
  bottom:"Node_285"
  layer_param {
    idx:279
    in_0 {name:"Node_285:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_285"
  type:"var_call"
  top:"Node_285"
  bottom:"x_46"
  bottom:"x_37"
  bottom:"x_38"
  bottom:"x_39"
  bottom:"x_45"
  layer_param {
    idx:285
    in_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_2 {name:"x:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    in_4 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_285:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"x_48"
  type:"var"
  top:"x_48"
  bottom:"Node_291"
  layer_param {
    idx:286
    in_0 {name:"Node_291:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"p0_16"
  type:"input"
  top:"p0_16"
  layer_param {
    idx:287
    out_0 {name:"p0:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_290"
  type:"layout_transform"
  top:"Node_290"
  bottom:"p0_16"
  layer_param {
    idx:290
    in_0 {name:"p0:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_290:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    attrs {'src_layout': 'NCHW32c', 'dst_layout': 'NCHW128c'}
  }
}
layer {
  name:"Node_291"
  type:"function"
  top:"Node_291"
  bottom:"p0_16"
  bottom:"Node_290"
  layer_param {
    idx:291
    in_0 {name:"p0:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"Node_290:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    out_0 {name:"Node_291:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"x_49"
  type:"var"
  top:"x_49"
  bottom:"Node_295"
  layer_param {
    idx:292
    in_0 {name:"Node_295:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"Node_295"
  type:"var_call"
  top:"Node_295"
  bottom:"x_48"
  bottom:"x_47"
  layer_param {
    idx:295
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_295:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"x_50"
  type:"var"
  top:"x_50"
  bottom:"Node_297"
  layer_param {
    idx:296
    in_0 {name:"Node_297:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
  }
}
layer {
  name:"Node_297"
  type:"const"
  top:"Node_297"
  layer_param {
    idx:297
    out_0 {name:"Node_297:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
  }
}
layer {
  name:"x_51"
  type:"var"
  top:"x_51"
  bottom:"Node_299"
  layer_param {
    idx:298
    in_0 {name:"Node_299:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"Node_299"
  type:"const"
  top:"Node_299"
  layer_param {
    idx:299
    out_0 {name:"Node_299:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"x_52"
  type:"var"
  top:"x_52"
  bottom:"Node_313"
  layer_param {
    idx:300
    in_0 {name:"Node_313:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"p0_17"
  type:"input"
  top:"p0_17"
  layer_param {
    idx:301
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
  }
}
layer {
  name:"p1_8"
  type:"input"
  top:"p1_8"
  layer_param {
    idx:302
    out_0 {name:"p1:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
  }
}
layer {
  name:"p2_8"
  type:"input"
  top:"p2_8"
  layer_param {
    idx:303
    out_0 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
  }
}
layer {
  name:"Node_309"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_309"
  bottom:"p0_17"
  bottom:"p1_8"
  layer_param {
    idx:309
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_1 {name:"p1:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    out_0 {name:"Node_309:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW128c', 'kernel_layout': 'OIHW128i32o', 'out_layout': 'NCHW32c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_311"
  type:"add"
  top:"Node_311"
  bottom:"Node_309"
  bottom:"p2_8"
  layer_param {
    idx:311
    in_0 {name:"Node_309:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"Node_311:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_312"
  type:"nn_relu"
  top:"Node_312"
  bottom:"Node_311"
  layer_param {
    idx:312
    in_0 {name:"Node_311:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_312:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_313"
  type:"function"
  top:"Node_313"
  bottom:"p0_17"
  bottom:"p1_8"
  bottom:"p2_8"
  bottom:"Node_312"
  layer_param {
    idx:313
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_1 {name:"p1:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    in_3 {name:"Node_312:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"Node_313:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"x_53"
  type:"var"
  top:"x_53"
  bottom:"Node_319"
  layer_param {
    idx:314
    in_0 {name:"Node_319:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"Node_319"
  type:"var_call"
  top:"Node_319"
  bottom:"x_52"
  bottom:"x_49"
  bottom:"x_50"
  bottom:"x_51"
  layer_param {
    idx:319
    in_0 {name:"x:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
    in_1 {name:"x:0",dtype:float32,shape:[1, 1, 28, 28, 128]}
    in_2 {name:"x:0",dtype:float32,shape:[4, 1, 3, 3, 128, 32]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 4, 1, 1, 32]}
    out_0 {name:"Node_319:0",dtype:float32,shape:[1, 4, 28, 28, 32]}
  }
}
layer {
  name:"x_54"
  type:"var"
  top:"x_54"
  bottom:"Node_325"
  layer_param {
    idx:320
