name : "relay_ir"
layer {
  name:"DecodeJpeg/contents"
  type:"input"
  top:"DecodeJpeg/contents"
  layer_param {
    idx:0
    out_0 {name:"DecodeJpeg/contents:0",dtype:uint8,shape:[299, 299, 3]}
  }
}
layer {
  name:"Node_78"
  type:"cast"
  top:"Node_78"
  bottom:"DecodeJpeg/contents"
  layer_param {
    idx:78
    in_0 {name:"DecodeJpeg/contents:0",dtype:uint8,shape:[299, 299, 3]}
    out_0 {name:"Node_78:0",dtype:float32,shape:[299, 299, 3]}
    attrs {'dtype': 'float32'}
  }
}
layer {
  name:"Node_79"
  type:"expand_dims"
  top:"Node_79"
  bottom:"Node_78"
  layer_param {
    idx:79
    in_0 {name:"Node_78:0",dtype:float32,shape:[299, 299, 3]}
    out_0 {name:"Node_79:0",dtype:float32,shape:[1, 299, 299, 3]}
    attrs {'axis': 0, 'num_newaxis': 1}
  }
}
layer {
  name:"Node_80"
  type:"image_resize"
  top:"Node_80"
  bottom:"Node_79"
  layer_param {
    idx:80
    in_0 {name:"Node_79:0",dtype:float32,shape:[1, 299, 299, 3]}
    out_0 {name:"Node_80:0",dtype:float32,shape:[1, 299, 299, 3]}
    attrs {'size': [299, 299], 'layout': 'NHWC', 'method': 'bilinear', 'coordinate_transformation_mode': 'asymmetric', 'rounding_method': '', 'bicubic_alpha': -0.5, 'bicubic_exclude': 0, 'out_dtype': ''}
  }
}
layer {
  name:"Node_81"
  type:"const"
  top:"Node_81"
  layer_param {
    idx:81
    out_0 {name:"Node_81:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_82"
  type:"subtract"
  top:"Node_82"
  bottom:"Node_80"
  bottom:"Node_81"
  layer_param {
    idx:82
    in_0 {name:"Node_80:0",dtype:float32,shape:[1, 299, 299, 3]}
    in_1 {name:"Node_81:0",dtype:float32,shape:[]}
    out_0 {name:"Node_82:0",dtype:float32,shape:[1, 299, 299, 3]}
  }
}
layer {
  name:"Node_83"
  type:"const"
  top:"Node_83"
  layer_param {
    idx:83
    out_0 {name:"Node_83:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_84"
  type:"multiply"
  top:"Node_84"
  bottom:"Node_82"
  bottom:"Node_83"
  layer_param {
    idx:84
    in_0 {name:"Node_82:0",dtype:float32,shape:[1, 299, 299, 3]}
    in_1 {name:"Node_83:0",dtype:float32,shape:[]}
    out_0 {name:"Node_84:0",dtype:float32,shape:[1, 299, 299, 3]}
  }
}
layer {
  name:"Node_85"
  type:"layout_transform"
  top:"Node_85"
  bottom:"Node_84"
  layer_param {
    idx:85
    in_0 {name:"Node_84:0",dtype:float32,shape:[1, 299, 299, 3]}
    out_0 {name:"Node_85:0",dtype:float32,shape:[1, 3, 299, 299]}
    attrs {'src_layout': 'NHWC', 'dst_layout': 'NCHW'}
  }
}
layer {
  name:"Node_87"
  type:"const"
  top:"Node_87"
  layer_param {
    idx:87
    out_0 {name:"Node_87:0",dtype:float32,shape:[3, 3, 3, 32]}
  }
}
layer {
  name:"Node_88"
  type:"layout_transform"
  top:"Node_88"
  bottom:"Node_87"
  layer_param {
    idx:88
    in_0 {name:"Node_87:0",dtype:float32,shape:[3, 3, 3, 32]}
    out_0 {name:"Node_88:0",dtype:float32,shape:[32, 3, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_89"
  type:"nn_conv2d"
  top:"Node_89"
  bottom:"Node_85"
  bottom:"Node_88"
  layer_param {
    idx:89
    in_0 {name:"Node_85:0",dtype:float32,shape:[1, 3, 299, 299]}
    in_1 {name:"Node_88:0",dtype:float32,shape:[32, 3, 3, 3]}
    out_0 {name:"Node_89:0",dtype:float32,shape:[1, 32, 149, 149]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 32, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_90"
  type:"const"
  top:"Node_90"
  layer_param {
    idx:90
    out_0 {name:"Node_90:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_91"
  type:"const"
  top:"Node_91"
  layer_param {
    idx:91
    out_0 {name:"Node_91:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_92"
  type:"const"
  top:"Node_92"
  layer_param {
    idx:92
    out_0 {name:"Node_92:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_93"
  type:"const"
  top:"Node_93"
  layer_param {
    idx:93
    out_0 {name:"Node_93:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_94"
  type:"nn_batch_norm"
  top:"Node_94"
  bottom:"Node_89"
  bottom:"Node_90"
  bottom:"Node_91"
  bottom:"Node_92"
  bottom:"Node_93"
  layer_param {
    idx:94
    in_0 {name:"Node_89:0",dtype:float32,shape:[1, 32, 149, 149]}
    in_1 {name:"Node_90:0",dtype:float32,shape:[32]}
    in_2 {name:"Node_91:0",dtype:float32,shape:[32]}
    in_3 {name:"Node_92:0",dtype:float32,shape:[32]}
    in_4 {name:"Node_93:0",dtype:float32,shape:[32]}
    out_0 {name:"Node_94:0",dtype:float32,shape:[1, 32, 149, 149]}
    out_1 {name:"Node_94:1",dtype:float32,shape:[32]}
    out_2 {name:"Node_94:2",dtype:float32,shape:[32]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_96"
  type:"nn_relu"
  top:"Node_96"
  bottom:"Node_94"
  layer_param {
    idx:96
    in_0 {name:"Node_94:0",dtype:float32,shape:[1, 32, 149, 149]}
    out_0 {name:"Node_96:0",dtype:float32,shape:[1, 32, 149, 149]}
  }
}
layer {
  name:"Node_98"
  type:"const"
  top:"Node_98"
  layer_param {
    idx:98
    out_0 {name:"Node_98:0",dtype:float32,shape:[3, 3, 32, 32]}
  }
}
layer {
  name:"Node_99"
  type:"layout_transform"
  top:"Node_99"
  bottom:"Node_98"
  layer_param {
    idx:99
    in_0 {name:"Node_98:0",dtype:float32,shape:[3, 3, 32, 32]}
    out_0 {name:"Node_99:0",dtype:float32,shape:[32, 32, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_100"
  type:"nn_conv2d"
  top:"Node_100"
  bottom:"Node_96"
  bottom:"Node_99"
  layer_param {
    idx:100
    in_0 {name:"Node_96:0",dtype:float32,shape:[1, 32, 149, 149]}
    in_1 {name:"Node_99:0",dtype:float32,shape:[32, 32, 3, 3]}
    out_0 {name:"Node_100:0",dtype:float32,shape:[1, 32, 147, 147]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 32, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_101"
  type:"const"
  top:"Node_101"
  layer_param {
    idx:101
    out_0 {name:"Node_101:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_102"
  type:"const"
  top:"Node_102"
  layer_param {
    idx:102
    out_0 {name:"Node_102:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_103"
  type:"const"
  top:"Node_103"
  layer_param {
    idx:103
    out_0 {name:"Node_103:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_104"
  type:"const"
  top:"Node_104"
  layer_param {
    idx:104
    out_0 {name:"Node_104:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_105"
  type:"nn_batch_norm"
  top:"Node_105"
  bottom:"Node_100"
  bottom:"Node_101"
  bottom:"Node_102"
  bottom:"Node_103"
  bottom:"Node_104"
  layer_param {
    idx:105
    in_0 {name:"Node_100:0",dtype:float32,shape:[1, 32, 147, 147]}
    in_1 {name:"Node_101:0",dtype:float32,shape:[32]}
    in_2 {name:"Node_102:0",dtype:float32,shape:[32]}
    in_3 {name:"Node_103:0",dtype:float32,shape:[32]}
    in_4 {name:"Node_104:0",dtype:float32,shape:[32]}
    out_0 {name:"Node_105:0",dtype:float32,shape:[1, 32, 147, 147]}
    out_1 {name:"Node_105:1",dtype:float32,shape:[32]}
    out_2 {name:"Node_105:2",dtype:float32,shape:[32]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_107"
  type:"nn_relu"
  top:"Node_107"
  bottom:"Node_105"
  layer_param {
    idx:107
    in_0 {name:"Node_105:0",dtype:float32,shape:[1, 32, 147, 147]}
    out_0 {name:"Node_107:0",dtype:float32,shape:[1, 32, 147, 147]}
  }
}
layer {
  name:"Node_109"
  type:"const"
  top:"Node_109"
  layer_param {
    idx:109
    out_0 {name:"Node_109:0",dtype:float32,shape:[3, 3, 32, 64]}
  }
}
layer {
  name:"Node_110"
  type:"layout_transform"
  top:"Node_110"
  bottom:"Node_109"
  layer_param {
    idx:110
    in_0 {name:"Node_109:0",dtype:float32,shape:[3, 3, 32, 64]}
    out_0 {name:"Node_110:0",dtype:float32,shape:[64, 32, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_111"
  type:"nn_conv2d"
  top:"Node_111"
  bottom:"Node_107"
  bottom:"Node_110"
  layer_param {
    idx:111
    in_0 {name:"Node_107:0",dtype:float32,shape:[1, 32, 147, 147]}
    in_1 {name:"Node_110:0",dtype:float32,shape:[64, 32, 3, 3]}
    out_0 {name:"Node_111:0",dtype:float32,shape:[1, 64, 147, 147]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_112"
  type:"const"
  top:"Node_112"
  layer_param {
    idx:112
    out_0 {name:"Node_112:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_113"
  type:"const"
  top:"Node_113"
  layer_param {
    idx:113
    out_0 {name:"Node_113:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_114"
  type:"const"
  top:"Node_114"
  layer_param {
    idx:114
    out_0 {name:"Node_114:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_115"
  type:"const"
  top:"Node_115"
  layer_param {
    idx:115
    out_0 {name:"Node_115:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_116"
  type:"nn_batch_norm"
  top:"Node_116"
  bottom:"Node_111"
  bottom:"Node_112"
  bottom:"Node_113"
  bottom:"Node_114"
  bottom:"Node_115"
  layer_param {
    idx:116
    in_0 {name:"Node_111:0",dtype:float32,shape:[1, 64, 147, 147]}
    in_1 {name:"Node_112:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_113:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_114:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_115:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_116:0",dtype:float32,shape:[1, 64, 147, 147]}
    out_1 {name:"Node_116:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_116:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_118"
  type:"nn_relu"
  top:"Node_118"
  bottom:"Node_116"
  layer_param {
    idx:118
    in_0 {name:"Node_116:0",dtype:float32,shape:[1, 64, 147, 147]}
    out_0 {name:"Node_118:0",dtype:float32,shape:[1, 64, 147, 147]}
  }
}
layer {
  name:"Node_119"
  type:"nn_max_pool2d"
  top:"Node_119"
  bottom:"Node_118"
  layer_param {
    idx:119
    in_0 {name:"Node_118:0",dtype:float32,shape:[1, 64, 147, 147]}
    out_0 {name:"Node_119:0",dtype:float32,shape:[1, 64, 73, 73]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'dilation': [1, 1], 'padding': [0, 0, 0, 0], 'layout': 'NCHW', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_121"
  type:"const"
  top:"Node_121"
  layer_param {
    idx:121
    out_0 {name:"Node_121:0",dtype:float32,shape:[1, 1, 64, 80]}
  }
}
layer {
  name:"Node_122"
  type:"layout_transform"
  top:"Node_122"
  bottom:"Node_121"
  layer_param {
    idx:122
    in_0 {name:"Node_121:0",dtype:float32,shape:[1, 1, 64, 80]}
    out_0 {name:"Node_122:0",dtype:float32,shape:[80, 64, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_123"
  type:"nn_conv2d"
  top:"Node_123"
  bottom:"Node_119"
  bottom:"Node_122"
  layer_param {
    idx:123
    in_0 {name:"Node_119:0",dtype:float32,shape:[1, 64, 73, 73]}
    in_1 {name:"Node_122:0",dtype:float32,shape:[80, 64, 1, 1]}
    out_0 {name:"Node_123:0",dtype:float32,shape:[1, 80, 73, 73]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 80, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_124"
  type:"const"
  top:"Node_124"
  layer_param {
    idx:124
    out_0 {name:"Node_124:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_125"
  type:"const"
  top:"Node_125"
  layer_param {
    idx:125
    out_0 {name:"Node_125:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_126"
  type:"const"
  top:"Node_126"
  layer_param {
    idx:126
    out_0 {name:"Node_126:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_127"
  type:"const"
  top:"Node_127"
  layer_param {
    idx:127
    out_0 {name:"Node_127:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_128"
  type:"nn_batch_norm"
  top:"Node_128"
  bottom:"Node_123"
  bottom:"Node_124"
  bottom:"Node_125"
  bottom:"Node_126"
  bottom:"Node_127"
  layer_param {
    idx:128
    in_0 {name:"Node_123:0",dtype:float32,shape:[1, 80, 73, 73]}
    in_1 {name:"Node_124:0",dtype:float32,shape:[80]}
    in_2 {name:"Node_125:0",dtype:float32,shape:[80]}
    in_3 {name:"Node_126:0",dtype:float32,shape:[80]}
    in_4 {name:"Node_127:0",dtype:float32,shape:[80]}
    out_0 {name:"Node_128:0",dtype:float32,shape:[1, 80, 73, 73]}
    out_1 {name:"Node_128:1",dtype:float32,shape:[80]}
    out_2 {name:"Node_128:2",dtype:float32,shape:[80]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_130"
  type:"nn_relu"
  top:"Node_130"
  bottom:"Node_128"
  layer_param {
    idx:130
    in_0 {name:"Node_128:0",dtype:float32,shape:[1, 80, 73, 73]}
    out_0 {name:"Node_130:0",dtype:float32,shape:[1, 80, 73, 73]}
  }
}
layer {
  name:"Node_132"
  type:"const"
  top:"Node_132"
  layer_param {
    idx:132
    out_0 {name:"Node_132:0",dtype:float32,shape:[3, 3, 80, 192]}
  }
}
layer {
  name:"Node_133"
  type:"layout_transform"
  top:"Node_133"
  bottom:"Node_132"
  layer_param {
    idx:133
    in_0 {name:"Node_132:0",dtype:float32,shape:[3, 3, 80, 192]}
    out_0 {name:"Node_133:0",dtype:float32,shape:[192, 80, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_134"
  type:"nn_conv2d"
  top:"Node_134"
  bottom:"Node_130"
  bottom:"Node_133"
  layer_param {
    idx:134
    in_0 {name:"Node_130:0",dtype:float32,shape:[1, 80, 73, 73]}
    in_1 {name:"Node_133:0",dtype:float32,shape:[192, 80, 3, 3]}
    out_0 {name:"Node_134:0",dtype:float32,shape:[1, 192, 71, 71]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 192, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_135"
  type:"const"
  top:"Node_135"
  layer_param {
    idx:135
    out_0 {name:"Node_135:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_136"
  type:"const"
  top:"Node_136"
  layer_param {
    idx:136
    out_0 {name:"Node_136:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_137"
  type:"const"
  top:"Node_137"
  layer_param {
    idx:137
    out_0 {name:"Node_137:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_138"
  type:"const"
  top:"Node_138"
  layer_param {
    idx:138
    out_0 {name:"Node_138:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_139"
  type:"nn_batch_norm"
  top:"Node_139"
  bottom:"Node_134"
  bottom:"Node_135"
  bottom:"Node_136"
  bottom:"Node_137"
  bottom:"Node_138"
  layer_param {
    idx:139
    in_0 {name:"Node_134:0",dtype:float32,shape:[1, 192, 71, 71]}
    in_1 {name:"Node_135:0",dtype:float32,shape:[192]}
    in_2 {name:"Node_136:0",dtype:float32,shape:[192]}
    in_3 {name:"Node_137:0",dtype:float32,shape:[192]}
    in_4 {name:"Node_138:0",dtype:float32,shape:[192]}
    out_0 {name:"Node_139:0",dtype:float32,shape:[1, 192, 71, 71]}
    out_1 {name:"Node_139:1",dtype:float32,shape:[192]}
    out_2 {name:"Node_139:2",dtype:float32,shape:[192]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_141"
  type:"nn_relu"
  top:"Node_141"
  bottom:"Node_139"
  layer_param {
    idx:141
    in_0 {name:"Node_139:0",dtype:float32,shape:[1, 192, 71, 71]}
    out_0 {name:"Node_141:0",dtype:float32,shape:[1, 192, 71, 71]}
  }
}
layer {
  name:"Node_142"
  type:"nn_max_pool2d"
  top:"Node_142"
  bottom:"Node_141"
  layer_param {
    idx:142
    in_0 {name:"Node_141:0",dtype:float32,shape:[1, 192, 71, 71]}
    out_0 {name:"Node_142:0",dtype:float32,shape:[1, 192, 35, 35]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'dilation': [1, 1], 'padding': [0, 0, 0, 0], 'layout': 'NCHW', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_144"
  type:"const"
  top:"Node_144"
  layer_param {
    idx:144
    out_0 {name:"Node_144:0",dtype:float32,shape:[1, 1, 192, 64]}
  }
}
layer {
  name:"Node_145"
  type:"layout_transform"
  top:"Node_145"
  bottom:"Node_144"
  layer_param {
    idx:145
    in_0 {name:"Node_144:0",dtype:float32,shape:[1, 1, 192, 64]}
    out_0 {name:"Node_145:0",dtype:float32,shape:[64, 192, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_146"
  type:"nn_conv2d"
  top:"Node_146"
  bottom:"Node_142"
  bottom:"Node_145"
  layer_param {
    idx:146
    in_0 {name:"Node_142:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_145:0",dtype:float32,shape:[64, 192, 1, 1]}
    out_0 {name:"Node_146:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_147"
  type:"const"
  top:"Node_147"
  layer_param {
    idx:147
    out_0 {name:"Node_147:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_148"
  type:"const"
  top:"Node_148"
  layer_param {
    idx:148
    out_0 {name:"Node_148:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_149"
  type:"const"
  top:"Node_149"
  layer_param {
    idx:149
    out_0 {name:"Node_149:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_150"
  type:"const"
  top:"Node_150"
  layer_param {
    idx:150
    out_0 {name:"Node_150:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_151"
  type:"nn_batch_norm"
  top:"Node_151"
  bottom:"Node_146"
  bottom:"Node_147"
  bottom:"Node_148"
  bottom:"Node_149"
  bottom:"Node_150"
  layer_param {
    idx:151
    in_0 {name:"Node_146:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_147:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_148:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_149:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_150:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_151:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_151:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_151:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_153"
  type:"nn_relu"
  top:"Node_153"
  bottom:"Node_151"
  layer_param {
    idx:153
    in_0 {name:"Node_151:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_153:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_162"
  type:"const"
  top:"Node_162"
  layer_param {
    idx:162
    out_0 {name:"Node_162:0",dtype:float32,shape:[1, 1, 192, 48]}
  }
}
layer {
  name:"Node_163"
  type:"layout_transform"
  top:"Node_163"
  bottom:"Node_162"
  layer_param {
    idx:163
    in_0 {name:"Node_162:0",dtype:float32,shape:[1, 1, 192, 48]}
    out_0 {name:"Node_163:0",dtype:float32,shape:[48, 192, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_164"
  type:"nn_conv2d"
  top:"Node_164"
  bottom:"Node_142"
  bottom:"Node_163"
  layer_param {
    idx:164
    in_0 {name:"Node_142:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_163:0",dtype:float32,shape:[48, 192, 1, 1]}
    out_0 {name:"Node_164:0",dtype:float32,shape:[1, 48, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 48, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_165"
  type:"const"
  top:"Node_165"
  layer_param {
    idx:165
    out_0 {name:"Node_165:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_166"
  type:"const"
  top:"Node_166"
  layer_param {
    idx:166
    out_0 {name:"Node_166:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_167"
  type:"const"
  top:"Node_167"
  layer_param {
    idx:167
    out_0 {name:"Node_167:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_168"
  type:"const"
  top:"Node_168"
  layer_param {
    idx:168
    out_0 {name:"Node_168:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_169"
  type:"nn_batch_norm"
  top:"Node_169"
  bottom:"Node_164"
  bottom:"Node_165"
  bottom:"Node_166"
  bottom:"Node_167"
  bottom:"Node_168"
  layer_param {
    idx:169
    in_0 {name:"Node_164:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_165:0",dtype:float32,shape:[48]}
    in_2 {name:"Node_166:0",dtype:float32,shape:[48]}
    in_3 {name:"Node_167:0",dtype:float32,shape:[48]}
    in_4 {name:"Node_168:0",dtype:float32,shape:[48]}
    out_0 {name:"Node_169:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_1 {name:"Node_169:1",dtype:float32,shape:[48]}
    out_2 {name:"Node_169:2",dtype:float32,shape:[48]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_171"
  type:"nn_relu"
  top:"Node_171"
  bottom:"Node_169"
  layer_param {
    idx:171
    in_0 {name:"Node_169:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_0 {name:"Node_171:0",dtype:float32,shape:[1, 48, 35, 35]}
  }
}
layer {
  name:"Node_173"
  type:"const"
  top:"Node_173"
  layer_param {
    idx:173
    out_0 {name:"Node_173:0",dtype:float32,shape:[5, 5, 48, 64]}
  }
}
layer {
  name:"Node_174"
  type:"layout_transform"
  top:"Node_174"
  bottom:"Node_173"
  layer_param {
    idx:174
    in_0 {name:"Node_173:0",dtype:float32,shape:[5, 5, 48, 64]}
    out_0 {name:"Node_174:0",dtype:float32,shape:[64, 48, 5, 5]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_175"
  type:"nn_conv2d"
  top:"Node_175"
  bottom:"Node_171"
  bottom:"Node_174"
  layer_param {
    idx:175
    in_0 {name:"Node_171:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_174:0",dtype:float32,shape:[64, 48, 5, 5]}
    out_0 {name:"Node_175:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [2, 2, 2, 2], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [5, 5], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_176"
  type:"const"
  top:"Node_176"
  layer_param {
    idx:176
    out_0 {name:"Node_176:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_177"
  type:"const"
  top:"Node_177"
  layer_param {
    idx:177
    out_0 {name:"Node_177:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_178"
  type:"const"
  top:"Node_178"
  layer_param {
    idx:178
    out_0 {name:"Node_178:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_179"
  type:"const"
  top:"Node_179"
  layer_param {
    idx:179
    out_0 {name:"Node_179:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_180"
  type:"nn_batch_norm"
  top:"Node_180"
  bottom:"Node_175"
  bottom:"Node_176"
  bottom:"Node_177"
  bottom:"Node_178"
  bottom:"Node_179"
  layer_param {
    idx:180
    in_0 {name:"Node_175:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_176:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_177:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_178:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_179:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_180:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_180:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_180:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_182"
  type:"nn_relu"
  top:"Node_182"
  bottom:"Node_180"
  layer_param {
    idx:182
    in_0 {name:"Node_180:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_182:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_194"
  type:"const"
  top:"Node_194"
  layer_param {
    idx:194
    out_0 {name:"Node_194:0",dtype:float32,shape:[1, 1, 192, 64]}
  }
}
layer {
  name:"Node_195"
  type:"layout_transform"
  top:"Node_195"
  bottom:"Node_194"
  layer_param {
    idx:195
    in_0 {name:"Node_194:0",dtype:float32,shape:[1, 1, 192, 64]}
    out_0 {name:"Node_195:0",dtype:float32,shape:[64, 192, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_196"
  type:"nn_conv2d"
  top:"Node_196"
  bottom:"Node_142"
  bottom:"Node_195"
  layer_param {
    idx:196
    in_0 {name:"Node_142:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_195:0",dtype:float32,shape:[64, 192, 1, 1]}
    out_0 {name:"Node_196:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_197"
  type:"const"
  top:"Node_197"
  layer_param {
    idx:197
    out_0 {name:"Node_197:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_198"
  type:"const"
  top:"Node_198"
  layer_param {
    idx:198
    out_0 {name:"Node_198:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_199"
  type:"const"
  top:"Node_199"
  layer_param {
    idx:199
    out_0 {name:"Node_199:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_200"
  type:"const"
  top:"Node_200"
  layer_param {
    idx:200
    out_0 {name:"Node_200:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_201"
  type:"nn_batch_norm"
  top:"Node_201"
  bottom:"Node_196"
  bottom:"Node_197"
  bottom:"Node_198"
  bottom:"Node_199"
  bottom:"Node_200"
  layer_param {
    idx:201
    in_0 {name:"Node_196:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_197:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_198:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_199:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_200:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_201:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_201:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_201:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_203"
  type:"nn_relu"
  top:"Node_203"
  bottom:"Node_201"
  layer_param {
    idx:203
    in_0 {name:"Node_201:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_203:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_205"
  type:"const"
  top:"Node_205"
  layer_param {
    idx:205
    out_0 {name:"Node_205:0",dtype:float32,shape:[3, 3, 64, 96]}
  }
}
layer {
  name:"Node_206"
  type:"layout_transform"
  top:"Node_206"
  bottom:"Node_205"
  layer_param {
    idx:206
    in_0 {name:"Node_205:0",dtype:float32,shape:[3, 3, 64, 96]}
    out_0 {name:"Node_206:0",dtype:float32,shape:[96, 64, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_207"
  type:"nn_conv2d"
  top:"Node_207"
  bottom:"Node_203"
  bottom:"Node_206"
  layer_param {
    idx:207
    in_0 {name:"Node_203:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_206:0",dtype:float32,shape:[96, 64, 3, 3]}
    out_0 {name:"Node_207:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_208"
  type:"const"
  top:"Node_208"
  layer_param {
    idx:208
    out_0 {name:"Node_208:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_209"
  type:"const"
  top:"Node_209"
  layer_param {
    idx:209
    out_0 {name:"Node_209:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_210"
  type:"const"
  top:"Node_210"
  layer_param {
    idx:210
    out_0 {name:"Node_210:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_211"
  type:"const"
  top:"Node_211"
  layer_param {
    idx:211
    out_0 {name:"Node_211:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_212"
  type:"nn_batch_norm"
  top:"Node_212"
  bottom:"Node_207"
  bottom:"Node_208"
  bottom:"Node_209"
  bottom:"Node_210"
  bottom:"Node_211"
  layer_param {
    idx:212
    in_0 {name:"Node_207:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_208:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_209:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_210:0",dtype:float32,shape:[96]}
    in_4 {name:"Node_211:0",dtype:float32,shape:[96]}
    out_0 {name:"Node_212:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_1 {name:"Node_212:1",dtype:float32,shape:[96]}
    out_2 {name:"Node_212:2",dtype:float32,shape:[96]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_214"
  type:"nn_relu"
  top:"Node_214"
  bottom:"Node_212"
  layer_param {
    idx:214
    in_0 {name:"Node_212:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_0 {name:"Node_214:0",dtype:float32,shape:[1, 96, 35, 35]}
  }
}
layer {
  name:"Node_216"
  type:"const"
  top:"Node_216"
  layer_param {
    idx:216
    out_0 {name:"Node_216:0",dtype:float32,shape:[3, 3, 96, 96]}
  }
}
layer {
  name:"Node_217"
  type:"layout_transform"
  top:"Node_217"
  bottom:"Node_216"
  layer_param {
    idx:217
    in_0 {name:"Node_216:0",dtype:float32,shape:[3, 3, 96, 96]}
    out_0 {name:"Node_217:0",dtype:float32,shape:[96, 96, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_218"
  type:"nn_conv2d"
  top:"Node_218"
  bottom:"Node_214"
  bottom:"Node_217"
  layer_param {
    idx:218
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_217:0",dtype:float32,shape:[96, 96, 3, 3]}
    out_0 {name:"Node_218:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_219"
  type:"const"
  top:"Node_219"
  layer_param {
    idx:219
    out_0 {name:"Node_219:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_220"
  type:"const"
  top:"Node_220"
  layer_param {
    idx:220
    out_0 {name:"Node_220:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_221"
  type:"const"
  top:"Node_221"
  layer_param {
    idx:221
    out_0 {name:"Node_221:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_222"
  type:"const"
  top:"Node_222"
  layer_param {
    idx:222
    out_0 {name:"Node_222:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_223"
  type:"nn_batch_norm"
  top:"Node_223"
  bottom:"Node_218"
  bottom:"Node_219"
  bottom:"Node_220"
  bottom:"Node_221"
  bottom:"Node_222"
  layer_param {
    idx:223
    in_0 {name:"Node_218:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_219:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_220:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_221:0",dtype:float32,shape:[96]}
    in_4 {name:"Node_222:0",dtype:float32,shape:[96]}
    out_0 {name:"Node_223:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_1 {name:"Node_223:1",dtype:float32,shape:[96]}
    out_2 {name:"Node_223:2",dtype:float32,shape:[96]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_225"
  type:"nn_relu"
  top:"Node_225"
  bottom:"Node_223"
  layer_param {
    idx:225
    in_0 {name:"Node_223:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_0 {name:"Node_225:0",dtype:float32,shape:[1, 96, 35, 35]}
  }
}
layer {
  name:"Node_231"
  type:"nn_avg_pool2d"
  top:"Node_231"
  bottom:"Node_142"
  layer_param {
    idx:231
    in_0 {name:"Node_142:0",dtype:float32,shape:[1, 192, 35, 35]}
    out_0 {name:"Node_231:0",dtype:float32,shape:[1, 192, 35, 35]}
    attrs {'pool_size': [3, 3], 'strides': [1, 1], 'dilation': [1, 1], 'padding': [1, 1, 1, 1], 'layout': 'NCHW', 'ceil_mode': 0, 'count_include_pad': 0}
  }
}
layer {
  name:"Node_233"
  type:"const"
  top:"Node_233"
  layer_param {
    idx:233
    out_0 {name:"Node_233:0",dtype:float32,shape:[1, 1, 192, 32]}
  }
}
layer {
  name:"Node_234"
  type:"layout_transform"
  top:"Node_234"
  bottom:"Node_233"
  layer_param {
    idx:234
    in_0 {name:"Node_233:0",dtype:float32,shape:[1, 1, 192, 32]}
    out_0 {name:"Node_234:0",dtype:float32,shape:[32, 192, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_235"
  type:"nn_conv2d"
  top:"Node_235"
  bottom:"Node_231"
  bottom:"Node_234"
  layer_param {
    idx:235
    in_0 {name:"Node_231:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_234:0",dtype:float32,shape:[32, 192, 1, 1]}
    out_0 {name:"Node_235:0",dtype:float32,shape:[1, 32, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 32, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_236"
  type:"const"
  top:"Node_236"
  layer_param {
    idx:236
    out_0 {name:"Node_236:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_237"
  type:"const"
  top:"Node_237"
  layer_param {
    idx:237
    out_0 {name:"Node_237:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_238"
  type:"const"
  top:"Node_238"
  layer_param {
    idx:238
    out_0 {name:"Node_238:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_239"
  type:"const"
  top:"Node_239"
  layer_param {
    idx:239
    out_0 {name:"Node_239:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_240"
  type:"nn_batch_norm"
  top:"Node_240"
  bottom:"Node_235"
  bottom:"Node_236"
  bottom:"Node_237"
  bottom:"Node_238"
  bottom:"Node_239"
  layer_param {
    idx:240
    in_0 {name:"Node_235:0",dtype:float32,shape:[1, 32, 35, 35]}
    in_1 {name:"Node_236:0",dtype:float32,shape:[32]}
    in_2 {name:"Node_237:0",dtype:float32,shape:[32]}
    in_3 {name:"Node_238:0",dtype:float32,shape:[32]}
    in_4 {name:"Node_239:0",dtype:float32,shape:[32]}
    out_0 {name:"Node_240:0",dtype:float32,shape:[1, 32, 35, 35]}
    out_1 {name:"Node_240:1",dtype:float32,shape:[32]}
    out_2 {name:"Node_240:2",dtype:float32,shape:[32]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_242"
  type:"nn_relu"
  top:"Node_242"
  bottom:"Node_240"
  layer_param {
    idx:242
    in_0 {name:"Node_240:0",dtype:float32,shape:[1, 32, 35, 35]}
    out_0 {name:"Node_242:0",dtype:float32,shape:[1, 32, 35, 35]}
  }
}
layer {
  name:"Node_244"
  type:"concatenate"
  top:"Node_244"
  bottom:"Node_153"
  bottom:"Node_182"
  bottom:"Node_225"
  bottom:"Node_242"
  layer_param {
    idx:244
    in_0 {name:"Node_153:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_182:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_2 {name:"Node_225:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_3 {name:"Node_242:0",dtype:float32,shape:[1, 32, 35, 35]}
    out_0 {name:"Node_244:0",dtype:float32,shape:[1, 256, 35, 35]}
    attrs {'axis': 1}
  }
}
layer {
  name:"Node_246"
  type:"const"
  top:"Node_246"
  layer_param {
    idx:246
    out_0 {name:"Node_246:0",dtype:float32,shape:[1, 1, 256, 64]}
  }
}
layer {
  name:"Node_247"
  type:"layout_transform"
  top:"Node_247"
  bottom:"Node_246"
  layer_param {
    idx:247
    in_0 {name:"Node_246:0",dtype:float32,shape:[1, 1, 256, 64]}
    out_0 {name:"Node_247:0",dtype:float32,shape:[64, 256, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_248"
  type:"nn_conv2d"
  top:"Node_248"
  bottom:"Node_244"
  bottom:"Node_247"
  layer_param {
    idx:248
    in_0 {name:"Node_244:0",dtype:float32,shape:[1, 256, 35, 35]}
    in_1 {name:"Node_247:0",dtype:float32,shape:[64, 256, 1, 1]}
    out_0 {name:"Node_248:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_249"
  type:"const"
  top:"Node_249"
  layer_param {
    idx:249
    out_0 {name:"Node_249:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_250"
  type:"const"
  top:"Node_250"
  layer_param {
    idx:250
    out_0 {name:"Node_250:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_251"
  type:"const"
  top:"Node_251"
  layer_param {
    idx:251
    out_0 {name:"Node_251:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_252"
  type:"const"
  top:"Node_252"
  layer_param {
    idx:252
    out_0 {name:"Node_252:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_253"
  type:"nn_batch_norm"
  top:"Node_253"
  bottom:"Node_248"
  bottom:"Node_249"
  bottom:"Node_250"
  bottom:"Node_251"
  bottom:"Node_252"
  layer_param {
    idx:253
    in_0 {name:"Node_248:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_249:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_250:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_251:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_252:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_253:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_253:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_253:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_255"
  type:"nn_relu"
  top:"Node_255"
  bottom:"Node_253"
  layer_param {
    idx:255
    in_0 {name:"Node_253:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_255:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_264"
  type:"const"
  top:"Node_264"
  layer_param {
    idx:264
    out_0 {name:"Node_264:0",dtype:float32,shape:[1, 1, 256, 48]}
  }
}
layer {
  name:"Node_265"
  type:"layout_transform"
  top:"Node_265"
  bottom:"Node_264"
  layer_param {
    idx:265
    in_0 {name:"Node_264:0",dtype:float32,shape:[1, 1, 256, 48]}
    out_0 {name:"Node_265:0",dtype:float32,shape:[48, 256, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_266"
  type:"nn_conv2d"
  top:"Node_266"
  bottom:"Node_244"
  bottom:"Node_265"
  layer_param {
    idx:266
    in_0 {name:"Node_244:0",dtype:float32,shape:[1, 256, 35, 35]}
    in_1 {name:"Node_265:0",dtype:float32,shape:[48, 256, 1, 1]}
    out_0 {name:"Node_266:0",dtype:float32,shape:[1, 48, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 48, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_267"
  type:"const"
  top:"Node_267"
  layer_param {
    idx:267
    out_0 {name:"Node_267:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_268"
  type:"const"
  top:"Node_268"
  layer_param {
    idx:268
    out_0 {name:"Node_268:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_269"
  type:"const"
  top:"Node_269"
  layer_param {
    idx:269
    out_0 {name:"Node_269:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_270"
  type:"const"
  top:"Node_270"
  layer_param {
    idx:270
    out_0 {name:"Node_270:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_271"
  type:"nn_batch_norm"
  top:"Node_271"
  bottom:"Node_266"
  bottom:"Node_267"
  bottom:"Node_268"
  bottom:"Node_269"
  bottom:"Node_270"
  layer_param {
    idx:271
    in_0 {name:"Node_266:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_267:0",dtype:float32,shape:[48]}
    in_2 {name:"Node_268:0",dtype:float32,shape:[48]}
    in_3 {name:"Node_269:0",dtype:float32,shape:[48]}
    in_4 {name:"Node_270:0",dtype:float32,shape:[48]}
    out_0 {name:"Node_271:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_1 {name:"Node_271:1",dtype:float32,shape:[48]}
    out_2 {name:"Node_271:2",dtype:float32,shape:[48]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_273"
  type:"nn_relu"
  top:"Node_273"
  bottom:"Node_271"
  layer_param {
    idx:273
    in_0 {name:"Node_271:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_0 {name:"Node_273:0",dtype:float32,shape:[1, 48, 35, 35]}
  }
}
layer {
  name:"Node_275"
  type:"const"
  top:"Node_275"
  layer_param {
    idx:275
    out_0 {name:"Node_275:0",dtype:float32,shape:[5, 5, 48, 64]}
  }
}
layer {
  name:"Node_276"
  type:"layout_transform"
  top:"Node_276"
  bottom:"Node_275"
  layer_param {
    idx:276
    in_0 {name:"Node_275:0",dtype:float32,shape:[5, 5, 48, 64]}
    out_0 {name:"Node_276:0",dtype:float32,shape:[64, 48, 5, 5]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_277"
  type:"nn_conv2d"
  top:"Node_277"
  bottom:"Node_273"
  bottom:"Node_276"
  layer_param {
    idx:277
    in_0 {name:"Node_273:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_276:0",dtype:float32,shape:[64, 48, 5, 5]}
    out_0 {name:"Node_277:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [2, 2, 2, 2], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [5, 5], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_278"
  type:"const"
  top:"Node_278"
  layer_param {
    idx:278
    out_0 {name:"Node_278:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_279"
  type:"const"
  top:"Node_279"
  layer_param {
    idx:279
    out_0 {name:"Node_279:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_280"
  type:"const"
  top:"Node_280"
  layer_param {
    idx:280
    out_0 {name:"Node_280:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_281"
  type:"const"
  top:"Node_281"
  layer_param {
    idx:281
    out_0 {name:"Node_281:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_282"
  type:"nn_batch_norm"
  top:"Node_282"
  bottom:"Node_277"
  bottom:"Node_278"
  bottom:"Node_279"
  bottom:"Node_280"
  bottom:"Node_281"
  layer_param {
    idx:282
    in_0 {name:"Node_277:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_278:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_279:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_280:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_281:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_282:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_282:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_282:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_284"
  type:"nn_relu"
  top:"Node_284"
  bottom:"Node_282"
  layer_param {
    idx:284
    in_0 {name:"Node_282:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_284:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_296"
  type:"const"
  top:"Node_296"
  layer_param {
    idx:296
    out_0 {name:"Node_296:0",dtype:float32,shape:[1, 1, 256, 64]}
  }
}
layer {
  name:"Node_297"
  type:"layout_transform"
  top:"Node_297"
  bottom:"Node_296"
  layer_param {
    idx:297
    in_0 {name:"Node_296:0",dtype:float32,shape:[1, 1, 256, 64]}
    out_0 {name:"Node_297:0",dtype:float32,shape:[64, 256, 1, 1]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_298"
  type:"nn_conv2d"
  top:"Node_298"
  bottom:"Node_244"
  bottom:"Node_297"
  layer_param {
    idx:298
    in_0 {name:"Node_244:0",dtype:float32,shape:[1, 256, 35, 35]}
    in_1 {name:"Node_297:0",dtype:float32,shape:[64, 256, 1, 1]}
    out_0 {name:"Node_298:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_299"
  type:"const"
  top:"Node_299"
  layer_param {
    idx:299
    out_0 {name:"Node_299:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_300"
  type:"const"
  top:"Node_300"
  layer_param {
    idx:300
    out_0 {name:"Node_300:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_301"
  type:"const"
  top:"Node_301"
  layer_param {
    idx:301
    out_0 {name:"Node_301:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_302"
  type:"const"
  top:"Node_302"
  layer_param {
    idx:302
    out_0 {name:"Node_302:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_303"
  type:"nn_batch_norm"
  top:"Node_303"
  bottom:"Node_298"
  bottom:"Node_299"
  bottom:"Node_300"
  bottom:"Node_301"
  bottom:"Node_302"
  layer_param {
    idx:303
    in_0 {name:"Node_298:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_299:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_300:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_301:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_302:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_303:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_303:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_303:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_305"
  type:"nn_relu"
  top:"Node_305"
  bottom:"Node_303"
  layer_param {
    idx:305
    in_0 {name:"Node_303:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_305:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_307"
  type:"const"
  top:"Node_307"
  layer_param {
    idx:307
    out_0 {name:"Node_307:0",dtype:float32,shape:[3, 3, 64, 96]}
  }
}
layer {
  name:"Node_308"
  type:"layout_transform"
  top:"Node_308"
  bottom:"Node_307"
  layer_param {
    idx:308
    in_0 {name:"Node_307:0",dtype:float32,shape:[3, 3, 64, 96]}
    out_0 {name:"Node_308:0",dtype:float32,shape:[96, 64, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_309"
  type:"nn_conv2d"
  top:"Node_309"
  bottom:"Node_305"
  bottom:"Node_308"
  layer_param {
    idx:309
    in_0 {name:"Node_305:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_308:0",dtype:float32,shape:[96, 64, 3, 3]}
    out_0 {name:"Node_309:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_310"
  type:"const"
  top:"Node_310"
  layer_param {
    idx:310
    out_0 {name:"Node_310:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_311"
  type:"const"
  top:"Node_311"
  layer_param {
    idx:311
    out_0 {name:"Node_311:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_312"
  type:"const"
  top:"Node_312"
  layer_param {
    idx:312
    out_0 {name:"Node_312:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_313"
  type:"const"
  top:"Node_313"
  layer_param {
    idx:313
    out_0 {name:"Node_313:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_314"
  type:"nn_batch_norm"
  top:"Node_314"
  bottom:"Node_309"
  bottom:"Node_310"
  bottom:"Node_311"
  bottom:"Node_312"
  bottom:"Node_313"
  layer_param {
    idx:314
    in_0 {name:"Node_309:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_310:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_311:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_312:0",dtype:float32,shape:[96]}
    in_4 {name:"Node_313:0",dtype:float32,shape:[96]}
    out_0 {name:"Node_314:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_1 {name:"Node_314:1",dtype:float32,shape:[96]}
    out_2 {name:"Node_314:2",dtype:float32,shape:[96]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_316"
  type:"nn_relu"
  top:"Node_316"
  bottom:"Node_314"
  layer_param {
    idx:316
    in_0 {name:"Node_314:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_0 {name:"Node_316:0",dtype:float32,shape:[1, 96, 35, 35]}
  }
}
layer {
  name:"Node_318"
  type:"const"
  top:"Node_318"
  layer_param {
    idx:318
    out_0 {name:"Node_318:0",dtype:float32,shape:[3, 3, 96, 96]}
  }
}
layer {
  name:"Node_319"
  type:"layout_transform"
  top:"Node_319"
  bottom:"Node_318"
  layer_param {
    idx:319
    in_0 {name:"Node_318:0",dtype:float32,shape:[3, 3, 96, 96]}
    out_0 {name:"Node_319:0",dtype:float32,shape:[96, 96, 3, 3]}
    attrs {'src_layout': 'HWIO', 'dst_layout': 'OIHW'}
  }
}
layer {
  name:"Node_320"
  type:"nn_conv2d"
  top:"Node_320"
  bottom:"Node_316"
  bottom:"Node_319"
  layer_param {
    idx:320
    in_0 {name:"Node_316:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_319:0",dtype:float32,shape:[96, 96, 3, 3]}
    out_0 {name:"Node_320:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_321"
  type:"const"
  top:"Node_321"
  layer_param {
    idx:321
    out_0 {name:"Node_321:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_322"
  type:"const"
  top:"Node_322"
  layer_param {
    idx:322
    out_0 {name:"Node_322:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_323"
  type:"const"
  top:"Node_323"
  layer_param {
    idx:323
    out_0 {name:"Node_323:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_324"
  type:"const"
  top:"Node_324"
  layer_param {
    idx:324
    out_0 {name:"Node_324:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_325"
  type:"nn_batch_norm"
  top:"Node_325"
  bottom:"Node_320"
  bottom:"Node_321"
  bottom:"Node_322"
  bottom:"Node_323"
  bottom:"Node_324"
  layer_param {
    idx:325
    in_0 {name:"Node_320:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_321:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_322:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_323:0",dtype:float32,shape:[96]}
