name : "relay_ir"
layer {
  name:"tensorrt_0_i0"
  type:"input"
  top:"tensorrt_0_i0"
  layer_param {
    idx:0
    out_0 {name:"tensorrt_0_i0:0",dtype:float32,shape:[1, 299, 299, 3]}
  }
}
layer {
  name:"Node_75"
  type:"const"
  top:"Node_75"
  layer_param {
    idx:75
    out_0 {name:"Node_75:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_76"
  type:"subtract"
  top:"Node_76"
  bottom:"tensorrt_0_i0"
  bottom:"Node_75"
  layer_param {
    idx:76
    in_0 {name:"tensorrt_0_i0:0",dtype:float32,shape:[1, 299, 299, 3]}
    in_1 {name:"Node_75:0",dtype:float32,shape:[]}
    out_0 {name:"Node_76:0",dtype:float32,shape:[1, 299, 299, 3]}
  }
}
layer {
  name:"Node_77"
  type:"const"
  top:"Node_77"
  layer_param {
    idx:77
    out_0 {name:"Node_77:0",dtype:float32,shape:[]}
  }
}
layer {
  name:"Node_78"
  type:"multiply"
  top:"Node_78"
  bottom:"Node_76"
  bottom:"Node_77"
  layer_param {
    idx:78
    in_0 {name:"Node_76:0",dtype:float32,shape:[1, 299, 299, 3]}
    in_1 {name:"Node_77:0",dtype:float32,shape:[]}
    out_0 {name:"Node_78:0",dtype:float32,shape:[1, 299, 299, 3]}
  }
}
layer {
  name:"Node_79"
  type:"layout_transform"
  top:"Node_79"
  bottom:"Node_78"
  layer_param {
    idx:79
    in_0 {name:"Node_78:0",dtype:float32,shape:[1, 299, 299, 3]}
    out_0 {name:"Node_79:0",dtype:float32,shape:[1, 3, 299, 299]}
    attrs {'src_layout': 'NHWC', 'dst_layout': 'NCHW'}
  }
}
layer {
  name:"Node_80"
  type:"const"
  top:"Node_80"
  layer_param {
    idx:80
    out_0 {name:"Node_80:0",dtype:float32,shape:[32, 3, 3, 3]}
  }
}
layer {
  name:"Node_81"
  type:"nn_conv2d"
  top:"Node_81"
  bottom:"Node_79"
  bottom:"Node_80"
  layer_param {
    idx:81
    in_0 {name:"Node_79:0",dtype:float32,shape:[1, 3, 299, 299]}
    in_1 {name:"Node_80:0",dtype:float32,shape:[32, 3, 3, 3]}
    out_0 {name:"Node_81:0",dtype:float32,shape:[1, 32, 149, 149]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 32, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_82"
  type:"const"
  top:"Node_82"
  layer_param {
    idx:82
    out_0 {name:"Node_82:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_83"
  type:"const"
  top:"Node_83"
  layer_param {
    idx:83
    out_0 {name:"Node_83:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_84"
  type:"const"
  top:"Node_84"
  layer_param {
    idx:84
    out_0 {name:"Node_84:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_85"
  type:"const"
  top:"Node_85"
  layer_param {
    idx:85
    out_0 {name:"Node_85:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_86"
  type:"nn_batch_norm"
  top:"Node_86"
  bottom:"Node_81"
  bottom:"Node_82"
  bottom:"Node_83"
  bottom:"Node_84"
  bottom:"Node_85"
  layer_param {
    idx:86
    in_0 {name:"Node_81:0",dtype:float32,shape:[1, 32, 149, 149]}
    in_1 {name:"Node_82:0",dtype:float32,shape:[32]}
    in_2 {name:"Node_83:0",dtype:float32,shape:[32]}
    in_3 {name:"Node_84:0",dtype:float32,shape:[32]}
    in_4 {name:"Node_85:0",dtype:float32,shape:[32]}
    out_0 {name:"Node_86:0",dtype:float32,shape:[1, 32, 149, 149]}
    out_1 {name:"Node_86:1",dtype:float32,shape:[32]}
    out_2 {name:"Node_86:2",dtype:float32,shape:[32]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_88"
  type:"nn_relu"
  top:"Node_88"
  bottom:"Node_86"
  layer_param {
    idx:88
    in_0 {name:"Node_86:0",dtype:float32,shape:[1, 32, 149, 149]}
    out_0 {name:"Node_88:0",dtype:float32,shape:[1, 32, 149, 149]}
  }
}
layer {
  name:"Node_89"
  type:"const"
  top:"Node_89"
  layer_param {
    idx:89
    out_0 {name:"Node_89:0",dtype:float32,shape:[32, 32, 3, 3]}
  }
}
layer {
  name:"Node_90"
  type:"nn_conv2d"
  top:"Node_90"
  bottom:"Node_88"
  bottom:"Node_89"
  layer_param {
    idx:90
    in_0 {name:"Node_88:0",dtype:float32,shape:[1, 32, 149, 149]}
    in_1 {name:"Node_89:0",dtype:float32,shape:[32, 32, 3, 3]}
    out_0 {name:"Node_90:0",dtype:float32,shape:[1, 32, 147, 147]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 32, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_91"
  type:"const"
  top:"Node_91"
  layer_param {
    idx:91
    out_0 {name:"Node_91:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_92"
  type:"const"
  top:"Node_92"
  layer_param {
    idx:92
    out_0 {name:"Node_92:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_93"
  type:"const"
  top:"Node_93"
  layer_param {
    idx:93
    out_0 {name:"Node_93:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_94"
  type:"const"
  top:"Node_94"
  layer_param {
    idx:94
    out_0 {name:"Node_94:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_95"
  type:"nn_batch_norm"
  top:"Node_95"
  bottom:"Node_90"
  bottom:"Node_91"
  bottom:"Node_92"
  bottom:"Node_93"
  bottom:"Node_94"
  layer_param {
    idx:95
    in_0 {name:"Node_90:0",dtype:float32,shape:[1, 32, 147, 147]}
    in_1 {name:"Node_91:0",dtype:float32,shape:[32]}
    in_2 {name:"Node_92:0",dtype:float32,shape:[32]}
    in_3 {name:"Node_93:0",dtype:float32,shape:[32]}
    in_4 {name:"Node_94:0",dtype:float32,shape:[32]}
    out_0 {name:"Node_95:0",dtype:float32,shape:[1, 32, 147, 147]}
    out_1 {name:"Node_95:1",dtype:float32,shape:[32]}
    out_2 {name:"Node_95:2",dtype:float32,shape:[32]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_97"
  type:"nn_relu"
  top:"Node_97"
  bottom:"Node_95"
  layer_param {
    idx:97
    in_0 {name:"Node_95:0",dtype:float32,shape:[1, 32, 147, 147]}
    out_0 {name:"Node_97:0",dtype:float32,shape:[1, 32, 147, 147]}
  }
}
layer {
  name:"Node_98"
  type:"const"
  top:"Node_98"
  layer_param {
    idx:98
    out_0 {name:"Node_98:0",dtype:float32,shape:[64, 32, 3, 3]}
  }
}
layer {
  name:"Node_99"
  type:"nn_conv2d"
  top:"Node_99"
  bottom:"Node_97"
  bottom:"Node_98"
  layer_param {
    idx:99
    in_0 {name:"Node_97:0",dtype:float32,shape:[1, 32, 147, 147]}
    in_1 {name:"Node_98:0",dtype:float32,shape:[64, 32, 3, 3]}
    out_0 {name:"Node_99:0",dtype:float32,shape:[1, 64, 147, 147]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_100"
  type:"const"
  top:"Node_100"
  layer_param {
    idx:100
    out_0 {name:"Node_100:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_101"
  type:"const"
  top:"Node_101"
  layer_param {
    idx:101
    out_0 {name:"Node_101:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_102"
  type:"const"
  top:"Node_102"
  layer_param {
    idx:102
    out_0 {name:"Node_102:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_103"
  type:"const"
  top:"Node_103"
  layer_param {
    idx:103
    out_0 {name:"Node_103:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_104"
  type:"nn_batch_norm"
  top:"Node_104"
  bottom:"Node_99"
  bottom:"Node_100"
  bottom:"Node_101"
  bottom:"Node_102"
  bottom:"Node_103"
  layer_param {
    idx:104
    in_0 {name:"Node_99:0",dtype:float32,shape:[1, 64, 147, 147]}
    in_1 {name:"Node_100:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_101:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_102:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_103:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_104:0",dtype:float32,shape:[1, 64, 147, 147]}
    out_1 {name:"Node_104:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_104:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_106"
  type:"nn_relu"
  top:"Node_106"
  bottom:"Node_104"
  layer_param {
    idx:106
    in_0 {name:"Node_104:0",dtype:float32,shape:[1, 64, 147, 147]}
    out_0 {name:"Node_106:0",dtype:float32,shape:[1, 64, 147, 147]}
  }
}
layer {
  name:"Node_107"
  type:"nn_max_pool2d"
  top:"Node_107"
  bottom:"Node_106"
  layer_param {
    idx:107
    in_0 {name:"Node_106:0",dtype:float32,shape:[1, 64, 147, 147]}
    out_0 {name:"Node_107:0",dtype:float32,shape:[1, 64, 73, 73]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'dilation': [1, 1], 'padding': [0, 0, 0, 0], 'layout': 'NCHW', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_108"
  type:"const"
  top:"Node_108"
  layer_param {
    idx:108
    out_0 {name:"Node_108:0",dtype:float32,shape:[80, 64, 1, 1]}
  }
}
layer {
  name:"Node_109"
  type:"nn_conv2d"
  top:"Node_109"
  bottom:"Node_107"
  bottom:"Node_108"
  layer_param {
    idx:109
    in_0 {name:"Node_107:0",dtype:float32,shape:[1, 64, 73, 73]}
    in_1 {name:"Node_108:0",dtype:float32,shape:[80, 64, 1, 1]}
    out_0 {name:"Node_109:0",dtype:float32,shape:[1, 80, 73, 73]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 80, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_110"
  type:"const"
  top:"Node_110"
  layer_param {
    idx:110
    out_0 {name:"Node_110:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_111"
  type:"const"
  top:"Node_111"
  layer_param {
    idx:111
    out_0 {name:"Node_111:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_112"
  type:"const"
  top:"Node_112"
  layer_param {
    idx:112
    out_0 {name:"Node_112:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_113"
  type:"const"
  top:"Node_113"
  layer_param {
    idx:113
    out_0 {name:"Node_113:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"Node_114"
  type:"nn_batch_norm"
  top:"Node_114"
  bottom:"Node_109"
  bottom:"Node_110"
  bottom:"Node_111"
  bottom:"Node_112"
  bottom:"Node_113"
  layer_param {
    idx:114
    in_0 {name:"Node_109:0",dtype:float32,shape:[1, 80, 73, 73]}
    in_1 {name:"Node_110:0",dtype:float32,shape:[80]}
    in_2 {name:"Node_111:0",dtype:float32,shape:[80]}
    in_3 {name:"Node_112:0",dtype:float32,shape:[80]}
    in_4 {name:"Node_113:0",dtype:float32,shape:[80]}
    out_0 {name:"Node_114:0",dtype:float32,shape:[1, 80, 73, 73]}
    out_1 {name:"Node_114:1",dtype:float32,shape:[80]}
    out_2 {name:"Node_114:2",dtype:float32,shape:[80]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_116"
  type:"nn_relu"
  top:"Node_116"
  bottom:"Node_114"
  layer_param {
    idx:116
    in_0 {name:"Node_114:0",dtype:float32,shape:[1, 80, 73, 73]}
    out_0 {name:"Node_116:0",dtype:float32,shape:[1, 80, 73, 73]}
  }
}
layer {
  name:"Node_117"
  type:"const"
  top:"Node_117"
  layer_param {
    idx:117
    out_0 {name:"Node_117:0",dtype:float32,shape:[192, 80, 3, 3]}
  }
}
layer {
  name:"Node_118"
  type:"nn_conv2d"
  top:"Node_118"
  bottom:"Node_116"
  bottom:"Node_117"
  layer_param {
    idx:118
    in_0 {name:"Node_116:0",dtype:float32,shape:[1, 80, 73, 73]}
    in_1 {name:"Node_117:0",dtype:float32,shape:[192, 80, 3, 3]}
    out_0 {name:"Node_118:0",dtype:float32,shape:[1, 192, 71, 71]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 192, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_119"
  type:"const"
  top:"Node_119"
  layer_param {
    idx:119
    out_0 {name:"Node_119:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_120"
  type:"const"
  top:"Node_120"
  layer_param {
    idx:120
    out_0 {name:"Node_120:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_121"
  type:"const"
  top:"Node_121"
  layer_param {
    idx:121
    out_0 {name:"Node_121:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_122"
  type:"const"
  top:"Node_122"
  layer_param {
    idx:122
    out_0 {name:"Node_122:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"Node_123"
  type:"nn_batch_norm"
  top:"Node_123"
  bottom:"Node_118"
  bottom:"Node_119"
  bottom:"Node_120"
  bottom:"Node_121"
  bottom:"Node_122"
  layer_param {
    idx:123
    in_0 {name:"Node_118:0",dtype:float32,shape:[1, 192, 71, 71]}
    in_1 {name:"Node_119:0",dtype:float32,shape:[192]}
    in_2 {name:"Node_120:0",dtype:float32,shape:[192]}
    in_3 {name:"Node_121:0",dtype:float32,shape:[192]}
    in_4 {name:"Node_122:0",dtype:float32,shape:[192]}
    out_0 {name:"Node_123:0",dtype:float32,shape:[1, 192, 71, 71]}
    out_1 {name:"Node_123:1",dtype:float32,shape:[192]}
    out_2 {name:"Node_123:2",dtype:float32,shape:[192]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_125"
  type:"nn_relu"
  top:"Node_125"
  bottom:"Node_123"
  layer_param {
    idx:125
    in_0 {name:"Node_123:0",dtype:float32,shape:[1, 192, 71, 71]}
    out_0 {name:"Node_125:0",dtype:float32,shape:[1, 192, 71, 71]}
  }
}
layer {
  name:"Node_126"
  type:"nn_max_pool2d"
  top:"Node_126"
  bottom:"Node_125"
  layer_param {
    idx:126
    in_0 {name:"Node_125:0",dtype:float32,shape:[1, 192, 71, 71]}
    out_0 {name:"Node_126:0",dtype:float32,shape:[1, 192, 35, 35]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'dilation': [1, 1], 'padding': [0, 0, 0, 0], 'layout': 'NCHW', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_127"
  type:"const"
  top:"Node_127"
  layer_param {
    idx:127
    out_0 {name:"Node_127:0",dtype:float32,shape:[64, 192, 1, 1]}
  }
}
layer {
  name:"Node_128"
  type:"nn_conv2d"
  top:"Node_128"
  bottom:"Node_126"
  bottom:"Node_127"
  layer_param {
    idx:128
    in_0 {name:"Node_126:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_127:0",dtype:float32,shape:[64, 192, 1, 1]}
    out_0 {name:"Node_128:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_129"
  type:"const"
  top:"Node_129"
  layer_param {
    idx:129
    out_0 {name:"Node_129:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_130"
  type:"const"
  top:"Node_130"
  layer_param {
    idx:130
    out_0 {name:"Node_130:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_131"
  type:"const"
  top:"Node_131"
  layer_param {
    idx:131
    out_0 {name:"Node_131:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_132"
  type:"const"
  top:"Node_132"
  layer_param {
    idx:132
    out_0 {name:"Node_132:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_133"
  type:"nn_batch_norm"
  top:"Node_133"
  bottom:"Node_128"
  bottom:"Node_129"
  bottom:"Node_130"
  bottom:"Node_131"
  bottom:"Node_132"
  layer_param {
    idx:133
    in_0 {name:"Node_128:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_129:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_130:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_131:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_132:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_133:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_133:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_133:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_135"
  type:"nn_relu"
  top:"Node_135"
  bottom:"Node_133"
  layer_param {
    idx:135
    in_0 {name:"Node_133:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_135:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_143"
  type:"const"
  top:"Node_143"
  layer_param {
    idx:143
    out_0 {name:"Node_143:0",dtype:float32,shape:[48, 192, 1, 1]}
  }
}
layer {
  name:"Node_144"
  type:"nn_conv2d"
  top:"Node_144"
  bottom:"Node_126"
  bottom:"Node_143"
  layer_param {
    idx:144
    in_0 {name:"Node_126:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_143:0",dtype:float32,shape:[48, 192, 1, 1]}
    out_0 {name:"Node_144:0",dtype:float32,shape:[1, 48, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 48, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_145"
  type:"const"
  top:"Node_145"
  layer_param {
    idx:145
    out_0 {name:"Node_145:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_146"
  type:"const"
  top:"Node_146"
  layer_param {
    idx:146
    out_0 {name:"Node_146:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_147"
  type:"const"
  top:"Node_147"
  layer_param {
    idx:147
    out_0 {name:"Node_147:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_148"
  type:"const"
  top:"Node_148"
  layer_param {
    idx:148
    out_0 {name:"Node_148:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_149"
  type:"nn_batch_norm"
  top:"Node_149"
  bottom:"Node_144"
  bottom:"Node_145"
  bottom:"Node_146"
  bottom:"Node_147"
  bottom:"Node_148"
  layer_param {
    idx:149
    in_0 {name:"Node_144:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_145:0",dtype:float32,shape:[48]}
    in_2 {name:"Node_146:0",dtype:float32,shape:[48]}
    in_3 {name:"Node_147:0",dtype:float32,shape:[48]}
    in_4 {name:"Node_148:0",dtype:float32,shape:[48]}
    out_0 {name:"Node_149:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_1 {name:"Node_149:1",dtype:float32,shape:[48]}
    out_2 {name:"Node_149:2",dtype:float32,shape:[48]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_151"
  type:"nn_relu"
  top:"Node_151"
  bottom:"Node_149"
  layer_param {
    idx:151
    in_0 {name:"Node_149:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_0 {name:"Node_151:0",dtype:float32,shape:[1, 48, 35, 35]}
  }
}
layer {
  name:"Node_152"
  type:"const"
  top:"Node_152"
  layer_param {
    idx:152
    out_0 {name:"Node_152:0",dtype:float32,shape:[64, 48, 5, 5]}
  }
}
layer {
  name:"Node_153"
  type:"nn_conv2d"
  top:"Node_153"
  bottom:"Node_151"
  bottom:"Node_152"
  layer_param {
    idx:153
    in_0 {name:"Node_151:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_152:0",dtype:float32,shape:[64, 48, 5, 5]}
    out_0 {name:"Node_153:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [2, 2, 2, 2], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [5, 5], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_154"
  type:"const"
  top:"Node_154"
  layer_param {
    idx:154
    out_0 {name:"Node_154:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_155"
  type:"const"
  top:"Node_155"
  layer_param {
    idx:155
    out_0 {name:"Node_155:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_156"
  type:"const"
  top:"Node_156"
  layer_param {
    idx:156
    out_0 {name:"Node_156:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_157"
  type:"const"
  top:"Node_157"
  layer_param {
    idx:157
    out_0 {name:"Node_157:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_158"
  type:"nn_batch_norm"
  top:"Node_158"
  bottom:"Node_153"
  bottom:"Node_154"
  bottom:"Node_155"
  bottom:"Node_156"
  bottom:"Node_157"
  layer_param {
    idx:158
    in_0 {name:"Node_153:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_154:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_155:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_156:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_157:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_158:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_158:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_158:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_160"
  type:"nn_relu"
  top:"Node_160"
  bottom:"Node_158"
  layer_param {
    idx:160
    in_0 {name:"Node_158:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_160:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_171"
  type:"const"
  top:"Node_171"
  layer_param {
    idx:171
    out_0 {name:"Node_171:0",dtype:float32,shape:[64, 192, 1, 1]}
  }
}
layer {
  name:"Node_172"
  type:"nn_conv2d"
  top:"Node_172"
  bottom:"Node_126"
  bottom:"Node_171"
  layer_param {
    idx:172
    in_0 {name:"Node_126:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_171:0",dtype:float32,shape:[64, 192, 1, 1]}
    out_0 {name:"Node_172:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_173"
  type:"const"
  top:"Node_173"
  layer_param {
    idx:173
    out_0 {name:"Node_173:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_174"
  type:"const"
  top:"Node_174"
  layer_param {
    idx:174
    out_0 {name:"Node_174:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_175"
  type:"const"
  top:"Node_175"
  layer_param {
    idx:175
    out_0 {name:"Node_175:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_176"
  type:"const"
  top:"Node_176"
  layer_param {
    idx:176
    out_0 {name:"Node_176:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_177"
  type:"nn_batch_norm"
  top:"Node_177"
  bottom:"Node_172"
  bottom:"Node_173"
  bottom:"Node_174"
  bottom:"Node_175"
  bottom:"Node_176"
  layer_param {
    idx:177
    in_0 {name:"Node_172:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_173:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_174:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_175:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_176:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_177:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_177:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_177:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_179"
  type:"nn_relu"
  top:"Node_179"
  bottom:"Node_177"
  layer_param {
    idx:179
    in_0 {name:"Node_177:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_179:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_180"
  type:"const"
  top:"Node_180"
  layer_param {
    idx:180
    out_0 {name:"Node_180:0",dtype:float32,shape:[96, 64, 3, 3]}
  }
}
layer {
  name:"Node_181"
  type:"nn_conv2d"
  top:"Node_181"
  bottom:"Node_179"
  bottom:"Node_180"
  layer_param {
    idx:181
    in_0 {name:"Node_179:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_180:0",dtype:float32,shape:[96, 64, 3, 3]}
    out_0 {name:"Node_181:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_182"
  type:"const"
  top:"Node_182"
  layer_param {
    idx:182
    out_0 {name:"Node_182:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_183"
  type:"const"
  top:"Node_183"
  layer_param {
    idx:183
    out_0 {name:"Node_183:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_184"
  type:"const"
  top:"Node_184"
  layer_param {
    idx:184
    out_0 {name:"Node_184:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_185"
  type:"const"
  top:"Node_185"
  layer_param {
    idx:185
    out_0 {name:"Node_185:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_186"
  type:"nn_batch_norm"
  top:"Node_186"
  bottom:"Node_181"
  bottom:"Node_182"
  bottom:"Node_183"
  bottom:"Node_184"
  bottom:"Node_185"
  layer_param {
    idx:186
    in_0 {name:"Node_181:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_182:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_183:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_184:0",dtype:float32,shape:[96]}
    in_4 {name:"Node_185:0",dtype:float32,shape:[96]}
    out_0 {name:"Node_186:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_1 {name:"Node_186:1",dtype:float32,shape:[96]}
    out_2 {name:"Node_186:2",dtype:float32,shape:[96]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_188"
  type:"nn_relu"
  top:"Node_188"
  bottom:"Node_186"
  layer_param {
    idx:188
    in_0 {name:"Node_186:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_0 {name:"Node_188:0",dtype:float32,shape:[1, 96, 35, 35]}
  }
}
layer {
  name:"Node_189"
  type:"const"
  top:"Node_189"
  layer_param {
    idx:189
    out_0 {name:"Node_189:0",dtype:float32,shape:[96, 96, 3, 3]}
  }
}
layer {
  name:"Node_190"
  type:"nn_conv2d"
  top:"Node_190"
  bottom:"Node_188"
  bottom:"Node_189"
  layer_param {
    idx:190
    in_0 {name:"Node_188:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_189:0",dtype:float32,shape:[96, 96, 3, 3]}
    out_0 {name:"Node_190:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_191"
  type:"const"
  top:"Node_191"
  layer_param {
    idx:191
    out_0 {name:"Node_191:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_192"
  type:"const"
  top:"Node_192"
  layer_param {
    idx:192
    out_0 {name:"Node_192:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_193"
  type:"const"
  top:"Node_193"
  layer_param {
    idx:193
    out_0 {name:"Node_193:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_194"
  type:"const"
  top:"Node_194"
  layer_param {
    idx:194
    out_0 {name:"Node_194:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_195"
  type:"nn_batch_norm"
  top:"Node_195"
  bottom:"Node_190"
  bottom:"Node_191"
  bottom:"Node_192"
  bottom:"Node_193"
  bottom:"Node_194"
  layer_param {
    idx:195
    in_0 {name:"Node_190:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_191:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_192:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_193:0",dtype:float32,shape:[96]}
    in_4 {name:"Node_194:0",dtype:float32,shape:[96]}
    out_0 {name:"Node_195:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_1 {name:"Node_195:1",dtype:float32,shape:[96]}
    out_2 {name:"Node_195:2",dtype:float32,shape:[96]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_197"
  type:"nn_relu"
  top:"Node_197"
  bottom:"Node_195"
  layer_param {
    idx:197
    in_0 {name:"Node_195:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_0 {name:"Node_197:0",dtype:float32,shape:[1, 96, 35, 35]}
  }
}
layer {
  name:"Node_203"
  type:"nn_avg_pool2d"
  top:"Node_203"
  bottom:"Node_126"
  layer_param {
    idx:203
    in_0 {name:"Node_126:0",dtype:float32,shape:[1, 192, 35, 35]}
    out_0 {name:"Node_203:0",dtype:float32,shape:[1, 192, 35, 35]}
    attrs {'pool_size': [3, 3], 'strides': [1, 1], 'dilation': [1, 1], 'padding': [1, 1, 1, 1], 'layout': 'NCHW', 'ceil_mode': 0, 'count_include_pad': 0}
  }
}
layer {
  name:"Node_204"
  type:"const"
  top:"Node_204"
  layer_param {
    idx:204
    out_0 {name:"Node_204:0",dtype:float32,shape:[32, 192, 1, 1]}
  }
}
layer {
  name:"Node_205"
  type:"nn_conv2d"
  top:"Node_205"
  bottom:"Node_203"
  bottom:"Node_204"
  layer_param {
    idx:205
    in_0 {name:"Node_203:0",dtype:float32,shape:[1, 192, 35, 35]}
    in_1 {name:"Node_204:0",dtype:float32,shape:[32, 192, 1, 1]}
    out_0 {name:"Node_205:0",dtype:float32,shape:[1, 32, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 32, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_206"
  type:"const"
  top:"Node_206"
  layer_param {
    idx:206
    out_0 {name:"Node_206:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_207"
  type:"const"
  top:"Node_207"
  layer_param {
    idx:207
    out_0 {name:"Node_207:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_208"
  type:"const"
  top:"Node_208"
  layer_param {
    idx:208
    out_0 {name:"Node_208:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_209"
  type:"const"
  top:"Node_209"
  layer_param {
    idx:209
    out_0 {name:"Node_209:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"Node_210"
  type:"nn_batch_norm"
  top:"Node_210"
  bottom:"Node_205"
  bottom:"Node_206"
  bottom:"Node_207"
  bottom:"Node_208"
  bottom:"Node_209"
  layer_param {
    idx:210
    in_0 {name:"Node_205:0",dtype:float32,shape:[1, 32, 35, 35]}
    in_1 {name:"Node_206:0",dtype:float32,shape:[32]}
    in_2 {name:"Node_207:0",dtype:float32,shape:[32]}
    in_3 {name:"Node_208:0",dtype:float32,shape:[32]}
    in_4 {name:"Node_209:0",dtype:float32,shape:[32]}
    out_0 {name:"Node_210:0",dtype:float32,shape:[1, 32, 35, 35]}
    out_1 {name:"Node_210:1",dtype:float32,shape:[32]}
    out_2 {name:"Node_210:2",dtype:float32,shape:[32]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_212"
  type:"nn_relu"
  top:"Node_212"
  bottom:"Node_210"
  layer_param {
    idx:212
    in_0 {name:"Node_210:0",dtype:float32,shape:[1, 32, 35, 35]}
    out_0 {name:"Node_212:0",dtype:float32,shape:[1, 32, 35, 35]}
  }
}
layer {
  name:"Node_214"
  type:"concatenate"
  top:"Node_214"
  bottom:"Node_135"
  bottom:"Node_160"
  bottom:"Node_197"
  bottom:"Node_212"
  layer_param {
    idx:214
    in_0 {name:"Node_135:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_160:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_2 {name:"Node_197:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_3 {name:"Node_212:0",dtype:float32,shape:[1, 32, 35, 35]}
    out_0 {name:"Node_214:0",dtype:float32,shape:[1, 256, 35, 35]}
    attrs {'axis': 1}
  }
}
layer {
  name:"Node_215"
  type:"const"
  top:"Node_215"
  layer_param {
    idx:215
    out_0 {name:"Node_215:0",dtype:float32,shape:[64, 256, 1, 1]}
  }
}
layer {
  name:"Node_216"
  type:"nn_conv2d"
  top:"Node_216"
  bottom:"Node_214"
  bottom:"Node_215"
  layer_param {
    idx:216
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 256, 35, 35]}
    in_1 {name:"Node_215:0",dtype:float32,shape:[64, 256, 1, 1]}
    out_0 {name:"Node_216:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_217"
  type:"const"
  top:"Node_217"
  layer_param {
    idx:217
    out_0 {name:"Node_217:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_218"
  type:"const"
  top:"Node_218"
  layer_param {
    idx:218
    out_0 {name:"Node_218:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_219"
  type:"const"
  top:"Node_219"
  layer_param {
    idx:219
    out_0 {name:"Node_219:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_220"
  type:"const"
  top:"Node_220"
  layer_param {
    idx:220
    out_0 {name:"Node_220:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_221"
  type:"nn_batch_norm"
  top:"Node_221"
  bottom:"Node_216"
  bottom:"Node_217"
  bottom:"Node_218"
  bottom:"Node_219"
  bottom:"Node_220"
  layer_param {
    idx:221
    in_0 {name:"Node_216:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_217:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_218:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_219:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_220:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_221:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_221:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_221:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_223"
  type:"nn_relu"
  top:"Node_223"
  bottom:"Node_221"
  layer_param {
    idx:223
    in_0 {name:"Node_221:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_223:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_231"
  type:"const"
  top:"Node_231"
  layer_param {
    idx:231
    out_0 {name:"Node_231:0",dtype:float32,shape:[48, 256, 1, 1]}
  }
}
layer {
  name:"Node_232"
  type:"nn_conv2d"
  top:"Node_232"
  bottom:"Node_214"
  bottom:"Node_231"
  layer_param {
    idx:232
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 256, 35, 35]}
    in_1 {name:"Node_231:0",dtype:float32,shape:[48, 256, 1, 1]}
    out_0 {name:"Node_232:0",dtype:float32,shape:[1, 48, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 48, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_233"
  type:"const"
  top:"Node_233"
  layer_param {
    idx:233
    out_0 {name:"Node_233:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_234"
  type:"const"
  top:"Node_234"
  layer_param {
    idx:234
    out_0 {name:"Node_234:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_235"
  type:"const"
  top:"Node_235"
  layer_param {
    idx:235
    out_0 {name:"Node_235:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_236"
  type:"const"
  top:"Node_236"
  layer_param {
    idx:236
    out_0 {name:"Node_236:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"Node_237"
  type:"nn_batch_norm"
  top:"Node_237"
  bottom:"Node_232"
  bottom:"Node_233"
  bottom:"Node_234"
  bottom:"Node_235"
  bottom:"Node_236"
  layer_param {
    idx:237
    in_0 {name:"Node_232:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_233:0",dtype:float32,shape:[48]}
    in_2 {name:"Node_234:0",dtype:float32,shape:[48]}
    in_3 {name:"Node_235:0",dtype:float32,shape:[48]}
    in_4 {name:"Node_236:0",dtype:float32,shape:[48]}
    out_0 {name:"Node_237:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_1 {name:"Node_237:1",dtype:float32,shape:[48]}
    out_2 {name:"Node_237:2",dtype:float32,shape:[48]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_239"
  type:"nn_relu"
  top:"Node_239"
  bottom:"Node_237"
  layer_param {
    idx:239
    in_0 {name:"Node_237:0",dtype:float32,shape:[1, 48, 35, 35]}
    out_0 {name:"Node_239:0",dtype:float32,shape:[1, 48, 35, 35]}
  }
}
layer {
  name:"Node_240"
  type:"const"
  top:"Node_240"
  layer_param {
    idx:240
    out_0 {name:"Node_240:0",dtype:float32,shape:[64, 48, 5, 5]}
  }
}
layer {
  name:"Node_241"
  type:"nn_conv2d"
  top:"Node_241"
  bottom:"Node_239"
  bottom:"Node_240"
  layer_param {
    idx:241
    in_0 {name:"Node_239:0",dtype:float32,shape:[1, 48, 35, 35]}
    in_1 {name:"Node_240:0",dtype:float32,shape:[64, 48, 5, 5]}
    out_0 {name:"Node_241:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [2, 2, 2, 2], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [5, 5], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_242"
  type:"const"
  top:"Node_242"
  layer_param {
    idx:242
    out_0 {name:"Node_242:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_243"
  type:"const"
  top:"Node_243"
  layer_param {
    idx:243
    out_0 {name:"Node_243:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_244"
  type:"const"
  top:"Node_244"
  layer_param {
    idx:244
    out_0 {name:"Node_244:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_245"
  type:"const"
  top:"Node_245"
  layer_param {
    idx:245
    out_0 {name:"Node_245:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_246"
  type:"nn_batch_norm"
  top:"Node_246"
  bottom:"Node_241"
  bottom:"Node_242"
  bottom:"Node_243"
  bottom:"Node_244"
  bottom:"Node_245"
  layer_param {
    idx:246
    in_0 {name:"Node_241:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_242:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_243:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_244:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_245:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_246:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_246:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_246:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_248"
  type:"nn_relu"
  top:"Node_248"
  bottom:"Node_246"
  layer_param {
    idx:248
    in_0 {name:"Node_246:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_248:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_259"
  type:"const"
  top:"Node_259"
  layer_param {
    idx:259
    out_0 {name:"Node_259:0",dtype:float32,shape:[64, 256, 1, 1]}
  }
}
layer {
  name:"Node_260"
  type:"nn_conv2d"
  top:"Node_260"
  bottom:"Node_214"
  bottom:"Node_259"
  layer_param {
    idx:260
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 256, 35, 35]}
    in_1 {name:"Node_259:0",dtype:float32,shape:[64, 256, 1, 1]}
    out_0 {name:"Node_260:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_261"
  type:"const"
  top:"Node_261"
  layer_param {
    idx:261
    out_0 {name:"Node_261:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_262"
  type:"const"
  top:"Node_262"
  layer_param {
    idx:262
    out_0 {name:"Node_262:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_263"
  type:"const"
  top:"Node_263"
  layer_param {
    idx:263
    out_0 {name:"Node_263:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_264"
  type:"const"
  top:"Node_264"
  layer_param {
    idx:264
    out_0 {name:"Node_264:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_265"
  type:"nn_batch_norm"
  top:"Node_265"
  bottom:"Node_260"
  bottom:"Node_261"
  bottom:"Node_262"
  bottom:"Node_263"
  bottom:"Node_264"
  layer_param {
    idx:265
    in_0 {name:"Node_260:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_261:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_262:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_263:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_264:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_265:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_265:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_265:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_267"
  type:"nn_relu"
  top:"Node_267"
  bottom:"Node_265"
  layer_param {
    idx:267
    in_0 {name:"Node_265:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_267:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_268"
  type:"const"
  top:"Node_268"
  layer_param {
    idx:268
    out_0 {name:"Node_268:0",dtype:float32,shape:[96, 64, 3, 3]}
  }
}
layer {
  name:"Node_269"
  type:"nn_conv2d"
  top:"Node_269"
  bottom:"Node_267"
  bottom:"Node_268"
  layer_param {
    idx:269
    in_0 {name:"Node_267:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_268:0",dtype:float32,shape:[96, 64, 3, 3]}
    out_0 {name:"Node_269:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_270"
  type:"const"
  top:"Node_270"
  layer_param {
    idx:270
    out_0 {name:"Node_270:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_271"
  type:"const"
  top:"Node_271"
  layer_param {
    idx:271
    out_0 {name:"Node_271:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_272"
  type:"const"
  top:"Node_272"
  layer_param {
    idx:272
    out_0 {name:"Node_272:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_273"
  type:"const"
  top:"Node_273"
  layer_param {
    idx:273
    out_0 {name:"Node_273:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_274"
  type:"nn_batch_norm"
  top:"Node_274"
  bottom:"Node_269"
  bottom:"Node_270"
  bottom:"Node_271"
  bottom:"Node_272"
  bottom:"Node_273"
  layer_param {
    idx:274
    in_0 {name:"Node_269:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_270:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_271:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_272:0",dtype:float32,shape:[96]}
    in_4 {name:"Node_273:0",dtype:float32,shape:[96]}
    out_0 {name:"Node_274:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_1 {name:"Node_274:1",dtype:float32,shape:[96]}
    out_2 {name:"Node_274:2",dtype:float32,shape:[96]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_276"
  type:"nn_relu"
  top:"Node_276"
  bottom:"Node_274"
  layer_param {
    idx:276
    in_0 {name:"Node_274:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_0 {name:"Node_276:0",dtype:float32,shape:[1, 96, 35, 35]}
  }
}
layer {
  name:"Node_277"
  type:"const"
  top:"Node_277"
  layer_param {
    idx:277
    out_0 {name:"Node_277:0",dtype:float32,shape:[96, 96, 3, 3]}
  }
}
layer {
  name:"Node_278"
  type:"nn_conv2d"
  top:"Node_278"
  bottom:"Node_276"
  bottom:"Node_277"
  layer_param {
    idx:278
    in_0 {name:"Node_276:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_277:0",dtype:float32,shape:[96, 96, 3, 3]}
    out_0 {name:"Node_278:0",dtype:float32,shape:[1, 96, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 96, 'kernel_size': [3, 3], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_279"
  type:"const"
  top:"Node_279"
  layer_param {
    idx:279
    out_0 {name:"Node_279:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_280"
  type:"const"
  top:"Node_280"
  layer_param {
    idx:280
    out_0 {name:"Node_280:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_281"
  type:"const"
  top:"Node_281"
  layer_param {
    idx:281
    out_0 {name:"Node_281:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_282"
  type:"const"
  top:"Node_282"
  layer_param {
    idx:282
    out_0 {name:"Node_282:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"Node_283"
  type:"nn_batch_norm"
  top:"Node_283"
  bottom:"Node_278"
  bottom:"Node_279"
  bottom:"Node_280"
  bottom:"Node_281"
  bottom:"Node_282"
  layer_param {
    idx:283
    in_0 {name:"Node_278:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_1 {name:"Node_279:0",dtype:float32,shape:[96]}
    in_2 {name:"Node_280:0",dtype:float32,shape:[96]}
    in_3 {name:"Node_281:0",dtype:float32,shape:[96]}
    in_4 {name:"Node_282:0",dtype:float32,shape:[96]}
    out_0 {name:"Node_283:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_1 {name:"Node_283:1",dtype:float32,shape:[96]}
    out_2 {name:"Node_283:2",dtype:float32,shape:[96]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_285"
  type:"nn_relu"
  top:"Node_285"
  bottom:"Node_283"
  layer_param {
    idx:285
    in_0 {name:"Node_283:0",dtype:float32,shape:[1, 96, 35, 35]}
    out_0 {name:"Node_285:0",dtype:float32,shape:[1, 96, 35, 35]}
  }
}
layer {
  name:"Node_291"
  type:"nn_avg_pool2d"
  top:"Node_291"
  bottom:"Node_214"
  layer_param {
    idx:291
    in_0 {name:"Node_214:0",dtype:float32,shape:[1, 256, 35, 35]}
    out_0 {name:"Node_291:0",dtype:float32,shape:[1, 256, 35, 35]}
    attrs {'pool_size': [3, 3], 'strides': [1, 1], 'dilation': [1, 1], 'padding': [1, 1, 1, 1], 'layout': 'NCHW', 'ceil_mode': 0, 'count_include_pad': 0}
  }
}
layer {
  name:"Node_292"
  type:"const"
  top:"Node_292"
  layer_param {
    idx:292
    out_0 {name:"Node_292:0",dtype:float32,shape:[64, 256, 1, 1]}
  }
}
layer {
  name:"Node_293"
  type:"nn_conv2d"
  top:"Node_293"
  bottom:"Node_291"
  bottom:"Node_292"
  layer_param {
    idx:293
    in_0 {name:"Node_291:0",dtype:float32,shape:[1, 256, 35, 35]}
    in_1 {name:"Node_292:0",dtype:float32,shape:[64, 256, 1, 1]}
    out_0 {name:"Node_293:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_294"
  type:"const"
  top:"Node_294"
  layer_param {
    idx:294
    out_0 {name:"Node_294:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_295"
  type:"const"
  top:"Node_295"
  layer_param {
    idx:295
    out_0 {name:"Node_295:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_296"
  type:"const"
  top:"Node_296"
  layer_param {
    idx:296
    out_0 {name:"Node_296:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_297"
  type:"const"
  top:"Node_297"
  layer_param {
    idx:297
    out_0 {name:"Node_297:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_298"
  type:"nn_batch_norm"
  top:"Node_298"
  bottom:"Node_293"
  bottom:"Node_294"
  bottom:"Node_295"
  bottom:"Node_296"
  bottom:"Node_297"
  layer_param {
    idx:298
    in_0 {name:"Node_293:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_294:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_295:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_296:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_297:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_298:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_298:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_298:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_300"
  type:"nn_relu"
  top:"Node_300"
  bottom:"Node_298"
  layer_param {
    idx:300
    in_0 {name:"Node_298:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_300:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_302"
  type:"concatenate"
  top:"Node_302"
  bottom:"Node_223"
  bottom:"Node_248"
  bottom:"Node_285"
  bottom:"Node_300"
  layer_param {
    idx:302
    in_0 {name:"Node_223:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_248:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_2 {name:"Node_285:0",dtype:float32,shape:[1, 96, 35, 35]}
    in_3 {name:"Node_300:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_302:0",dtype:float32,shape:[1, 288, 35, 35]}
    attrs {'axis': 1}
  }
}
layer {
  name:"Node_303"
  type:"const"
  top:"Node_303"
  layer_param {
    idx:303
    out_0 {name:"Node_303:0",dtype:float32,shape:[64, 288, 1, 1]}
  }
}
layer {
  name:"Node_304"
  type:"nn_conv2d"
  top:"Node_304"
  bottom:"Node_302"
  bottom:"Node_303"
  layer_param {
    idx:304
    in_0 {name:"Node_302:0",dtype:float32,shape:[1, 288, 35, 35]}
    in_1 {name:"Node_303:0",dtype:float32,shape:[64, 288, 1, 1]}
    out_0 {name:"Node_304:0",dtype:float32,shape:[1, 64, 35, 35]}
    attrs {'strides': [1, 1], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [1, 1], 'data_layout': 'NCHW', 'kernel_layout': 'OIHW', 'out_layout': '', 'out_dtype': ''}
  }
}
layer {
  name:"Node_305"
  type:"const"
  top:"Node_305"
  layer_param {
    idx:305
    out_0 {name:"Node_305:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_306"
  type:"const"
  top:"Node_306"
  layer_param {
    idx:306
    out_0 {name:"Node_306:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_307"
  type:"const"
  top:"Node_307"
  layer_param {
    idx:307
    out_0 {name:"Node_307:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_308"
  type:"const"
  top:"Node_308"
  layer_param {
    idx:308
    out_0 {name:"Node_308:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"Node_309"
  type:"nn_batch_norm"
  top:"Node_309"
  bottom:"Node_304"
  bottom:"Node_305"
  bottom:"Node_306"
  bottom:"Node_307"
  bottom:"Node_308"
  layer_param {
    idx:309
    in_0 {name:"Node_304:0",dtype:float32,shape:[1, 64, 35, 35]}
    in_1 {name:"Node_305:0",dtype:float32,shape:[64]}
    in_2 {name:"Node_306:0",dtype:float32,shape:[64]}
    in_3 {name:"Node_307:0",dtype:float32,shape:[64]}
    in_4 {name:"Node_308:0",dtype:float32,shape:[64]}
    out_0 {name:"Node_309:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_1 {name:"Node_309:1",dtype:float32,shape:[64]}
    out_2 {name:"Node_309:2",dtype:float32,shape:[64]}
    attrs {'axis': 1, 'epsilon': 0.0010000000474974513, 'center': 1, 'scale': 0}
  }
}
layer {
  name:"Node_311"
  type:"nn_relu"
  top:"Node_311"
  bottom:"Node_309"
  layer_param {
    idx:311
    in_0 {name:"Node_309:0",dtype:float32,shape:[1, 64, 35, 35]}
    out_0 {name:"Node_311:0",dtype:float32,shape:[1, 64, 35, 35]}
  }
}
layer {
  name:"Node_319"
  type:"const"
  top:"Node_319"
  layer_param {
    idx:319
    out_0 {name:"Node_319:0",dtype:float32,shape:[48, 288, 1, 1]}
  }
}
layer {
  name:"Node_320"
  type:"nn_conv2d"
  top:"Node_320"
  bottom:"Node_302"
  bottom:"Node_319"
  layer_param {
    idx:320
    in_0 {name:"Node_302:0",dtype:float32,shape:[1, 288, 35, 35]}
    in_1 {name:"Node_319:0",dtype:float32,shape:[48, 288, 1, 1]}
    out_0 {name:"Node_320:0",dtype:float32,shape:[1, 48, 35, 35]}
