name : "relay_ir"
layer {
  name:"DecodeJpeg/contents"
  type:"input"
  top:"DecodeJpeg/contents"
  layer_param {
    idx:0
    out_0 {name:"DecodeJpeg/contents:0",dtype:uint8,shape:[299, 299, 3]}
  }
}
layer {
  name:"conv/conv2d_params"
  type:"input"
  top:"conv/conv2d_params"
  layer_param {
    idx:1
    out_0 {name:"conv/conv2d_params:0",dtype:float32,shape:[3, 3, 3, 32]}
  }
}
layer {
  name:"conv/batchnorm/gamma"
  type:"input"
  top:"conv/batchnorm/gamma"
  layer_param {
    idx:2
    out_0 {name:"conv/batchnorm/gamma:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv/batchnorm/beta"
  type:"input"
  top:"conv/batchnorm/beta"
  layer_param {
    idx:3
    out_0 {name:"conv/batchnorm/beta:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv/batchnorm/moving_mean"
  type:"input"
  top:"conv/batchnorm/moving_mean"
  layer_param {
    idx:4
    out_0 {name:"conv/batchnorm/moving_mean:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv/batchnorm/moving_variance"
  type:"input"
  top:"conv/batchnorm/moving_variance"
  layer_param {
    idx:5
    out_0 {name:"conv/batchnorm/moving_variance:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv_1/conv2d_params"
  type:"input"
  top:"conv_1/conv2d_params"
  layer_param {
    idx:6
    out_0 {name:"conv_1/conv2d_params:0",dtype:float32,shape:[3, 3, 32, 32]}
  }
}
layer {
  name:"conv_1/batchnorm/gamma"
  type:"input"
  top:"conv_1/batchnorm/gamma"
  layer_param {
    idx:7
    out_0 {name:"conv_1/batchnorm/gamma:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv_1/batchnorm/beta"
  type:"input"
  top:"conv_1/batchnorm/beta"
  layer_param {
    idx:8
    out_0 {name:"conv_1/batchnorm/beta:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv_1/batchnorm/moving_mean"
  type:"input"
  top:"conv_1/batchnorm/moving_mean"
  layer_param {
    idx:9
    out_0 {name:"conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv_1/batchnorm/moving_variance"
  type:"input"
  top:"conv_1/batchnorm/moving_variance"
  layer_param {
    idx:10
    out_0 {name:"conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"conv_2/conv2d_params"
  type:"input"
  top:"conv_2/conv2d_params"
  layer_param {
    idx:11
    out_0 {name:"conv_2/conv2d_params:0",dtype:float32,shape:[3, 3, 32, 64]}
  }
}
layer {
  name:"conv_2/batchnorm/gamma"
  type:"input"
  top:"conv_2/batchnorm/gamma"
  layer_param {
    idx:12
    out_0 {name:"conv_2/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"conv_2/batchnorm/beta"
  type:"input"
  top:"conv_2/batchnorm/beta"
  layer_param {
    idx:13
    out_0 {name:"conv_2/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"conv_2/batchnorm/moving_mean"
  type:"input"
  top:"conv_2/batchnorm/moving_mean"
  layer_param {
    idx:14
    out_0 {name:"conv_2/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"conv_2/batchnorm/moving_variance"
  type:"input"
  top:"conv_2/batchnorm/moving_variance"
  layer_param {
    idx:15
    out_0 {name:"conv_2/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"conv_3/conv2d_params"
  type:"input"
  top:"conv_3/conv2d_params"
  layer_param {
    idx:16
    out_0 {name:"conv_3/conv2d_params:0",dtype:float32,shape:[1, 1, 64, 80]}
  }
}
layer {
  name:"conv_3/batchnorm/gamma"
  type:"input"
  top:"conv_3/batchnorm/gamma"
  layer_param {
    idx:17
    out_0 {name:"conv_3/batchnorm/gamma:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"conv_3/batchnorm/beta"
  type:"input"
  top:"conv_3/batchnorm/beta"
  layer_param {
    idx:18
    out_0 {name:"conv_3/batchnorm/beta:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"conv_3/batchnorm/moving_mean"
  type:"input"
  top:"conv_3/batchnorm/moving_mean"
  layer_param {
    idx:19
    out_0 {name:"conv_3/batchnorm/moving_mean:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"conv_3/batchnorm/moving_variance"
  type:"input"
  top:"conv_3/batchnorm/moving_variance"
  layer_param {
    idx:20
    out_0 {name:"conv_3/batchnorm/moving_variance:0",dtype:float32,shape:[80]}
  }
}
layer {
  name:"conv_4/conv2d_params"
  type:"input"
  top:"conv_4/conv2d_params"
  layer_param {
    idx:21
    out_0 {name:"conv_4/conv2d_params:0",dtype:float32,shape:[3, 3, 80, 192]}
  }
}
layer {
  name:"conv_4/batchnorm/gamma"
  type:"input"
  top:"conv_4/batchnorm/gamma"
  layer_param {
    idx:22
    out_0 {name:"conv_4/batchnorm/gamma:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"conv_4/batchnorm/beta"
  type:"input"
  top:"conv_4/batchnorm/beta"
  layer_param {
    idx:23
    out_0 {name:"conv_4/batchnorm/beta:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"conv_4/batchnorm/moving_mean"
  type:"input"
  top:"conv_4/batchnorm/moving_mean"
  layer_param {
    idx:24
    out_0 {name:"conv_4/batchnorm/moving_mean:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"conv_4/batchnorm/moving_variance"
  type:"input"
  top:"conv_4/batchnorm/moving_variance"
  layer_param {
    idx:25
    out_0 {name:"conv_4/batchnorm/moving_variance:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed/conv/conv2d_params"
  type:"input"
  top:"mixed/conv/conv2d_params"
  layer_param {
    idx:26
    out_0 {name:"mixed/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 192, 64]}
  }
}
layer {
  name:"mixed/conv/batchnorm/gamma"
  type:"input"
  top:"mixed/conv/batchnorm/gamma"
  layer_param {
    idx:27
    out_0 {name:"mixed/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/conv/batchnorm/beta"
  type:"input"
  top:"mixed/conv/batchnorm/beta"
  layer_param {
    idx:28
    out_0 {name:"mixed/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed/conv/batchnorm/moving_mean"
  layer_param {
    idx:29
    out_0 {name:"mixed/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed/conv/batchnorm/moving_variance"
  layer_param {
    idx:30
    out_0 {name:"mixed/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower/conv/conv2d_params"
  type:"input"
  top:"mixed/tower/conv/conv2d_params"
  layer_param {
    idx:31
    out_0 {name:"mixed/tower/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 192, 48]}
  }
}
layer {
  name:"mixed/tower/conv/batchnorm/gamma"
  type:"input"
  top:"mixed/tower/conv/batchnorm/gamma"
  layer_param {
    idx:32
    out_0 {name:"mixed/tower/conv/batchnorm/gamma:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed/tower/conv/batchnorm/beta"
  type:"input"
  top:"mixed/tower/conv/batchnorm/beta"
  layer_param {
    idx:33
    out_0 {name:"mixed/tower/conv/batchnorm/beta:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed/tower/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed/tower/conv/batchnorm/moving_mean"
  layer_param {
    idx:34
    out_0 {name:"mixed/tower/conv/batchnorm/moving_mean:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed/tower/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed/tower/conv/batchnorm/moving_variance"
  layer_param {
    idx:35
    out_0 {name:"mixed/tower/conv/batchnorm/moving_variance:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed/tower/conv_1/conv2d_params"
  type:"input"
  top:"mixed/tower/conv_1/conv2d_params"
  layer_param {
    idx:36
    out_0 {name:"mixed/tower/conv_1/conv2d_params:0",dtype:float32,shape:[5, 5, 48, 64]}
  }
}
layer {
  name:"mixed/tower/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed/tower/conv_1/batchnorm/gamma"
  layer_param {
    idx:37
    out_0 {name:"mixed/tower/conv_1/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed/tower/conv_1/batchnorm/beta"
  layer_param {
    idx:38
    out_0 {name:"mixed/tower/conv_1/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed/tower/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:39
    out_0 {name:"mixed/tower/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed/tower/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:40
    out_0 {name:"mixed/tower/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower_1/conv/conv2d_params"
  type:"input"
  top:"mixed/tower_1/conv/conv2d_params"
  layer_param {
    idx:41
    out_0 {name:"mixed/tower_1/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 192, 64]}
  }
}
layer {
  name:"mixed/tower_1/conv/batchnorm/gamma"
  type:"input"
  top:"mixed/tower_1/conv/batchnorm/gamma"
  layer_param {
    idx:42
    out_0 {name:"mixed/tower_1/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower_1/conv/batchnorm/beta"
  type:"input"
  top:"mixed/tower_1/conv/batchnorm/beta"
  layer_param {
    idx:43
    out_0 {name:"mixed/tower_1/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower_1/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed/tower_1/conv/batchnorm/moving_mean"
  layer_param {
    idx:44
    out_0 {name:"mixed/tower_1/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower_1/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed/tower_1/conv/batchnorm/moving_variance"
  layer_param {
    idx:45
    out_0 {name:"mixed/tower_1/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed/tower_1/conv_1/conv2d_params"
  type:"input"
  top:"mixed/tower_1/conv_1/conv2d_params"
  layer_param {
    idx:46
    out_0 {name:"mixed/tower_1/conv_1/conv2d_params:0",dtype:float32,shape:[3, 3, 64, 96]}
  }
}
layer {
  name:"mixed/tower_1/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed/tower_1/conv_1/batchnorm/gamma"
  layer_param {
    idx:47
    out_0 {name:"mixed/tower_1/conv_1/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_1/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed/tower_1/conv_1/batchnorm/beta"
  layer_param {
    idx:48
    out_0 {name:"mixed/tower_1/conv_1/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_1/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed/tower_1/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:49
    out_0 {name:"mixed/tower_1/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_1/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed/tower_1/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:50
    out_0 {name:"mixed/tower_1/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_1/conv_2/conv2d_params"
  type:"input"
  top:"mixed/tower_1/conv_2/conv2d_params"
  layer_param {
    idx:51
    out_0 {name:"mixed/tower_1/conv_2/conv2d_params:0",dtype:float32,shape:[3, 3, 96, 96]}
  }
}
layer {
  name:"mixed/tower_1/conv_2/batchnorm/gamma"
  type:"input"
  top:"mixed/tower_1/conv_2/batchnorm/gamma"
  layer_param {
    idx:52
    out_0 {name:"mixed/tower_1/conv_2/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_1/conv_2/batchnorm/beta"
  type:"input"
  top:"mixed/tower_1/conv_2/batchnorm/beta"
  layer_param {
    idx:53
    out_0 {name:"mixed/tower_1/conv_2/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_1/conv_2/batchnorm/moving_mean"
  type:"input"
  top:"mixed/tower_1/conv_2/batchnorm/moving_mean"
  layer_param {
    idx:54
    out_0 {name:"mixed/tower_1/conv_2/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_1/conv_2/batchnorm/moving_variance"
  type:"input"
  top:"mixed/tower_1/conv_2/batchnorm/moving_variance"
  layer_param {
    idx:55
    out_0 {name:"mixed/tower_1/conv_2/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed/tower_2/conv/conv2d_params"
  type:"input"
  top:"mixed/tower_2/conv/conv2d_params"
  layer_param {
    idx:56
    out_0 {name:"mixed/tower_2/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 192, 32]}
  }
}
layer {
  name:"mixed/tower_2/conv/batchnorm/gamma"
  type:"input"
  top:"mixed/tower_2/conv/batchnorm/gamma"
  layer_param {
    idx:57
    out_0 {name:"mixed/tower_2/conv/batchnorm/gamma:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"mixed/tower_2/conv/batchnorm/beta"
  type:"input"
  top:"mixed/tower_2/conv/batchnorm/beta"
  layer_param {
    idx:58
    out_0 {name:"mixed/tower_2/conv/batchnorm/beta:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"mixed/tower_2/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed/tower_2/conv/batchnorm/moving_mean"
  layer_param {
    idx:59
    out_0 {name:"mixed/tower_2/conv/batchnorm/moving_mean:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"mixed/tower_2/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed/tower_2/conv/batchnorm/moving_variance"
  layer_param {
    idx:60
    out_0 {name:"mixed/tower_2/conv/batchnorm/moving_variance:0",dtype:float32,shape:[32]}
  }
}
layer {
  name:"mixed_1/conv/conv2d_params"
  type:"input"
  top:"mixed_1/conv/conv2d_params"
  layer_param {
    idx:61
    out_0 {name:"mixed_1/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 256, 64]}
  }
}
layer {
  name:"mixed_1/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_1/conv/batchnorm/gamma"
  layer_param {
    idx:62
    out_0 {name:"mixed_1/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/conv/batchnorm/beta"
  type:"input"
  top:"mixed_1/conv/batchnorm/beta"
  layer_param {
    idx:63
    out_0 {name:"mixed_1/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_1/conv/batchnorm/moving_mean"
  layer_param {
    idx:64
    out_0 {name:"mixed_1/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_1/conv/batchnorm/moving_variance"
  layer_param {
    idx:65
    out_0 {name:"mixed_1/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower/conv/conv2d_params"
  type:"input"
  top:"mixed_1/tower/conv/conv2d_params"
  layer_param {
    idx:66
    out_0 {name:"mixed_1/tower/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 256, 48]}
  }
}
layer {
  name:"mixed_1/tower/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_1/tower/conv/batchnorm/gamma"
  layer_param {
    idx:67
    out_0 {name:"mixed_1/tower/conv/batchnorm/gamma:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_1/tower/conv/batchnorm/beta"
  type:"input"
  top:"mixed_1/tower/conv/batchnorm/beta"
  layer_param {
    idx:68
    out_0 {name:"mixed_1/tower/conv/batchnorm/beta:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_1/tower/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_1/tower/conv/batchnorm/moving_mean"
  layer_param {
    idx:69
    out_0 {name:"mixed_1/tower/conv/batchnorm/moving_mean:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_1/tower/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_1/tower/conv/batchnorm/moving_variance"
  layer_param {
    idx:70
    out_0 {name:"mixed_1/tower/conv/batchnorm/moving_variance:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_1/tower/conv_1/conv2d_params"
  type:"input"
  top:"mixed_1/tower/conv_1/conv2d_params"
  layer_param {
    idx:71
    out_0 {name:"mixed_1/tower/conv_1/conv2d_params:0",dtype:float32,shape:[5, 5, 48, 64]}
  }
}
layer {
  name:"mixed_1/tower/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_1/tower/conv_1/batchnorm/gamma"
  layer_param {
    idx:72
    out_0 {name:"mixed_1/tower/conv_1/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_1/tower/conv_1/batchnorm/beta"
  layer_param {
    idx:73
    out_0 {name:"mixed_1/tower/conv_1/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_1/tower/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:74
    out_0 {name:"mixed_1/tower/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_1/tower/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:75
    out_0 {name:"mixed_1/tower/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_1/conv/conv2d_params"
  type:"input"
  top:"mixed_1/tower_1/conv/conv2d_params"
  layer_param {
    idx:76
    out_0 {name:"mixed_1/tower_1/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 256, 64]}
  }
}
layer {
  name:"mixed_1/tower_1/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_1/tower_1/conv/batchnorm/gamma"
  layer_param {
    idx:77
    out_0 {name:"mixed_1/tower_1/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_1/conv/batchnorm/beta"
  type:"input"
  top:"mixed_1/tower_1/conv/batchnorm/beta"
  layer_param {
    idx:78
    out_0 {name:"mixed_1/tower_1/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_1/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_1/tower_1/conv/batchnorm/moving_mean"
  layer_param {
    idx:79
    out_0 {name:"mixed_1/tower_1/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_1/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_1/tower_1/conv/batchnorm/moving_variance"
  layer_param {
    idx:80
    out_0 {name:"mixed_1/tower_1/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_1/conv2d_params"
  type:"input"
  top:"mixed_1/tower_1/conv_1/conv2d_params"
  layer_param {
    idx:81
    out_0 {name:"mixed_1/tower_1/conv_1/conv2d_params:0",dtype:float32,shape:[3, 3, 64, 96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_1/tower_1/conv_1/batchnorm/gamma"
  layer_param {
    idx:82
    out_0 {name:"mixed_1/tower_1/conv_1/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_1/tower_1/conv_1/batchnorm/beta"
  layer_param {
    idx:83
    out_0 {name:"mixed_1/tower_1/conv_1/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_1/tower_1/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:84
    out_0 {name:"mixed_1/tower_1/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_1/tower_1/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:85
    out_0 {name:"mixed_1/tower_1/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_2/conv2d_params"
  type:"input"
  top:"mixed_1/tower_1/conv_2/conv2d_params"
  layer_param {
    idx:86
    out_0 {name:"mixed_1/tower_1/conv_2/conv2d_params:0",dtype:float32,shape:[3, 3, 96, 96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_2/batchnorm/gamma"
  type:"input"
  top:"mixed_1/tower_1/conv_2/batchnorm/gamma"
  layer_param {
    idx:87
    out_0 {name:"mixed_1/tower_1/conv_2/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_2/batchnorm/beta"
  type:"input"
  top:"mixed_1/tower_1/conv_2/batchnorm/beta"
  layer_param {
    idx:88
    out_0 {name:"mixed_1/tower_1/conv_2/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_2/batchnorm/moving_mean"
  type:"input"
  top:"mixed_1/tower_1/conv_2/batchnorm/moving_mean"
  layer_param {
    idx:89
    out_0 {name:"mixed_1/tower_1/conv_2/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_1/conv_2/batchnorm/moving_variance"
  type:"input"
  top:"mixed_1/tower_1/conv_2/batchnorm/moving_variance"
  layer_param {
    idx:90
    out_0 {name:"mixed_1/tower_1/conv_2/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_1/tower_2/conv/conv2d_params"
  type:"input"
  top:"mixed_1/tower_2/conv/conv2d_params"
  layer_param {
    idx:91
    out_0 {name:"mixed_1/tower_2/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 256, 64]}
  }
}
layer {
  name:"mixed_1/tower_2/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_1/tower_2/conv/batchnorm/gamma"
  layer_param {
    idx:92
    out_0 {name:"mixed_1/tower_2/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_2/conv/batchnorm/beta"
  type:"input"
  top:"mixed_1/tower_2/conv/batchnorm/beta"
  layer_param {
    idx:93
    out_0 {name:"mixed_1/tower_2/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_2/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_1/tower_2/conv/batchnorm/moving_mean"
  layer_param {
    idx:94
    out_0 {name:"mixed_1/tower_2/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_1/tower_2/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_1/tower_2/conv/batchnorm/moving_variance"
  layer_param {
    idx:95
    out_0 {name:"mixed_1/tower_2/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/conv/conv2d_params"
  type:"input"
  top:"mixed_2/conv/conv2d_params"
  layer_param {
    idx:96
    out_0 {name:"mixed_2/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 288, 64]}
  }
}
layer {
  name:"mixed_2/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_2/conv/batchnorm/gamma"
  layer_param {
    idx:97
    out_0 {name:"mixed_2/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/conv/batchnorm/beta"
  type:"input"
  top:"mixed_2/conv/batchnorm/beta"
  layer_param {
    idx:98
    out_0 {name:"mixed_2/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_2/conv/batchnorm/moving_mean"
  layer_param {
    idx:99
    out_0 {name:"mixed_2/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_2/conv/batchnorm/moving_variance"
  layer_param {
    idx:100
    out_0 {name:"mixed_2/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower/conv/conv2d_params"
  type:"input"
  top:"mixed_2/tower/conv/conv2d_params"
  layer_param {
    idx:101
    out_0 {name:"mixed_2/tower/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 288, 48]}
  }
}
layer {
  name:"mixed_2/tower/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_2/tower/conv/batchnorm/gamma"
  layer_param {
    idx:102
    out_0 {name:"mixed_2/tower/conv/batchnorm/gamma:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_2/tower/conv/batchnorm/beta"
  type:"input"
  top:"mixed_2/tower/conv/batchnorm/beta"
  layer_param {
    idx:103
    out_0 {name:"mixed_2/tower/conv/batchnorm/beta:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_2/tower/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_2/tower/conv/batchnorm/moving_mean"
  layer_param {
    idx:104
    out_0 {name:"mixed_2/tower/conv/batchnorm/moving_mean:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_2/tower/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_2/tower/conv/batchnorm/moving_variance"
  layer_param {
    idx:105
    out_0 {name:"mixed_2/tower/conv/batchnorm/moving_variance:0",dtype:float32,shape:[48]}
  }
}
layer {
  name:"mixed_2/tower/conv_1/conv2d_params"
  type:"input"
  top:"mixed_2/tower/conv_1/conv2d_params"
  layer_param {
    idx:106
    out_0 {name:"mixed_2/tower/conv_1/conv2d_params:0",dtype:float32,shape:[5, 5, 48, 64]}
  }
}
layer {
  name:"mixed_2/tower/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_2/tower/conv_1/batchnorm/gamma"
  layer_param {
    idx:107
    out_0 {name:"mixed_2/tower/conv_1/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_2/tower/conv_1/batchnorm/beta"
  layer_param {
    idx:108
    out_0 {name:"mixed_2/tower/conv_1/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_2/tower/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:109
    out_0 {name:"mixed_2/tower/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_2/tower/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:110
    out_0 {name:"mixed_2/tower/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_1/conv/conv2d_params"
  type:"input"
  top:"mixed_2/tower_1/conv/conv2d_params"
  layer_param {
    idx:111
    out_0 {name:"mixed_2/tower_1/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 288, 64]}
  }
}
layer {
  name:"mixed_2/tower_1/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_2/tower_1/conv/batchnorm/gamma"
  layer_param {
    idx:112
    out_0 {name:"mixed_2/tower_1/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_1/conv/batchnorm/beta"
  type:"input"
  top:"mixed_2/tower_1/conv/batchnorm/beta"
  layer_param {
    idx:113
    out_0 {name:"mixed_2/tower_1/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_1/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_2/tower_1/conv/batchnorm/moving_mean"
  layer_param {
    idx:114
    out_0 {name:"mixed_2/tower_1/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_1/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_2/tower_1/conv/batchnorm/moving_variance"
  layer_param {
    idx:115
    out_0 {name:"mixed_2/tower_1/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_1/conv2d_params"
  type:"input"
  top:"mixed_2/tower_1/conv_1/conv2d_params"
  layer_param {
    idx:116
    out_0 {name:"mixed_2/tower_1/conv_1/conv2d_params:0",dtype:float32,shape:[3, 3, 64, 96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_2/tower_1/conv_1/batchnorm/gamma"
  layer_param {
    idx:117
    out_0 {name:"mixed_2/tower_1/conv_1/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_2/tower_1/conv_1/batchnorm/beta"
  layer_param {
    idx:118
    out_0 {name:"mixed_2/tower_1/conv_1/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_2/tower_1/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:119
    out_0 {name:"mixed_2/tower_1/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_2/tower_1/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:120
    out_0 {name:"mixed_2/tower_1/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_2/conv2d_params"
  type:"input"
  top:"mixed_2/tower_1/conv_2/conv2d_params"
  layer_param {
    idx:121
    out_0 {name:"mixed_2/tower_1/conv_2/conv2d_params:0",dtype:float32,shape:[3, 3, 96, 96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_2/batchnorm/gamma"
  type:"input"
  top:"mixed_2/tower_1/conv_2/batchnorm/gamma"
  layer_param {
    idx:122
    out_0 {name:"mixed_2/tower_1/conv_2/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_2/batchnorm/beta"
  type:"input"
  top:"mixed_2/tower_1/conv_2/batchnorm/beta"
  layer_param {
    idx:123
    out_0 {name:"mixed_2/tower_1/conv_2/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_2/batchnorm/moving_mean"
  type:"input"
  top:"mixed_2/tower_1/conv_2/batchnorm/moving_mean"
  layer_param {
    idx:124
    out_0 {name:"mixed_2/tower_1/conv_2/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_1/conv_2/batchnorm/moving_variance"
  type:"input"
  top:"mixed_2/tower_1/conv_2/batchnorm/moving_variance"
  layer_param {
    idx:125
    out_0 {name:"mixed_2/tower_1/conv_2/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_2/tower_2/conv/conv2d_params"
  type:"input"
  top:"mixed_2/tower_2/conv/conv2d_params"
  layer_param {
    idx:126
    out_0 {name:"mixed_2/tower_2/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 288, 64]}
  }
}
layer {
  name:"mixed_2/tower_2/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_2/tower_2/conv/batchnorm/gamma"
  layer_param {
    idx:127
    out_0 {name:"mixed_2/tower_2/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_2/conv/batchnorm/beta"
  type:"input"
  top:"mixed_2/tower_2/conv/batchnorm/beta"
  layer_param {
    idx:128
    out_0 {name:"mixed_2/tower_2/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_2/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_2/tower_2/conv/batchnorm/moving_mean"
  layer_param {
    idx:129
    out_0 {name:"mixed_2/tower_2/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_2/tower_2/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_2/tower_2/conv/batchnorm/moving_variance"
  layer_param {
    idx:130
    out_0 {name:"mixed_2/tower_2/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_3/conv/conv2d_params"
  type:"input"
  top:"mixed_3/conv/conv2d_params"
  layer_param {
    idx:131
    out_0 {name:"mixed_3/conv/conv2d_params:0",dtype:float32,shape:[3, 3, 288, 384]}
  }
}
layer {
  name:"mixed_3/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_3/conv/batchnorm/gamma"
  layer_param {
    idx:132
    out_0 {name:"mixed_3/conv/batchnorm/gamma:0",dtype:float32,shape:[384]}
  }
}
layer {
  name:"mixed_3/conv/batchnorm/beta"
  type:"input"
  top:"mixed_3/conv/batchnorm/beta"
  layer_param {
    idx:133
    out_0 {name:"mixed_3/conv/batchnorm/beta:0",dtype:float32,shape:[384]}
  }
}
layer {
  name:"mixed_3/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_3/conv/batchnorm/moving_mean"
  layer_param {
    idx:134
    out_0 {name:"mixed_3/conv/batchnorm/moving_mean:0",dtype:float32,shape:[384]}
  }
}
layer {
  name:"mixed_3/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_3/conv/batchnorm/moving_variance"
  layer_param {
    idx:135
    out_0 {name:"mixed_3/conv/batchnorm/moving_variance:0",dtype:float32,shape:[384]}
  }
}
layer {
  name:"mixed_3/tower/conv/conv2d_params"
  type:"input"
  top:"mixed_3/tower/conv/conv2d_params"
  layer_param {
    idx:136
    out_0 {name:"mixed_3/tower/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 288, 64]}
  }
}
layer {
  name:"mixed_3/tower/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_3/tower/conv/batchnorm/gamma"
  layer_param {
    idx:137
    out_0 {name:"mixed_3/tower/conv/batchnorm/gamma:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_3/tower/conv/batchnorm/beta"
  type:"input"
  top:"mixed_3/tower/conv/batchnorm/beta"
  layer_param {
    idx:138
    out_0 {name:"mixed_3/tower/conv/batchnorm/beta:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_3/tower/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_3/tower/conv/batchnorm/moving_mean"
  layer_param {
    idx:139
    out_0 {name:"mixed_3/tower/conv/batchnorm/moving_mean:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_3/tower/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_3/tower/conv/batchnorm/moving_variance"
  layer_param {
    idx:140
    out_0 {name:"mixed_3/tower/conv/batchnorm/moving_variance:0",dtype:float32,shape:[64]}
  }
}
layer {
  name:"mixed_3/tower/conv_1/conv2d_params"
  type:"input"
  top:"mixed_3/tower/conv_1/conv2d_params"
  layer_param {
    idx:141
    out_0 {name:"mixed_3/tower/conv_1/conv2d_params:0",dtype:float32,shape:[3, 3, 64, 96]}
  }
}
layer {
  name:"mixed_3/tower/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_3/tower/conv_1/batchnorm/gamma"
  layer_param {
    idx:142
    out_0 {name:"mixed_3/tower/conv_1/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_3/tower/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_3/tower/conv_1/batchnorm/beta"
  layer_param {
    idx:143
    out_0 {name:"mixed_3/tower/conv_1/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_3/tower/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_3/tower/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:144
    out_0 {name:"mixed_3/tower/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_3/tower/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_3/tower/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:145
    out_0 {name:"mixed_3/tower/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_3/tower/conv_2/conv2d_params"
  type:"input"
  top:"mixed_3/tower/conv_2/conv2d_params"
  layer_param {
    idx:146
    out_0 {name:"mixed_3/tower/conv_2/conv2d_params:0",dtype:float32,shape:[3, 3, 96, 96]}
  }
}
layer {
  name:"mixed_3/tower/conv_2/batchnorm/gamma"
  type:"input"
  top:"mixed_3/tower/conv_2/batchnorm/gamma"
  layer_param {
    idx:147
    out_0 {name:"mixed_3/tower/conv_2/batchnorm/gamma:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_3/tower/conv_2/batchnorm/beta"
  type:"input"
  top:"mixed_3/tower/conv_2/batchnorm/beta"
  layer_param {
    idx:148
    out_0 {name:"mixed_3/tower/conv_2/batchnorm/beta:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_3/tower/conv_2/batchnorm/moving_mean"
  type:"input"
  top:"mixed_3/tower/conv_2/batchnorm/moving_mean"
  layer_param {
    idx:149
    out_0 {name:"mixed_3/tower/conv_2/batchnorm/moving_mean:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_3/tower/conv_2/batchnorm/moving_variance"
  type:"input"
  top:"mixed_3/tower/conv_2/batchnorm/moving_variance"
  layer_param {
    idx:150
    out_0 {name:"mixed_3/tower/conv_2/batchnorm/moving_variance:0",dtype:float32,shape:[96]}
  }
}
layer {
  name:"mixed_4/conv/conv2d_params"
  type:"input"
  top:"mixed_4/conv/conv2d_params"
  layer_param {
    idx:151
    out_0 {name:"mixed_4/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 768, 192]}
  }
}
layer {
  name:"mixed_4/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_4/conv/batchnorm/gamma"
  layer_param {
    idx:152
    out_0 {name:"mixed_4/conv/batchnorm/gamma:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/conv/batchnorm/beta"
  type:"input"
  top:"mixed_4/conv/batchnorm/beta"
  layer_param {
    idx:153
    out_0 {name:"mixed_4/conv/batchnorm/beta:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/conv/batchnorm/moving_mean"
  layer_param {
    idx:154
    out_0 {name:"mixed_4/conv/batchnorm/moving_mean:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/conv/batchnorm/moving_variance"
  layer_param {
    idx:155
    out_0 {name:"mixed_4/conv/batchnorm/moving_variance:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower/conv/conv2d_params"
  type:"input"
  top:"mixed_4/tower/conv/conv2d_params"
  layer_param {
    idx:156
    out_0 {name:"mixed_4/tower/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 768, 128]}
  }
}
layer {
  name:"mixed_4/tower/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower/conv/batchnorm/gamma"
  layer_param {
    idx:157
    out_0 {name:"mixed_4/tower/conv/batchnorm/gamma:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower/conv/batchnorm/beta"
  layer_param {
    idx:158
    out_0 {name:"mixed_4/tower/conv/batchnorm/beta:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower/conv/batchnorm/moving_mean"
  layer_param {
    idx:159
    out_0 {name:"mixed_4/tower/conv/batchnorm/moving_mean:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower/conv/batchnorm/moving_variance"
  layer_param {
    idx:160
    out_0 {name:"mixed_4/tower/conv/batchnorm/moving_variance:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv_1/conv2d_params"
  type:"input"
  top:"mixed_4/tower/conv_1/conv2d_params"
  layer_param {
    idx:161
    out_0 {name:"mixed_4/tower/conv_1/conv2d_params:0",dtype:float32,shape:[1, 7, 128, 128]}
  }
}
layer {
  name:"mixed_4/tower/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower/conv_1/batchnorm/gamma"
  layer_param {
    idx:162
    out_0 {name:"mixed_4/tower/conv_1/batchnorm/gamma:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower/conv_1/batchnorm/beta"
  layer_param {
    idx:163
    out_0 {name:"mixed_4/tower/conv_1/batchnorm/beta:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:164
    out_0 {name:"mixed_4/tower/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:165
    out_0 {name:"mixed_4/tower/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower/conv_2/conv2d_params"
  type:"input"
  top:"mixed_4/tower/conv_2/conv2d_params"
  layer_param {
    idx:166
    out_0 {name:"mixed_4/tower/conv_2/conv2d_params:0",dtype:float32,shape:[7, 1, 128, 192]}
  }
}
layer {
  name:"mixed_4/tower/conv_2/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower/conv_2/batchnorm/gamma"
  layer_param {
    idx:167
    out_0 {name:"mixed_4/tower/conv_2/batchnorm/gamma:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower/conv_2/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower/conv_2/batchnorm/beta"
  layer_param {
    idx:168
    out_0 {name:"mixed_4/tower/conv_2/batchnorm/beta:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower/conv_2/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower/conv_2/batchnorm/moving_mean"
  layer_param {
    idx:169
    out_0 {name:"mixed_4/tower/conv_2/batchnorm/moving_mean:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower/conv_2/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower/conv_2/batchnorm/moving_variance"
  layer_param {
    idx:170
    out_0 {name:"mixed_4/tower/conv_2/batchnorm/moving_variance:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_1/conv/conv2d_params"
  type:"input"
  top:"mixed_4/tower_1/conv/conv2d_params"
  layer_param {
    idx:171
    out_0 {name:"mixed_4/tower_1/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 768, 128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower_1/conv/batchnorm/gamma"
  layer_param {
    idx:172
    out_0 {name:"mixed_4/tower_1/conv/batchnorm/gamma:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower_1/conv/batchnorm/beta"
  layer_param {
    idx:173
    out_0 {name:"mixed_4/tower_1/conv/batchnorm/beta:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower_1/conv/batchnorm/moving_mean"
  layer_param {
    idx:174
    out_0 {name:"mixed_4/tower_1/conv/batchnorm/moving_mean:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower_1/conv/batchnorm/moving_variance"
  layer_param {
    idx:175
    out_0 {name:"mixed_4/tower_1/conv/batchnorm/moving_variance:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_1/conv2d_params"
  type:"input"
  top:"mixed_4/tower_1/conv_1/conv2d_params"
  layer_param {
    idx:176
    out_0 {name:"mixed_4/tower_1/conv_1/conv2d_params:0",dtype:float32,shape:[7, 1, 128, 128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower_1/conv_1/batchnorm/gamma"
  layer_param {
    idx:177
    out_0 {name:"mixed_4/tower_1/conv_1/batchnorm/gamma:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower_1/conv_1/batchnorm/beta"
  layer_param {
    idx:178
    out_0 {name:"mixed_4/tower_1/conv_1/batchnorm/beta:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower_1/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:179
    out_0 {name:"mixed_4/tower_1/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower_1/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:180
    out_0 {name:"mixed_4/tower_1/conv_1/batchnorm/moving_variance:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_2/conv2d_params"
  type:"input"
  top:"mixed_4/tower_1/conv_2/conv2d_params"
  layer_param {
    idx:181
    out_0 {name:"mixed_4/tower_1/conv_2/conv2d_params:0",dtype:float32,shape:[1, 7, 128, 128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_2/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower_1/conv_2/batchnorm/gamma"
  layer_param {
    idx:182
    out_0 {name:"mixed_4/tower_1/conv_2/batchnorm/gamma:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_2/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower_1/conv_2/batchnorm/beta"
  layer_param {
    idx:183
    out_0 {name:"mixed_4/tower_1/conv_2/batchnorm/beta:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_2/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower_1/conv_2/batchnorm/moving_mean"
  layer_param {
    idx:184
    out_0 {name:"mixed_4/tower_1/conv_2/batchnorm/moving_mean:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_2/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower_1/conv_2/batchnorm/moving_variance"
  layer_param {
    idx:185
    out_0 {name:"mixed_4/tower_1/conv_2/batchnorm/moving_variance:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_3/conv2d_params"
  type:"input"
  top:"mixed_4/tower_1/conv_3/conv2d_params"
  layer_param {
    idx:186
    out_0 {name:"mixed_4/tower_1/conv_3/conv2d_params:0",dtype:float32,shape:[7, 1, 128, 128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_3/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower_1/conv_3/batchnorm/gamma"
  layer_param {
    idx:187
    out_0 {name:"mixed_4/tower_1/conv_3/batchnorm/gamma:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_3/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower_1/conv_3/batchnorm/beta"
  layer_param {
    idx:188
    out_0 {name:"mixed_4/tower_1/conv_3/batchnorm/beta:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_3/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower_1/conv_3/batchnorm/moving_mean"
  layer_param {
    idx:189
    out_0 {name:"mixed_4/tower_1/conv_3/batchnorm/moving_mean:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_3/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower_1/conv_3/batchnorm/moving_variance"
  layer_param {
    idx:190
    out_0 {name:"mixed_4/tower_1/conv_3/batchnorm/moving_variance:0",dtype:float32,shape:[128]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_4/conv2d_params"
  type:"input"
  top:"mixed_4/tower_1/conv_4/conv2d_params"
  layer_param {
    idx:191
    out_0 {name:"mixed_4/tower_1/conv_4/conv2d_params:0",dtype:float32,shape:[1, 7, 128, 192]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_4/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower_1/conv_4/batchnorm/gamma"
  layer_param {
    idx:192
    out_0 {name:"mixed_4/tower_1/conv_4/batchnorm/gamma:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_4/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower_1/conv_4/batchnorm/beta"
  layer_param {
    idx:193
    out_0 {name:"mixed_4/tower_1/conv_4/batchnorm/beta:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_4/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower_1/conv_4/batchnorm/moving_mean"
  layer_param {
    idx:194
    out_0 {name:"mixed_4/tower_1/conv_4/batchnorm/moving_mean:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_1/conv_4/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower_1/conv_4/batchnorm/moving_variance"
  layer_param {
    idx:195
    out_0 {name:"mixed_4/tower_1/conv_4/batchnorm/moving_variance:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_2/conv/conv2d_params"
  type:"input"
  top:"mixed_4/tower_2/conv/conv2d_params"
  layer_param {
    idx:196
    out_0 {name:"mixed_4/tower_2/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 768, 192]}
  }
}
layer {
  name:"mixed_4/tower_2/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_4/tower_2/conv/batchnorm/gamma"
  layer_param {
    idx:197
    out_0 {name:"mixed_4/tower_2/conv/batchnorm/gamma:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_2/conv/batchnorm/beta"
  type:"input"
  top:"mixed_4/tower_2/conv/batchnorm/beta"
  layer_param {
    idx:198
    out_0 {name:"mixed_4/tower_2/conv/batchnorm/beta:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_2/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_4/tower_2/conv/batchnorm/moving_mean"
  layer_param {
    idx:199
    out_0 {name:"mixed_4/tower_2/conv/batchnorm/moving_mean:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_4/tower_2/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_4/tower_2/conv/batchnorm/moving_variance"
  layer_param {
    idx:200
    out_0 {name:"mixed_4/tower_2/conv/batchnorm/moving_variance:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_5/conv/conv2d_params"
  type:"input"
  top:"mixed_5/conv/conv2d_params"
  layer_param {
    idx:201
    out_0 {name:"mixed_5/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 768, 192]}
  }
}
layer {
  name:"mixed_5/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_5/conv/batchnorm/gamma"
  layer_param {
    idx:202
    out_0 {name:"mixed_5/conv/batchnorm/gamma:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_5/conv/batchnorm/beta"
  type:"input"
  top:"mixed_5/conv/batchnorm/beta"
  layer_param {
    idx:203
    out_0 {name:"mixed_5/conv/batchnorm/beta:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_5/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_5/conv/batchnorm/moving_mean"
  layer_param {
    idx:204
    out_0 {name:"mixed_5/conv/batchnorm/moving_mean:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_5/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_5/conv/batchnorm/moving_variance"
  layer_param {
    idx:205
    out_0 {name:"mixed_5/conv/batchnorm/moving_variance:0",dtype:float32,shape:[192]}
  }
}
layer {
  name:"mixed_5/tower/conv/conv2d_params"
  type:"input"
  top:"mixed_5/tower/conv/conv2d_params"
  layer_param {
    idx:206
    out_0 {name:"mixed_5/tower/conv/conv2d_params:0",dtype:float32,shape:[1, 1, 768, 160]}
  }
}
layer {
  name:"mixed_5/tower/conv/batchnorm/gamma"
  type:"input"
  top:"mixed_5/tower/conv/batchnorm/gamma"
  layer_param {
    idx:207
    out_0 {name:"mixed_5/tower/conv/batchnorm/gamma:0",dtype:float32,shape:[160]}
  }
}
layer {
  name:"mixed_5/tower/conv/batchnorm/beta"
  type:"input"
  top:"mixed_5/tower/conv/batchnorm/beta"
  layer_param {
    idx:208
    out_0 {name:"mixed_5/tower/conv/batchnorm/beta:0",dtype:float32,shape:[160]}
  }
}
layer {
  name:"mixed_5/tower/conv/batchnorm/moving_mean"
  type:"input"
  top:"mixed_5/tower/conv/batchnorm/moving_mean"
  layer_param {
    idx:209
    out_0 {name:"mixed_5/tower/conv/batchnorm/moving_mean:0",dtype:float32,shape:[160]}
  }
}
layer {
  name:"mixed_5/tower/conv/batchnorm/moving_variance"
  type:"input"
  top:"mixed_5/tower/conv/batchnorm/moving_variance"
  layer_param {
    idx:210
    out_0 {name:"mixed_5/tower/conv/batchnorm/moving_variance:0",dtype:float32,shape:[160]}
  }
}
layer {
  name:"mixed_5/tower/conv_1/conv2d_params"
  type:"input"
  top:"mixed_5/tower/conv_1/conv2d_params"
  layer_param {
    idx:211
    out_0 {name:"mixed_5/tower/conv_1/conv2d_params:0",dtype:float32,shape:[1, 7, 160, 160]}
  }
}
layer {
  name:"mixed_5/tower/conv_1/batchnorm/gamma"
  type:"input"
  top:"mixed_5/tower/conv_1/batchnorm/gamma"
  layer_param {
    idx:212
    out_0 {name:"mixed_5/tower/conv_1/batchnorm/gamma:0",dtype:float32,shape:[160]}
  }
}
layer {
  name:"mixed_5/tower/conv_1/batchnorm/beta"
  type:"input"
  top:"mixed_5/tower/conv_1/batchnorm/beta"
  layer_param {
    idx:213
    out_0 {name:"mixed_5/tower/conv_1/batchnorm/beta:0",dtype:float32,shape:[160]}
  }
}
layer {
  name:"mixed_5/tower/conv_1/batchnorm/moving_mean"
  type:"input"
  top:"mixed_5/tower/conv_1/batchnorm/moving_mean"
  layer_param {
    idx:214
    out_0 {name:"mixed_5/tower/conv_1/batchnorm/moving_mean:0",dtype:float32,shape:[160]}
  }
}
layer {
  name:"mixed_5/tower/conv_1/batchnorm/moving_variance"
  type:"input"
  top:"mixed_5/tower/conv_1/batchnorm/moving_variance"
  layer_param {
    idx:215
