name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:0
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"x"
  type:"var"
  top:"x"
  bottom:"Node_8"
  layer_param {
    idx:1
    in_0 {name:"Node_8:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"p0"
  type:"input"
  top:"p0"
  layer_param {
    idx:2
    out_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"Node_5"
  type:"layout_transform"
  top:"Node_5"
  bottom:"p0"
  layer_param {
    idx:5
    in_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
    out_0 {name:"Node_5:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    attrs {'src_layout': 'NCHW', 'dst_layout': 'NCHW3c'}
  }
}
layer {
  name:"Node_6"
  type:"function"
  top:"Node_6"
  bottom:"p0"
  bottom:"Node_5"
  layer_param {
    idx:6
    in_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_5:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"Node_6:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"Node_8"
  type:"func_call"
  top:"Node_8"
  bottom:"input0"
  bottom:"Node_6"
  layer_param {
    idx:8
    in_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_6:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"Node_8:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"x_1"
  type:"var"
  top:"x_1"
  bottom:"Node_10"
  layer_param {
    idx:9
    in_0 {name:"Node_10:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
  }
}
layer {
  name:"Node_10"
  type:"const"
  top:"Node_10"
  layer_param {
    idx:10
    out_0 {name:"Node_10:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
  }
}
layer {
  name:"x_2"
  type:"var"
  top:"x_2"
  bottom:"Node_12"
  layer_param {
    idx:11
    in_0 {name:"Node_12:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_12"
  type:"const"
  top:"Node_12"
  layer_param {
    idx:12
    out_0 {name:"Node_12:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"x_3"
  type:"var"
  top:"x_3"
  bottom:"Node_30"
  layer_param {
    idx:13
    in_0 {name:"Node_30:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"p0_1"
  type:"input"
  top:"p0_1"
  layer_param {
    idx:14
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"p1"
  type:"input"
  top:"p1"
  layer_param {
    idx:15
    out_0 {name:"p1:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
  }
}
layer {
  name:"p2"
  type:"input"
  top:"p2"
  layer_param {
    idx:16
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_22"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_22"
  bottom:"p0_1"
  bottom:"p1"
  layer_param {
    idx:22
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
    out_0 {name:"Node_22:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW3c', 'kernel_layout': 'OIHW3i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_24"
  type:"add"
  top:"Node_24"
  bottom:"Node_22"
  bottom:"p2"
  layer_param {
    idx:24
    in_0 {name:"Node_22:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_24:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_25"
  type:"nn_relu"
  top:"Node_25"
  bottom:"Node_24"
  layer_param {
    idx:25
    in_0 {name:"Node_24:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_25:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_26"
  type:"function"
  top:"Node_26"
  bottom:"p0_1"
  bottom:"p1"
  bottom:"p2"
  bottom:"Node_25"
  layer_param {
    idx:26
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_25:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_26:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_30"
  type:"func_call"
  top:"Node_30"
  bottom:"x"
  bottom:"x_1"
  bottom:"x_2"
  bottom:"Node_26"
  layer_param {
    idx:30
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"x:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_26:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_30:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"x_4"
  type:"var"
  top:"x_4"
  bottom:"Node_38"
  layer_param {
    idx:31
    in_0 {name:"Node_38:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p0_2"
  type:"input"
  top:"p0_2"
  layer_param {
    idx:32
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_35"
  type:"nn_max_pool2d"
  top:"Node_35"
  bottom:"p0_2"
  layer_param {
    idx:35
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_35:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW8c', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_36"
  type:"function"
  top:"Node_36"
  bottom:"p0_2"
  bottom:"Node_35"
  layer_param {
    idx:36
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    in_1 {name:"Node_35:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_36:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_38"
  type:"func_call"
  top:"Node_38"
  bottom:"x_3"
  bottom:"Node_36"
  layer_param {
    idx:38
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    in_1 {name:"Node_36:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_38:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_5"
  type:"var"
  top:"x_5"
  bottom:"Node_40"
  layer_param {
    idx:39
    in_0 {name:"Node_40:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_40"
  type:"const"
  top:"Node_40"
  layer_param {
    idx:40
    out_0 {name:"Node_40:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_6"
  type:"var"
  top:"x_6"
  bottom:"Node_42"
  layer_param {
    idx:41
    in_0 {name:"Node_42:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_42"
  type:"const"
  top:"Node_42"
  layer_param {
    idx:42
    out_0 {name:"Node_42:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"x_7"
  type:"var"
  top:"x_7"
  bottom:"Node_60"
  layer_param {
    idx:43
    in_0 {name:"Node_60:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p0_3"
  type:"input"
  top:"p0_3"
  layer_param {
    idx:44
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_1"
  type:"input"
  top:"p1_1"
  layer_param {
    idx:45
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_1"
  type:"input"
  top:"p2_1"
  layer_param {
    idx:46
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_52"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_52"
  bottom:"p0_3"
  bottom:"p1_1"
  layer_param {
    idx:52
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_52:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_54"
  type:"add"
  top:"Node_54"
  bottom:"Node_52"
  bottom:"p2_1"
  layer_param {
    idx:54
    in_0 {name:"Node_52:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_54:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_55"
  type:"nn_relu"
  top:"Node_55"
  bottom:"Node_54"
  layer_param {
    idx:55
    in_0 {name:"Node_54:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_55:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_56"
  type:"function"
  top:"Node_56"
  bottom:"p0_3"
  bottom:"p1_1"
  bottom:"p2_1"
  bottom:"Node_55"
  layer_param {
    idx:56
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_55:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_56:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_60"
  type:"func_call"
  top:"Node_60"
  bottom:"x_4"
  bottom:"x_5"
  bottom:"x_6"
  bottom:"Node_56"
  layer_param {
    idx:60
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_56:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_60:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_8"
  type:"var"
  top:"x_8"
  bottom:"Node_62"
  layer_param {
    idx:61
    in_0 {name:"Node_62:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_62"
  type:"const"
  top:"Node_62"
  layer_param {
    idx:62
    out_0 {name:"Node_62:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_9"
  type:"var"
  top:"x_9"
  bottom:"Node_64"
  layer_param {
    idx:63
    in_0 {name:"Node_64:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_64"
  type:"const"
  top:"Node_64"
  layer_param {
    idx:64
    out_0 {name:"Node_64:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"x_10"
  type:"var"
  top:"x_10"
  bottom:"Node_87"
  layer_param {
    idx:65
    in_0 {name:"Node_87:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p0_4"
  type:"input"
  top:"p0_4"
  layer_param {
    idx:66
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_2"
  type:"input"
  top:"p1_2"
  layer_param {
    idx:67
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_2"
  type:"input"
  top:"p2_2"
  layer_param {
    idx:68
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"p3"
  type:"input"
  top:"p3"
  layer_param {
    idx:69
    out_0 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_76"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_76"
  bottom:"p0_4"
  bottom:"p1_2"
  layer_param {
    idx:76
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_76:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_78"
  type:"add"
  top:"Node_78"
  bottom:"Node_76"
  bottom:"p2_2"
  layer_param {
    idx:78
    in_0 {name:"Node_76:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_78:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_80"
  type:"add"
  top:"Node_80"
  bottom:"Node_78"
  bottom:"p3"
  layer_param {
    idx:80
    in_0 {name:"Node_78:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_80:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_81"
  type:"nn_relu"
  top:"Node_81"
  bottom:"Node_80"
  layer_param {
    idx:81
    in_0 {name:"Node_80:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_81:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_82"
  type:"function"
  top:"Node_82"
  bottom:"p0_4"
  bottom:"p1_2"
  bottom:"p2_2"
  bottom:"p3"
  bottom:"Node_81"
  layer_param {
    idx:82
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_4 {name:"Node_81:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_82:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_87"
  type:"func_call"
  top:"Node_87"
  bottom:"x_7"
  bottom:"x_8"
  bottom:"x_9"
  bottom:"x_4"
  bottom:"Node_82"
  layer_param {
    idx:87
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_4 {name:"Node_82:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_87:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_11"
  type:"var"
  top:"x_11"
  bottom:"Node_89"
  layer_param {
    idx:88
    in_0 {name:"Node_89:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_89"
  type:"const"
  top:"Node_89"
  layer_param {
    idx:89
    out_0 {name:"Node_89:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_12"
  type:"var"
  top:"x_12"
  bottom:"Node_91"
  layer_param {
    idx:90
    in_0 {name:"Node_91:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_91"
  type:"const"
  top:"Node_91"
  layer_param {
    idx:91
    out_0 {name:"Node_91:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"x_13"
  type:"var"
  top:"x_13"
  bottom:"Node_109"
  layer_param {
    idx:92
    in_0 {name:"Node_109:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p0_5"
  type:"input"
  top:"p0_5"
  layer_param {
    idx:93
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_3"
  type:"input"
  top:"p1_3"
  layer_param {
    idx:94
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_3"
  type:"input"
  top:"p2_3"
  layer_param {
    idx:95
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_101"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_101"
  bottom:"p0_5"
  bottom:"p1_3"
  layer_param {
    idx:101
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_101:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_103"
  type:"add"
  top:"Node_103"
  bottom:"Node_101"
  bottom:"p2_3"
  layer_param {
    idx:103
    in_0 {name:"Node_101:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_103:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_104"
  type:"nn_relu"
  top:"Node_104"
  bottom:"Node_103"
  layer_param {
    idx:104
    in_0 {name:"Node_103:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_104:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_105"
  type:"function"
  top:"Node_105"
  bottom:"p0_5"
  bottom:"p1_3"
  bottom:"p2_3"
  bottom:"Node_104"
  layer_param {
    idx:105
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_104:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_105:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_109"
  type:"func_call"
  top:"Node_109"
  bottom:"x_10"
  bottom:"x_11"
  bottom:"x_12"
  bottom:"Node_105"
  layer_param {
    idx:109
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_105:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_109:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_14"
  type:"var"
  top:"x_14"
  bottom:"Node_111"
  layer_param {
    idx:110
    in_0 {name:"Node_111:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_111"
  type:"const"
  top:"Node_111"
  layer_param {
    idx:111
    out_0 {name:"Node_111:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_15"
  type:"var"
  top:"x_15"
  bottom:"Node_113"
  layer_param {
    idx:112
    in_0 {name:"Node_113:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_113"
  type:"const"
  top:"Node_113"
  layer_param {
    idx:113
    out_0 {name:"Node_113:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"x_16"
  type:"var"
  top:"x_16"
  bottom:"Node_136"
  layer_param {
    idx:114
    in_0 {name:"Node_136:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p0_6"
  type:"input"
  top:"p0_6"
  layer_param {
    idx:115
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_4"
  type:"input"
  top:"p1_4"
  layer_param {
    idx:116
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_4"
  type:"input"
  top:"p2_4"
  layer_param {
    idx:117
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"p3_1"
  type:"input"
  top:"p3_1"
  layer_param {
    idx:118
    out_0 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_125"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_125"
  bottom:"p0_6"
  bottom:"p1_4"
  layer_param {
    idx:125
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_125:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_127"
  type:"add"
  top:"Node_127"
  bottom:"Node_125"
  bottom:"p2_4"
  layer_param {
    idx:127
    in_0 {name:"Node_125:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_127:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_129"
  type:"add"
  top:"Node_129"
  bottom:"Node_127"
  bottom:"p3_1"
  layer_param {
    idx:129
    in_0 {name:"Node_127:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_129:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_130"
  type:"nn_relu"
  top:"Node_130"
  bottom:"Node_129"
  layer_param {
    idx:130
    in_0 {name:"Node_129:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_130:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_131"
  type:"function"
  top:"Node_131"
  bottom:"p0_6"
  bottom:"p1_4"
  bottom:"p2_4"
  bottom:"p3_1"
  bottom:"Node_130"
  layer_param {
    idx:131
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_4 {name:"Node_130:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_131:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_136"
  type:"func_call"
  top:"Node_136"
  bottom:"x_13"
  bottom:"x_14"
  bottom:"x_15"
  bottom:"x_10"
  bottom:"Node_131"
  layer_param {
    idx:136
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_4 {name:"Node_131:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_136:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_17"
  type:"var"
  top:"x_17"
  bottom:"Node_138"
  layer_param {
    idx:137
    in_0 {name:"Node_138:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_138"
  type:"const"
  top:"Node_138"
  layer_param {
    idx:138
    out_0 {name:"Node_138:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_18"
  type:"var"
  top:"x_18"
  bottom:"Node_140"
  layer_param {
    idx:139
    in_0 {name:"Node_140:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_140"
  type:"const"
  top:"Node_140"
  layer_param {
    idx:140
    out_0 {name:"Node_140:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"x_19"
  type:"var"
  top:"x_19"
  bottom:"Node_158"
  layer_param {
    idx:141
    in_0 {name:"Node_158:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p0_7"
  type:"input"
  top:"p0_7"
  layer_param {
    idx:142
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_5"
  type:"input"
  top:"p1_5"
  layer_param {
    idx:143
    out_0 {name:"p1:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_5"
  type:"input"
  top:"p2_5"
  layer_param {
    idx:144
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_150"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_150"
  bottom:"p0_7"
  bottom:"p1_5"
  layer_param {
    idx:150
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_150:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_152"
  type:"add"
  top:"Node_152"
  bottom:"Node_150"
  bottom:"p2_5"
  layer_param {
    idx:152
    in_0 {name:"Node_150:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_152:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_153"
  type:"nn_relu"
  top:"Node_153"
  bottom:"Node_152"
  layer_param {
    idx:153
    in_0 {name:"Node_152:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_153:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_154"
  type:"function"
  top:"Node_154"
  bottom:"p0_7"
  bottom:"p1_5"
  bottom:"p2_5"
  bottom:"Node_153"
  layer_param {
    idx:154
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_153:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_154:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_158"
  type:"func_call"
  top:"Node_158"
  bottom:"x_16"
  bottom:"x_17"
  bottom:"x_18"
  bottom:"Node_154"
  layer_param {
    idx:158
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_154:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_158:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_20"
  type:"var"
  top:"x_20"
  bottom:"Node_160"
  layer_param {
    idx:159
    in_0 {name:"Node_160:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_160"
  type:"const"
  top:"Node_160"
  layer_param {
    idx:160
    out_0 {name:"Node_160:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_21"
  type:"var"
  top:"x_21"
  bottom:"Node_162"
  layer_param {
    idx:161
    in_0 {name:"Node_162:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_162"
  type:"const"
  top:"Node_162"
  layer_param {
    idx:162
    out_0 {name:"Node_162:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"x_22"
  type:"var"
  top:"x_22"
  bottom:"Node_164"
  layer_param {
    idx:163
    in_0 {name:"Node_164:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
  }
}
layer {
  name:"Node_164"
  type:"const"
  top:"Node_164"
  layer_param {
    idx:164
    out_0 {name:"Node_164:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
  }
}
layer {
  name:"x_23"
  type:"var"
  top:"x_23"
  bottom:"Node_166"
  layer_param {
    idx:165
    in_0 {name:"Node_166:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_166"
  type:"const"
  top:"Node_166"
  layer_param {
    idx:166
    out_0 {name:"Node_166:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"x_24"
  type:"var"
  top:"x_24"
  bottom:"Node_182"
  layer_param {
    idx:167
    in_0 {name:"Node_182:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p0_8"
  type:"input"
  top:"p0_8"
  layer_param {
    idx:168
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_6"
  type:"input"
  top:"p1_6"
  layer_param {
    idx:169
    out_0 {name:"p1:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
  }
}
layer {
  name:"p2_6"
  type:"input"
  top:"p2_6"
  layer_param {
    idx:170
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_175"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_175"
  bottom:"p0_8"
  bottom:"p1_6"
  layer_param {
    idx:175
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
    out_0 {name:"Node_175:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [1, 1], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_177"
  type:"add"
  top:"Node_177"
  bottom:"Node_175"
  bottom:"p2_6"
  layer_param {
    idx:177
    in_0 {name:"Node_175:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_177:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_178"
  type:"function"
  top:"Node_178"
  bottom:"p0_8"
  bottom:"p1_6"
  bottom:"p2_6"
  bottom:"Node_177"
  layer_param {
    idx:178
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_177:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_178:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_182"
  type:"func_call"
  top:"Node_182"
  bottom:"x_16"
  bottom:"x_22"
  bottom:"x_23"
  bottom:"Node_178"
  layer_param {
    idx:182
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_178:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_182:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_25"
  type:"var"
  top:"x_25"
  bottom:"Node_205"
  layer_param {
    idx:183
    in_0 {name:"Node_205:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p0_9"
  type:"input"
  top:"p0_9"
  layer_param {
    idx:184
    out_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p1_7"
  type:"input"
  top:"p1_7"
  layer_param {
    idx:185
    out_0 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_7"
  type:"input"
  top:"p2_7"
  layer_param {
    idx:186
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"p3_2"
  type:"input"
  top:"p3_2"
  layer_param {
    idx:187
    out_0 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_194"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_194"
  bottom:"p0_9"
  bottom:"p1_7"
  layer_param {
    idx:194
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"Node_194:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_196"
  type:"add"
  top:"Node_196"
  bottom:"Node_194"
  bottom:"p2_7"
  layer_param {
    idx:196
    in_0 {name:"Node_194:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_196:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_198"
  type:"add"
  top:"Node_198"
  bottom:"Node_196"
  bottom:"p3_2"
  layer_param {
    idx:198
    in_0 {name:"Node_196:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_198:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_199"
  type:"nn_relu"
  top:"Node_199"
  bottom:"Node_198"
  layer_param {
    idx:199
    in_0 {name:"Node_198:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_199:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_200"
  type:"function"
  top:"Node_200"
  bottom:"p0_9"
  bottom:"p1_7"
  bottom:"p2_7"
  bottom:"p3_2"
  bottom:"Node_199"
  layer_param {
    idx:200
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_4 {name:"Node_199:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_200:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_205"
  type:"func_call"
  top:"Node_205"
  bottom:"x_19"
  bottom:"x_20"
  bottom:"x_21"
  bottom:"x_24"
  bottom:"Node_200"
  layer_param {
    idx:205
    in_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_4 {name:"Node_200:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_205:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_26"
  type:"var"
  top:"x_26"
  bottom:"Node_207"
  layer_param {
    idx:206
    in_0 {name:"Node_207:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_207"
  type:"const"
  top:"Node_207"
  layer_param {
    idx:207
    out_0 {name:"Node_207:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_27"
  type:"var"
  top:"x_27"
  bottom:"Node_209"
  layer_param {
    idx:208
    in_0 {name:"Node_209:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_209"
  type:"const"
  top:"Node_209"
  layer_param {
    idx:209
    out_0 {name:"Node_209:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"x_28"
  type:"var"
  top:"x_28"
  bottom:"Node_227"
  layer_param {
    idx:210
    in_0 {name:"Node_227:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p0_10"
  type:"input"
  top:"p0_10"
  layer_param {
    idx:211
    out_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p1_8"
  type:"input"
  top:"p1_8"
  layer_param {
    idx:212
    out_0 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_8"
  type:"input"
  top:"p2_8"
  layer_param {
    idx:213
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_219"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_219"
  bottom:"p0_10"
  bottom:"p1_8"
  layer_param {
    idx:219
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"Node_219:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_221"
  type:"add"
  top:"Node_221"
  bottom:"Node_219"
  bottom:"p2_8"
  layer_param {
    idx:221
    in_0 {name:"Node_219:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_221:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_222"
  type:"nn_relu"
  top:"Node_222"
  bottom:"Node_221"
  layer_param {
    idx:222
    in_0 {name:"Node_221:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_222:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_223"
  type:"function"
  top:"Node_223"
  bottom:"p0_10"
  bottom:"p1_8"
  bottom:"p2_8"
  bottom:"Node_222"
  layer_param {
    idx:223
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_222:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_223:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_227"
  type:"func_call"
  top:"Node_227"
  bottom:"x_25"
  bottom:"x_26"
  bottom:"x_27"
  bottom:"Node_223"
  layer_param {
    idx:227
    in_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_223:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_227:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_29"
  type:"var"
  top:"x_29"
  bottom:"Node_229"
  layer_param {
    idx:228
    in_0 {name:"Node_229:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_229"
  type:"const"
  top:"Node_229"
  layer_param {
    idx:229
    out_0 {name:"Node_229:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_30"
  type:"var"
  top:"x_30"
  bottom:"Node_231"
  layer_param {
    idx:230
    in_0 {name:"Node_231:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_231"
  type:"const"
  top:"Node_231"
  layer_param {
    idx:231
    out_0 {name:"Node_231:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"x_31"
  type:"var"
  top:"x_31"
  bottom:"Node_254"
  layer_param {
    idx:232
    in_0 {name:"Node_254:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p0_11"
  type:"input"
  top:"p0_11"
  layer_param {
    idx:233
    out_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p1_9"
  type:"input"
  top:"p1_9"
  layer_param {
    idx:234
    out_0 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_9"
  type:"input"
  top:"p2_9"
  layer_param {
    idx:235
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"p3_3"
  type:"input"
  top:"p3_3"
  layer_param {
    idx:236
    out_0 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_243"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_243"
  bottom:"p0_11"
  bottom:"p1_9"
  layer_param {
    idx:243
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"Node_243:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_245"
  type:"add"
  top:"Node_245"
  bottom:"Node_243"
  bottom:"p2_9"
  layer_param {
    idx:245
    in_0 {name:"Node_243:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_245:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_247"
  type:"add"
  top:"Node_247"
  bottom:"Node_245"
  bottom:"p3_3"
  layer_param {
    idx:247
    in_0 {name:"Node_245:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_247:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_248"
  type:"nn_relu"
  top:"Node_248"
  bottom:"Node_247"
  layer_param {
    idx:248
    in_0 {name:"Node_247:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_248:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_249"
  type:"function"
  top:"Node_249"
  bottom:"p0_11"
  bottom:"p1_9"
  bottom:"p2_9"
  bottom:"p3_3"
  bottom:"Node_248"
  layer_param {
    idx:249
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_4 {name:"Node_248:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_249:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_254"
  type:"func_call"
  top:"Node_254"
  bottom:"x_28"
  bottom:"x_29"
  bottom:"x_30"
  bottom:"x_25"
  bottom:"Node_249"
  layer_param {
    idx:254
    in_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_4 {name:"Node_249:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_254:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_32"
  type:"var"
  top:"x_32"
  bottom:"Node_256"
  layer_param {
    idx:255
    in_0 {name:"Node_256:0",dtype:float32,shape:[32, 16, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[32, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_256"
  type:"const"
  top:"Node_256"
  layer_param {
    idx:256
    out_0 {name:"Node_256:0",dtype:float32,shape:[32, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_33"
  type:"var"
  top:"x_33"
  bottom:"Node_258"
  layer_param {
    idx:257
    in_0 {name:"Node_258:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"Node_258"
  type:"const"
  top:"Node_258"
  layer_param {
    idx:258
    out_0 {name:"Node_258:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"x_34"
  type:"var"
  top:"x_34"
  bottom:"Node_276"
  layer_param {
    idx:259
    in_0 {name:"Node_276:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_12"
  type:"input"
  top:"p0_12"
  layer_param {
    idx:260
    out_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p1_10"
  type:"input"
  top:"p1_10"
  layer_param {
    idx:261
    out_0 {name:"p1:0",dtype:float32,shape:[32, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_10"
  type:"input"
  top:"p2_10"
  layer_param {
    idx:262
    out_0 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"Node_268"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_268"
  bottom:"p0_12"
  bottom:"p1_10"
  layer_param {
    idx:268
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[32, 16, 3, 3, 8, 8]}
    out_0 {name:"Node_268:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_270"
  type:"add"
  top:"Node_270"
  bottom:"Node_268"
  bottom:"p2_10"
  layer_param {
    idx:270
    in_0 {name:"Node_268:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"Node_270:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_271"
  type:"nn_relu"
  top:"Node_271"
  bottom:"Node_270"
  layer_param {
    idx:271
    in_0 {name:"Node_270:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_271:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_272"
  type:"function"
  top:"Node_272"
  bottom:"p0_12"
  bottom:"p1_10"
  bottom:"p2_10"
  bottom:"Node_271"
  layer_param {
    idx:272
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[32, 16, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    in_3 {name:"Node_271:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_272:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_276"
  type:"func_call"
  top:"Node_276"
  bottom:"x_31"
  bottom:"x_32"
  bottom:"x_33"
  bottom:"Node_272"
  layer_param {
    idx:276
    in_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[32, 16, 3, 3, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    in_3 {name:"Node_272:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_276:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"x_35"
  type:"var"
  top:"x_35"
  bottom:"Node_278"
  layer_param {
    idx:277
    in_0 {name:"Node_278:0",dtype:float32,shape:[32, 32, 3, 3, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[32, 32, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_278"
  type:"const"
  top:"Node_278"
  layer_param {
    idx:278
    out_0 {name:"Node_278:0",dtype:float32,shape:[32, 32, 3, 3, 8, 8]}
  }
}
layer {
  name:"x_36"
  type:"var"
  top:"x_36"
  bottom:"Node_280"
  layer_param {
    idx:279
    in_0 {name:"Node_280:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"Node_280"
  type:"const"
  top:"Node_280"
  layer_param {
    idx:280
    out_0 {name:"Node_280:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"x_37"
  type:"var"
  top:"x_37"
  bottom:"Node_282"
  layer_param {
    idx:281
    in_0 {name:"Node_282:0",dtype:float32,shape:[32, 16, 1, 1, 8, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[32, 16, 1, 1, 8, 8]}
  }
}
layer {
  name:"Node_282"
  type:"const"
  top:"Node_282"
  layer_param {
    idx:282
    out_0 {name:"Node_282:0",dtype:float32,shape:[32, 16, 1, 1, 8, 8]}
  }
}
layer {
  name:"x_38"
  type:"var"
  top:"x_38"
  bottom:"Node_284"
  layer_param {
    idx:283
    in_0 {name:"Node_284:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"Node_284"
  type:"const"
  top:"Node_284"
  layer_param {
    idx:284
    out_0 {name:"Node_284:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"x_39"
  type:"var"
  top:"x_39"
  bottom:"Node_300"
  layer_param {
    idx:285
    in_0 {name:"Node_300:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_13"
  type:"input"
  top:"p0_13"
  layer_param {
    idx:286
    out_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p1_11"
  type:"input"
  top:"p1_11"
  layer_param {
    idx:287
    out_0 {name:"p1:0",dtype:float32,shape:[32, 16, 1, 1, 8, 8]}
  }
}
layer {
  name:"p2_11"
  type:"input"
  top:"p2_11"
  layer_param {
    idx:288
    out_0 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"Node_293"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_293"
  bottom:"p0_13"
  bottom:"p1_11"
  layer_param {
    idx:293
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[32, 16, 1, 1, 8, 8]}
    out_0 {name:"Node_293:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [1, 1], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_295"
  type:"add"
  top:"Node_295"
  bottom:"Node_293"
  bottom:"p2_11"
  layer_param {
    idx:295
    in_0 {name:"Node_293:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"Node_295:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_296"
  type:"function"
  top:"Node_296"
  bottom:"p0_13"
  bottom:"p1_11"
  bottom:"p2_11"
  bottom:"Node_295"
  layer_param {
    idx:296
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[32, 16, 1, 1, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    in_3 {name:"Node_295:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_296:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_300"
  type:"func_call"
  top:"Node_300"
  bottom:"x_31"
  bottom:"x_37"
  bottom:"x_38"
  bottom:"Node_296"
  layer_param {
    idx:300
    in_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"x:0",dtype:float32,shape:[32, 16, 1, 1, 8, 8]}
    in_2 {name:"x:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    in_3 {name:"Node_296:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"Node_300:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"x_40"
  type:"var"
  top:"x_40"
  bottom:"Node_323"
  layer_param {
    idx:301
    in_0 {name:"Node_323:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p0_14"
  type:"input"
  top:"p0_14"
  layer_param {
    idx:302
    out_0 {name:"p0:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"p1_12"
  type:"input"
  top:"p1_12"
  layer_param {
    idx:303
    out_0 {name:"p1:0",dtype:float32,shape:[32, 32, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_12"
  type:"input"
  top:"p2_12"
  layer_param {
    idx:304
    out_0 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
  }
}
layer {
  name:"p3_4"
  type:"input"
  top:"p3_4"
  layer_param {
    idx:305
    out_0 {name:"p3:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_312"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_312"
  bottom:"p0_14"
  bottom:"p1_12"
  layer_param {
    idx:312
    in_0 {name:"p0:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[32, 32, 3, 3, 8, 8]}
    out_0 {name:"Node_312:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 256, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_314"
  type:"add"
  top:"Node_314"
  bottom:"Node_312"
  bottom:"p2_12"
  layer_param {
    idx:314
    in_0 {name:"Node_312:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 32, 1, 1, 8]}
    out_0 {name:"Node_314:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
  }
}
layer {
  name:"Node_316"
  type:"add"
  top:"Node_316"
  bottom:"Node_314"
  bottom:"p3_4"
  layer_param {
    idx:316
    in_0 {name:"Node_314:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 32, 14, 14, 8]}
