name : "relay_ir"
layer {
  name:"input0"
  type:"input"
  top:"input0"
  layer_param {
    idx:0
    out_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"storage_0"
  type:"var"
  top:"storage_0"
  bottom:"Node_2"
  layer_param {
    idx:1
    in_0 {name:"Node_2:0",dtype:float32,shape:[602112, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_2"
  type:"memory_alloc_storage"
  top:"Node_2"
  layer_param {
    idx:2
    out_0 {name:"Node_2:0",dtype:float32,shape:[602112, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0"
  type:"var"
  top:"tensor_0"
  bottom:"Node_5"
  layer_param {
    idx:3
    in_0 {name:"Node_5:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"Node_5"
  type:"memory_alloc_tensor"
  top:"Node_5"
  bottom:"storage_0"
  layer_param {
    idx:5
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_5:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 1, 224, 224, 3]}
  }
}
layer {
  name:"x"
  type:"var"
  top:"x"
  bottom:"Node_17"
  layer_param {
    idx:6
    in_0 {name:"Node_17:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0"
  type:"input"
  top:"p0"
  layer_param {
    idx:8
    out_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
  }
}
layer {
  name:"Node_11"
  type:"layout_transform"
  top:"Node_11"
  bottom:"p0"
  layer_param {
    idx:11
    in_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
    out_0 {name:"Node_11:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    attrs {'src_layout': 'NCHW', 'dst_layout': 'NCHW3c'}
  }
}
layer {
  name:"Node_12"
  type:"function"
  top:"Node_12"
  bottom:"p0"
  bottom:"Node_11"
  layer_param {
    idx:12
    in_0 {name:"p0:0",dtype:float32,shape:[1, 3, 224, 224]}
    in_1 {name:"Node_11:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"Node_12:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"Node_14"
  type:"tuple"
  top:"Node_14"
  bottom:"input0"
  layer_param {
    idx:14
    in_0 {name:"input0:0",dtype:float32,shape:[1, 3, 224, 224]}
    out_0 {name:"Node_14:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_16"
  type:"tuple"
  top:"Node_16"
  bottom:"tensor_0"
  layer_param {
    idx:16
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"Node_16:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_17"
  type:"vm_invoke_tvm_op"
  top:"Node_17"
  bottom:"Node_12"
  bottom:"Node_14"
  bottom:"Node_16"
  layer_param {
    idx:17
    in_0 {name:"Node_12:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"Node_14:0",dtype:,shape:[]}
    in_2 {name:"Node_16:0",dtype:,shape:[]}
    out_0 {name:"Node_17:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_1"
  type:"var"
  top:"x_1"
  bottom:"tensor_0"
  layer_param {
    idx:18
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"storage_0_1"
  type:"var"
  top:"storage_0_1"
  bottom:"Node_21"
  layer_param {
    idx:20
    in_0 {name:"Node_21:0",dtype:float32,shape:[3211264, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_21"
  type:"memory_alloc_storage"
  top:"Node_21"
  layer_param {
    idx:21
    out_0 {name:"Node_21:0",dtype:float32,shape:[3211264, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_1"
  type:"var"
  top:"tensor_0_1"
  bottom:"Node_24"
  layer_param {
    idx:22
    in_0 {name:"Node_24:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_24"
  type:"memory_alloc_tensor"
  top:"Node_24"
  bottom:"storage_0_1"
  layer_param {
    idx:24
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_24:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 8, 112, 112, 8]}
  }
}
layer {
  name:"x_2"
  type:"var"
  top:"x_2"
  bottom:"Node_46"
  layer_param {
    idx:25
    in_0 {name:"Node_46:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_1"
  type:"input"
  top:"p0_1"
  layer_param {
    idx:27
    out_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
  }
}
layer {
  name:"p1"
  type:"input"
  top:"p1"
  layer_param {
    idx:28
    out_0 {name:"p1:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
  }
}
layer {
  name:"p2"
  type:"input"
  top:"p2"
  layer_param {
    idx:29
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_35"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_35"
  bottom:"p0_1"
  bottom:"p1"
  layer_param {
    idx:35
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
    out_0 {name:"Node_35:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    attrs {'strides': [2, 2], 'padding': [3, 3, 3, 3], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [7, 7], 'data_layout': 'NCHW3c', 'kernel_layout': 'OIHW3i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_37"
  type:"add"
  top:"Node_37"
  bottom:"Node_35"
  bottom:"p2"
  layer_param {
    idx:37
    in_0 {name:"Node_35:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_37:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_38"
  type:"nn_relu"
  top:"Node_38"
  bottom:"Node_37"
  layer_param {
    idx:38
    in_0 {name:"Node_37:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_38:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_39"
  type:"function"
  top:"Node_39"
  bottom:"p0_1"
  bottom:"p1"
  bottom:"p2"
  bottom:"Node_38"
  layer_param {
    idx:39
    in_0 {name:"p0:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_38:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_39:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_41"
  type:"const"
  top:"Node_41"
  layer_param {
    idx:41
    out_0 {name:"Node_41:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
  }
}
layer {
  name:"Node_42"
  type:"const"
  top:"Node_42"
  layer_param {
    idx:42
    out_0 {name:"Node_42:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_43"
  type:"tuple"
  top:"Node_43"
  bottom:"x_1"
  bottom:"Node_41"
  bottom:"Node_42"
  layer_param {
    idx:43
    in_0 {name:"x:0",dtype:float32,shape:[1, 1, 224, 224, 3]}
    in_1 {name:"Node_41:0",dtype:float32,shape:[8, 1, 7, 7, 3, 8]}
    in_2 {name:"Node_42:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_43:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_45"
  type:"tuple"
  top:"Node_45"
  bottom:"tensor_0_1"
  layer_param {
    idx:45
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_45:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_46"
  type:"vm_invoke_tvm_op"
  top:"Node_46"
  bottom:"Node_39"
  bottom:"Node_43"
  bottom:"Node_45"
  layer_param {
    idx:46
    in_0 {name:"Node_39:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    in_1 {name:"Node_43:0",dtype:,shape:[]}
    in_2 {name:"Node_45:0",dtype:,shape:[]}
    out_0 {name:"Node_46:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_3"
  type:"var"
  top:"x_3"
  bottom:"tensor_0_1"
  layer_param {
    idx:47
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"storage_0_2"
  type:"var"
  top:"storage_0_2"
  bottom:"Node_50"
  layer_param {
    idx:49
    in_0 {name:"Node_50:0",dtype:float32,shape:[802816, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_50"
  type:"memory_alloc_storage"
  top:"Node_50"
  layer_param {
    idx:50
    out_0 {name:"Node_50:0",dtype:float32,shape:[802816, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_2"
  type:"var"
  top:"tensor_0_2"
  bottom:"Node_53"
  layer_param {
    idx:51
    in_0 {name:"Node_53:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_53"
  type:"memory_alloc_tensor"
  top:"Node_53"
  bottom:"storage_0_2"
  layer_param {
    idx:53
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_53:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_4"
  type:"var"
  top:"x_4"
  bottom:"Node_65"
  layer_param {
    idx:54
    in_0 {name:"Node_65:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_2"
  type:"input"
  top:"p0_2"
  layer_param {
    idx:56
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
  }
}
layer {
  name:"Node_59"
  type:"nn_max_pool2d"
  top:"Node_59"
  bottom:"p0_2"
  layer_param {
    idx:59
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_59:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'pool_size': [3, 3], 'strides': [2, 2], 'padding': [1, 1, 1, 1], 'layout': 'NCHW8c', 'ceil_mode': 0}
  }
}
layer {
  name:"Node_60"
  type:"function"
  top:"Node_60"
  bottom:"p0_2"
  bottom:"Node_59"
  layer_param {
    idx:60
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    in_1 {name:"Node_59:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_60:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_62"
  type:"tuple"
  top:"Node_62"
  bottom:"x_3"
  layer_param {
    idx:62
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 112, 112, 8]}
    out_0 {name:"Node_62:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_64"
  type:"tuple"
  top:"Node_64"
  bottom:"tensor_0_2"
  layer_param {
    idx:64
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_64:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_65"
  type:"vm_invoke_tvm_op"
  top:"Node_65"
  bottom:"Node_60"
  bottom:"Node_62"
  bottom:"Node_64"
  layer_param {
    idx:65
    in_0 {name:"Node_60:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_62:0",dtype:,shape:[]}
    in_2 {name:"Node_64:0",dtype:,shape:[]}
    out_0 {name:"Node_65:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_5"
  type:"var"
  top:"x_5"
  bottom:"tensor_0_2"
  layer_param {
    idx:66
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"storage_0_3"
  type:"var"
  top:"storage_0_3"
  bottom:"Node_69"
  layer_param {
    idx:68
    in_0 {name:"Node_69:0",dtype:float32,shape:[802816, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_69"
  type:"memory_alloc_storage"
  top:"Node_69"
  layer_param {
    idx:69
    out_0 {name:"Node_69:0",dtype:float32,shape:[802816, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_3"
  type:"var"
  top:"tensor_0_3"
  bottom:"Node_72"
  layer_param {
    idx:70
    in_0 {name:"Node_72:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_72"
  type:"memory_alloc_tensor"
  top:"Node_72"
  bottom:"storage_0_3"
  layer_param {
    idx:72
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_72:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_6"
  type:"var"
  top:"x_6"
  bottom:"Node_94"
  layer_param {
    idx:73
    in_0 {name:"Node_94:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_3"
  type:"input"
  top:"p0_3"
  layer_param {
    idx:75
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_1"
  type:"input"
  top:"p1_1"
  layer_param {
    idx:76
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_1"
  type:"input"
  top:"p2_1"
  layer_param {
    idx:77
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_83"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_83"
  bottom:"p0_3"
  bottom:"p1_1"
  layer_param {
    idx:83
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_83:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_85"
  type:"add"
  top:"Node_85"
  bottom:"Node_83"
  bottom:"p2_1"
  layer_param {
    idx:85
    in_0 {name:"Node_83:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_85:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_86"
  type:"nn_relu"
  top:"Node_86"
  bottom:"Node_85"
  layer_param {
    idx:86
    in_0 {name:"Node_85:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_86:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_87"
  type:"function"
  top:"Node_87"
  bottom:"p0_3"
  bottom:"p1_1"
  bottom:"p2_1"
  bottom:"Node_86"
  layer_param {
    idx:87
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_86:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_87:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_89"
  type:"const"
  top:"Node_89"
  layer_param {
    idx:89
    out_0 {name:"Node_89:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_90"
  type:"const"
  top:"Node_90"
  layer_param {
    idx:90
    out_0 {name:"Node_90:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_91"
  type:"tuple"
  top:"Node_91"
  bottom:"x_5"
  bottom:"Node_89"
  bottom:"Node_90"
  layer_param {
    idx:91
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_89:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"Node_90:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_91:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_93"
  type:"tuple"
  top:"Node_93"
  bottom:"tensor_0_3"
  layer_param {
    idx:93
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_93:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_94"
  type:"vm_invoke_tvm_op"
  top:"Node_94"
  bottom:"Node_87"
  bottom:"Node_91"
  bottom:"Node_93"
  layer_param {
    idx:94
    in_0 {name:"Node_87:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_91:0",dtype:,shape:[]}
    in_2 {name:"Node_93:0",dtype:,shape:[]}
    out_0 {name:"Node_94:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_7"
  type:"var"
  top:"x_7"
  bottom:"tensor_0_3"
  layer_param {
    idx:95
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"storage_0_4"
  type:"var"
  top:"storage_0_4"
  bottom:"Node_98"
  layer_param {
    idx:97
    in_0 {name:"Node_98:0",dtype:float32,shape:[802816, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_98"
  type:"memory_alloc_storage"
  top:"Node_98"
  layer_param {
    idx:98
    out_0 {name:"Node_98:0",dtype:float32,shape:[802816, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_4"
  type:"var"
  top:"tensor_0_4"
  bottom:"Node_101"
  layer_param {
    idx:99
    in_0 {name:"Node_101:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_101"
  type:"memory_alloc_tensor"
  top:"Node_101"
  bottom:"storage_0_4"
  layer_param {
    idx:101
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_101:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_8"
  type:"var"
  top:"x_8"
  bottom:"Node_128"
  layer_param {
    idx:102
    in_0 {name:"Node_128:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_4"
  type:"input"
  top:"p0_4"
  layer_param {
    idx:104
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_2"
  type:"input"
  top:"p1_2"
  layer_param {
    idx:105
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_2"
  type:"input"
  top:"p2_2"
  layer_param {
    idx:106
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"p3"
  type:"input"
  top:"p3"
  layer_param {
    idx:107
    out_0 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_114"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_114"
  bottom:"p0_4"
  bottom:"p1_2"
  layer_param {
    idx:114
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_114:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_116"
  type:"add"
  top:"Node_116"
  bottom:"Node_114"
  bottom:"p2_2"
  layer_param {
    idx:116
    in_0 {name:"Node_114:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_116:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_118"
  type:"add"
  top:"Node_118"
  bottom:"Node_116"
  bottom:"p3"
  layer_param {
    idx:118
    in_0 {name:"Node_116:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_118:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_119"
  type:"nn_relu"
  top:"Node_119"
  bottom:"Node_118"
  layer_param {
    idx:119
    in_0 {name:"Node_118:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_119:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_120"
  type:"function"
  top:"Node_120"
  bottom:"p0_4"
  bottom:"p1_2"
  bottom:"p2_2"
  bottom:"p3"
  bottom:"Node_119"
  layer_param {
    idx:120
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_4 {name:"Node_119:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_120:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_122"
  type:"const"
  top:"Node_122"
  layer_param {
    idx:122
    out_0 {name:"Node_122:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_123"
  type:"const"
  top:"Node_123"
  layer_param {
    idx:123
    out_0 {name:"Node_123:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_125"
  type:"tuple"
  top:"Node_125"
  bottom:"x_7"
  bottom:"Node_122"
  bottom:"Node_123"
  bottom:"x_5"
  layer_param {
    idx:125
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_122:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"Node_123:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_125:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_127"
  type:"tuple"
  top:"Node_127"
  bottom:"tensor_0_4"
  layer_param {
    idx:127
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_127:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_128"
  type:"vm_invoke_tvm_op"
  top:"Node_128"
  bottom:"Node_120"
  bottom:"Node_125"
  bottom:"Node_127"
  layer_param {
    idx:128
    in_0 {name:"Node_120:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_125:0",dtype:,shape:[]}
    in_2 {name:"Node_127:0",dtype:,shape:[]}
    out_0 {name:"Node_128:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_9"
  type:"var"
  top:"x_9"
  bottom:"tensor_0_4"
  layer_param {
    idx:129
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"storage_0_5"
  type:"var"
  top:"storage_0_5"
  bottom:"Node_132"
  layer_param {
    idx:131
    in_0 {name:"Node_132:0",dtype:float32,shape:[802816, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_132"
  type:"memory_alloc_storage"
  top:"Node_132"
  layer_param {
    idx:132
    out_0 {name:"Node_132:0",dtype:float32,shape:[802816, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_5"
  type:"var"
  top:"tensor_0_5"
  bottom:"Node_135"
  layer_param {
    idx:133
    in_0 {name:"Node_135:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_135"
  type:"memory_alloc_tensor"
  top:"Node_135"
  bottom:"storage_0_5"
  layer_param {
    idx:135
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_135:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_10"
  type:"var"
  top:"x_10"
  bottom:"Node_157"
  layer_param {
    idx:136
    in_0 {name:"Node_157:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_5"
  type:"input"
  top:"p0_5"
  layer_param {
    idx:138
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_3"
  type:"input"
  top:"p1_3"
  layer_param {
    idx:139
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_3"
  type:"input"
  top:"p2_3"
  layer_param {
    idx:140
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_146"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_146"
  bottom:"p0_5"
  bottom:"p1_3"
  layer_param {
    idx:146
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_146:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_148"
  type:"add"
  top:"Node_148"
  bottom:"Node_146"
  bottom:"p2_3"
  layer_param {
    idx:148
    in_0 {name:"Node_146:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_148:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_149"
  type:"nn_relu"
  top:"Node_149"
  bottom:"Node_148"
  layer_param {
    idx:149
    in_0 {name:"Node_148:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_149:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_150"
  type:"function"
  top:"Node_150"
  bottom:"p0_5"
  bottom:"p1_3"
  bottom:"p2_3"
  bottom:"Node_149"
  layer_param {
    idx:150
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"Node_149:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_150:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_152"
  type:"const"
  top:"Node_152"
  layer_param {
    idx:152
    out_0 {name:"Node_152:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_153"
  type:"const"
  top:"Node_153"
  layer_param {
    idx:153
    out_0 {name:"Node_153:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_154"
  type:"tuple"
  top:"Node_154"
  bottom:"x_9"
  bottom:"Node_152"
  bottom:"Node_153"
  layer_param {
    idx:154
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_152:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"Node_153:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_154:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_156"
  type:"tuple"
  top:"Node_156"
  bottom:"tensor_0_5"
  layer_param {
    idx:156
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_156:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_157"
  type:"vm_invoke_tvm_op"
  top:"Node_157"
  bottom:"Node_150"
  bottom:"Node_154"
  bottom:"Node_156"
  layer_param {
    idx:157
    in_0 {name:"Node_150:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_154:0",dtype:,shape:[]}
    in_2 {name:"Node_156:0",dtype:,shape:[]}
    out_0 {name:"Node_157:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_11"
  type:"var"
  top:"x_11"
  bottom:"tensor_0_5"
  layer_param {
    idx:158
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"storage_0_6"
  type:"var"
  top:"storage_0_6"
  bottom:"Node_161"
  layer_param {
    idx:160
    in_0 {name:"Node_161:0",dtype:float32,shape:[802816, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_161"
  type:"memory_alloc_storage"
  top:"Node_161"
  layer_param {
    idx:161
    out_0 {name:"Node_161:0",dtype:float32,shape:[802816, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_6"
  type:"var"
  top:"tensor_0_6"
  bottom:"Node_164"
  layer_param {
    idx:162
    in_0 {name:"Node_164:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_164"
  type:"memory_alloc_tensor"
  top:"Node_164"
  bottom:"storage_0_6"
  layer_param {
    idx:164
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_164:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 8, 56, 56, 8]}
  }
}
layer {
  name:"x_12"
  type:"var"
  top:"x_12"
  bottom:"Node_191"
  layer_param {
    idx:165
    in_0 {name:"Node_191:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_6"
  type:"input"
  top:"p0_6"
  layer_param {
    idx:167
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_4"
  type:"input"
  top:"p1_4"
  layer_param {
    idx:168
    out_0 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_4"
  type:"input"
  top:"p2_4"
  layer_param {
    idx:169
    out_0 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"p3_1"
  type:"input"
  top:"p3_1"
  layer_param {
    idx:170
    out_0 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_177"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_177"
  bottom:"p0_6"
  bottom:"p1_4"
  layer_param {
    idx:177
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_177:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 64, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_179"
  type:"add"
  top:"Node_179"
  bottom:"Node_177"
  bottom:"p2_4"
  layer_param {
    idx:179
    in_0 {name:"Node_177:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    out_0 {name:"Node_179:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_181"
  type:"add"
  top:"Node_181"
  bottom:"Node_179"
  bottom:"p3_1"
  layer_param {
    idx:181
    in_0 {name:"Node_179:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_181:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_182"
  type:"nn_relu"
  top:"Node_182"
  bottom:"Node_181"
  layer_param {
    idx:182
    in_0 {name:"Node_181:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_182:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_183"
  type:"function"
  top:"Node_183"
  bottom:"p0_6"
  bottom:"p1_4"
  bottom:"p2_4"
  bottom:"p3_1"
  bottom:"Node_182"
  layer_param {
    idx:183
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_4 {name:"Node_182:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_183:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"Node_185"
  type:"const"
  top:"Node_185"
  layer_param {
    idx:185
    out_0 {name:"Node_185:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_186"
  type:"const"
  top:"Node_186"
  layer_param {
    idx:186
    out_0 {name:"Node_186:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
  }
}
layer {
  name:"Node_188"
  type:"tuple"
  top:"Node_188"
  bottom:"x_11"
  bottom:"Node_185"
  bottom:"Node_186"
  bottom:"x_9"
  layer_param {
    idx:188
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_185:0",dtype:float32,shape:[8, 8, 3, 3, 8, 8]}
    in_2 {name:"Node_186:0",dtype:float32,shape:[1, 8, 1, 1, 8]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_188:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_190"
  type:"tuple"
  top:"Node_190"
  bottom:"tensor_0_6"
  layer_param {
    idx:190
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"Node_190:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_191"
  type:"vm_invoke_tvm_op"
  top:"Node_191"
  bottom:"Node_183"
  bottom:"Node_188"
  bottom:"Node_190"
  layer_param {
    idx:191
    in_0 {name:"Node_183:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_188:0",dtype:,shape:[]}
    in_2 {name:"Node_190:0",dtype:,shape:[]}
    out_0 {name:"Node_191:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_13"
  type:"var"
  top:"x_13"
  bottom:"tensor_0_6"
  layer_param {
    idx:192
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"storage_0_7"
  type:"var"
  top:"storage_0_7"
  bottom:"Node_195"
  layer_param {
    idx:194
    in_0 {name:"Node_195:0",dtype:float32,shape:[401408, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_195"
  type:"memory_alloc_storage"
  top:"Node_195"
  layer_param {
    idx:195
    out_0 {name:"Node_195:0",dtype:float32,shape:[401408, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_7"
  type:"var"
  top:"tensor_0_7"
  bottom:"Node_198"
  layer_param {
    idx:196
    in_0 {name:"Node_198:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_198"
  type:"memory_alloc_tensor"
  top:"Node_198"
  bottom:"storage_0_7"
  layer_param {
    idx:198
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_198:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_14"
  type:"var"
  top:"x_14"
  bottom:"Node_220"
  layer_param {
    idx:199
    in_0 {name:"Node_220:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_7"
  type:"input"
  top:"p0_7"
  layer_param {
    idx:201
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_5"
  type:"input"
  top:"p1_5"
  layer_param {
    idx:202
    out_0 {name:"p1:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_5"
  type:"input"
  top:"p2_5"
  layer_param {
    idx:203
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_209"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_209"
  bottom:"p0_7"
  bottom:"p1_5"
  layer_param {
    idx:209
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
    out_0 {name:"Node_209:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [2, 2], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_211"
  type:"add"
  top:"Node_211"
  bottom:"Node_209"
  bottom:"p2_5"
  layer_param {
    idx:211
    in_0 {name:"Node_209:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_211:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_212"
  type:"nn_relu"
  top:"Node_212"
  bottom:"Node_211"
  layer_param {
    idx:212
    in_0 {name:"Node_211:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_212:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_213"
  type:"function"
  top:"Node_213"
  bottom:"p0_7"
  bottom:"p1_5"
  bottom:"p2_5"
  bottom:"Node_212"
  layer_param {
    idx:213
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_212:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_213:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_215"
  type:"const"
  top:"Node_215"
  layer_param {
    idx:215
    out_0 {name:"Node_215:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_216"
  type:"const"
  top:"Node_216"
  layer_param {
    idx:216
    out_0 {name:"Node_216:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_217"
  type:"tuple"
  top:"Node_217"
  bottom:"x_13"
  bottom:"Node_215"
  bottom:"Node_216"
  layer_param {
    idx:217
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_215:0",dtype:float32,shape:[16, 8, 3, 3, 8, 8]}
    in_2 {name:"Node_216:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_217:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_219"
  type:"tuple"
  top:"Node_219"
  bottom:"tensor_0_7"
  layer_param {
    idx:219
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_219:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_220"
  type:"vm_invoke_tvm_op"
  top:"Node_220"
  bottom:"Node_213"
  bottom:"Node_217"
  bottom:"Node_219"
  layer_param {
    idx:220
    in_0 {name:"Node_213:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"Node_217:0",dtype:,shape:[]}
    in_2 {name:"Node_219:0",dtype:,shape:[]}
    out_0 {name:"Node_220:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_15"
  type:"var"
  top:"x_15"
  bottom:"tensor_0_7"
  layer_param {
    idx:221
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"storage_0_8"
  type:"var"
  top:"storage_0_8"
  bottom:"Node_224"
  layer_param {
    idx:223
    in_0 {name:"Node_224:0",dtype:float32,shape:[401408, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_224"
  type:"memory_alloc_storage"
  top:"Node_224"
  layer_param {
    idx:224
    out_0 {name:"Node_224:0",dtype:float32,shape:[401408, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_8"
  type:"var"
  top:"tensor_0_8"
  bottom:"Node_227"
  layer_param {
    idx:225
    in_0 {name:"Node_227:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_227"
  type:"memory_alloc_tensor"
  top:"Node_227"
  bottom:"storage_0_8"
  layer_param {
    idx:227
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_227:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_16"
  type:"var"
  top:"x_16"
  bottom:"Node_247"
  layer_param {
    idx:228
    in_0 {name:"Node_247:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_8"
  type:"input"
  top:"p0_8"
  layer_param {
    idx:230
    out_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
  }
}
layer {
  name:"p1_6"
  type:"input"
  top:"p1_6"
  layer_param {
    idx:231
    out_0 {name:"p1:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
  }
}
layer {
  name:"p2_6"
  type:"input"
  top:"p2_6"
  layer_param {
    idx:232
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_237"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_237"
  bottom:"p0_8"
  bottom:"p1_6"
  layer_param {
    idx:237
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
    out_0 {name:"Node_237:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [2, 2], 'padding': [0, 0, 0, 0], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [1, 1], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_239"
  type:"add"
  top:"Node_239"
  bottom:"Node_237"
  bottom:"p2_6"
  layer_param {
    idx:239
    in_0 {name:"Node_237:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_239:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_240"
  type:"function"
  top:"Node_240"
  bottom:"p0_8"
  bottom:"p1_6"
  bottom:"p2_6"
  bottom:"Node_239"
  layer_param {
    idx:240
    in_0 {name:"p0:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_239:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_240:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_242"
  type:"const"
  top:"Node_242"
  layer_param {
    idx:242
    out_0 {name:"Node_242:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
  }
}
layer {
  name:"Node_243"
  type:"const"
  top:"Node_243"
  layer_param {
    idx:243
    out_0 {name:"Node_243:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_244"
  type:"tuple"
  top:"Node_244"
  bottom:"x_13"
  bottom:"Node_242"
  bottom:"Node_243"
  layer_param {
    idx:244
    in_0 {name:"x:0",dtype:float32,shape:[1, 8, 56, 56, 8]}
    in_1 {name:"Node_242:0",dtype:float32,shape:[16, 8, 1, 1, 8, 8]}
    in_2 {name:"Node_243:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_244:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_246"
  type:"tuple"
  top:"Node_246"
  bottom:"tensor_0_8"
  layer_param {
    idx:246
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_246:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_247"
  type:"vm_invoke_tvm_op"
  top:"Node_247"
  bottom:"Node_240"
  bottom:"Node_244"
  bottom:"Node_246"
  layer_param {
    idx:247
    in_0 {name:"Node_240:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"Node_244:0",dtype:,shape:[]}
    in_2 {name:"Node_246:0",dtype:,shape:[]}
    out_0 {name:"Node_247:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_17"
  type:"var"
  top:"x_17"
  bottom:"tensor_0_8"
  layer_param {
    idx:248
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"storage_0_9"
  type:"var"
  top:"storage_0_9"
  bottom:"Node_251"
  layer_param {
    idx:250
    in_0 {name:"Node_251:0",dtype:float32,shape:[401408, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_251"
  type:"memory_alloc_storage"
  top:"Node_251"
  layer_param {
    idx:251
    out_0 {name:"Node_251:0",dtype:float32,shape:[401408, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_9"
  type:"var"
  top:"tensor_0_9"
  bottom:"Node_254"
  layer_param {
    idx:252
    in_0 {name:"Node_254:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_254"
  type:"memory_alloc_tensor"
  top:"Node_254"
  bottom:"storage_0_9"
  layer_param {
    idx:254
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_254:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_18"
  type:"var"
  top:"x_18"
  bottom:"Node_281"
  layer_param {
    idx:255
    in_0 {name:"Node_281:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_9"
  type:"input"
  top:"p0_9"
  layer_param {
    idx:257
    out_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p1_7"
  type:"input"
  top:"p1_7"
  layer_param {
    idx:258
    out_0 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_7"
  type:"input"
  top:"p2_7"
  layer_param {
    idx:259
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"p3_2"
  type:"input"
  top:"p3_2"
  layer_param {
    idx:260
    out_0 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_267"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_267"
  bottom:"p0_9"
  bottom:"p1_7"
  layer_param {
    idx:267
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"Node_267:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_269"
  type:"add"
  top:"Node_269"
  bottom:"Node_267"
  bottom:"p2_7"
  layer_param {
    idx:269
    in_0 {name:"Node_267:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_269:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_271"
  type:"add"
  top:"Node_271"
  bottom:"Node_269"
  bottom:"p3_2"
  layer_param {
    idx:271
    in_0 {name:"Node_269:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_271:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_272"
  type:"nn_relu"
  top:"Node_272"
  bottom:"Node_271"
  layer_param {
    idx:272
    in_0 {name:"Node_271:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_272:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_273"
  type:"function"
  top:"Node_273"
  bottom:"p0_9"
  bottom:"p1_7"
  bottom:"p2_7"
  bottom:"p3_2"
  bottom:"Node_272"
  layer_param {
    idx:273
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"p3:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_4 {name:"Node_272:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_273:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_275"
  type:"const"
  top:"Node_275"
  layer_param {
    idx:275
    out_0 {name:"Node_275:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_276"
  type:"const"
  top:"Node_276"
  layer_param {
    idx:276
    out_0 {name:"Node_276:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_278"
  type:"tuple"
  top:"Node_278"
  bottom:"x_15"
  bottom:"Node_275"
  bottom:"Node_276"
  bottom:"x_17"
  layer_param {
    idx:278
    in_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"Node_275:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"Node_276:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_278:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_280"
  type:"tuple"
  top:"Node_280"
  bottom:"tensor_0_9"
  layer_param {
    idx:280
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_280:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_281"
  type:"vm_invoke_tvm_op"
  top:"Node_281"
  bottom:"Node_273"
  bottom:"Node_278"
  bottom:"Node_280"
  layer_param {
    idx:281
    in_0 {name:"Node_273:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"Node_278:0",dtype:,shape:[]}
    in_2 {name:"Node_280:0",dtype:,shape:[]}
    out_0 {name:"Node_281:0",dtype:,shape:[]}
  }
}
layer {
  name:"x_19"
  type:"var"
  top:"x_19"
  bottom:"tensor_0_9"
  layer_param {
    idx:282
    in_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"storage_0_10"
  type:"var"
  top:"storage_0_10"
  bottom:"Node_285"
  layer_param {
    idx:284
    in_0 {name:"Node_285:0",dtype:float32,shape:[401408, 64]}
    out_0 {name:"storage_0:0",dtype:,shape:[]}
  }
}
layer {
  name:"Node_285"
  type:"memory_alloc_storage"
  top:"Node_285"
  layer_param {
    idx:285
    out_0 {name:"Node_285:0",dtype:float32,shape:[401408, 64]}
    attrs {'dtype': 'float32', 'device_id': 0, 'device_type': 1}
  }
}
layer {
  name:"tensor_0_10"
  type:"var"
  top:"tensor_0_10"
  bottom:"Node_288"
  layer_param {
    idx:286
    in_0 {name:"Node_288:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"tensor_0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_288"
  type:"memory_alloc_tensor"
  top:"Node_288"
  bottom:"storage_0_10"
  layer_param {
    idx:288
    in_0 {name:"storage_0:0",dtype:,shape:[]}
    out_0 {name:"Node_288:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'dtype': 'float32', 'const_shape': None, 'assert_shape': [1, 16, 28, 28, 8]}
  }
}
layer {
  name:"x_20"
  type:"var"
  top:"x_20"
  bottom:"Node_310"
  layer_param {
    idx:289
    in_0 {name:"Node_310:0",dtype:,shape:[]}
    out_0 {name:"x:0",dtype:,shape:[]}
  }
}
layer {
  name:"p0_10"
  type:"input"
  top:"p0_10"
  layer_param {
    idx:291
    out_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"p1_8"
  type:"input"
  top:"p1_8"
  layer_param {
    idx:292
    out_0 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"p2_8"
  type:"input"
  top:"p2_8"
  layer_param {
    idx:293
    out_0 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_299"
  type:"nn_contrib_conv2d_NCHWc"
  top:"Node_299"
  bottom:"p0_10"
  bottom:"p1_8"
  layer_param {
    idx:299
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    out_0 {name:"Node_299:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    attrs {'strides': [1, 1], 'padding': [1, 1, 1, 1], 'dilation': [1, 1], 'groups': 1, 'channels': 128, 'kernel_size': [3, 3], 'data_layout': 'NCHW8c', 'kernel_layout': 'OIHW8i8o', 'out_layout': 'NCHW8c', 'out_dtype': ''}
  }
}
layer {
  name:"Node_301"
  type:"add"
  top:"Node_301"
  bottom:"Node_299"
  bottom:"p2_8"
  layer_param {
    idx:301
    in_0 {name:"Node_299:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    out_0 {name:"Node_301:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_302"
  type:"nn_relu"
  top:"Node_302"
  bottom:"Node_301"
  layer_param {
    idx:302
    in_0 {name:"Node_301:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_302:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_303"
  type:"function"
  top:"Node_303"
  bottom:"p0_10"
  bottom:"p1_8"
  bottom:"p2_8"
  bottom:"Node_302"
  layer_param {
    idx:303
    in_0 {name:"p0:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    in_1 {name:"p1:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
    in_2 {name:"p2:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
    in_3 {name:"Node_302:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
    out_0 {name:"Node_303:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
  }
}
layer {
  name:"Node_305"
  type:"const"
  top:"Node_305"
  layer_param {
    idx:305
    out_0 {name:"Node_305:0",dtype:float32,shape:[16, 16, 3, 3, 8, 8]}
  }
}
layer {
  name:"Node_306"
  type:"const"
  top:"Node_306"
  layer_param {
    idx:306
    out_0 {name:"Node_306:0",dtype:float32,shape:[1, 16, 1, 1, 8]}
  }
}
layer {
  name:"Node_307"
  type:"tuple"
  top:"Node_307"
  bottom:"x_19"
  bottom:"Node_305"
  bottom:"Node_306"
  layer_param {
    idx:307
    in_0 {name:"x:0",dtype:float32,shape:[1, 16, 28, 28, 8]}
